{
    "cik": 1559720,
    "cusip6": "009066",
    "cusip": [
        "009066101"
    ],
    "names": [
        "AIRBNB INC"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1559720/000155972024000006/abnb-20231231.htm",
    "item1": "Item 1. Business\n \n Overview\n We are a community based on connection and belonging a community that was born in 2007 when two Hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million Hosts who have welcomed over 1.5 billion guest arrivals in almost every country and region across the globe. Every day, Hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\n Airbnb has five stakeholders and is designed with all of them in mind. Along with employees and shareholders, we serve Hosts, guests, and the communities in which they live. We intend to make long-term decisions considering all of our stakeholders because their collective success is key for our business to thrive.\n A Resilient Model\n We believe we are well positioned for the road ahead due to our adaptability and relentless innovation. Our business model is adaptable. We have nearly every type of space in nearly every location, so however travel changes, we are able to adapt. Regardless of the economic environment, our guests come to Airbnb because they can find great value, and our Hosts can earn income. We've relentlessly innovated while also staying focused and disciplined.\n Our Long-Term Growth Strategy\n Our strategy is to continue to invest in our key strengths:\n \"Make hosting mainstream.We're focused on making hosting just as popular as traveling on Airbnb. We will continue to invest in growing the size and quality of our Host community. We plan to attract more Hosts globally by expanding use cases and supporting all different types of Hosts, including those who host occasionally. We will also continue to increase the support that we provide to our Hosts to deliver high-quality stays and experiences for guests. We'll continue to raise awareness around hosting, make it easier to get started, and improve the overall experience for Hosts.\n \"\n Make hosting mainstream.\n We're focused on making hosting just as popular as traveling on Airbnb. We will continue to invest in growing the size and quality of our Host community. We plan to attract more Hosts globally by expanding use cases and supporting all different types of Hosts, including those who host occasionally. We will also continue to increase the support that we provide to our Hosts to deliver high-quality stays and experiences for guests. We'll continue to raise awareness around hosting, make it easier to get started, and improve the overall experience for Hosts.\n \"Grow and engage our guest community.We intend to continue to attract new guests to Airbnb and will continue to focus on engaging our existing guests to return to book and to use Airbnb with more frequency. With new behaviors developed during the COVID-19 pandemic, we believe the ways that people approach work, living, and travel have fundamentally changed. We believe there will be further opportunities to enhance our offerings based on these new behaviors and attract more guests to our platform.\n Grow and engage our guest community.\n We intend to continue to attract new guests to Airbnb and will continue to focus on engaging our existing guests to return to book and to use Airbnb with more frequency. With new behaviors developed during the COVID-19 pandemic, we believe the ways that people approach work, living, and travel have fundamentally changed. We believe there will be further opportunities to enhance our offerings based on these new behaviors and attract more guests to our platform.\n \"Perfect the core service.Our innovations are focused on improving our Host and guest experiences, making Airbnb more accessible and appealing for new Hosts and guests and driving increased engagement and loyalty with our existing community. Two years ago, we started doing twice-a-year product releases to address feedback from our existing community. Since then, we've launched more than 430 new features and upgrades to our core service. In the past year alone, this included improved customer service, total price display, and new tools to help Hosts set more competitive prices. We intend to continue to invest in our brand to educate new Hosts and guests on the benefits of Airbnb and the uniqueness of our offerings. We will continue to leverage our brand through a cohesive and integrated marketing strategy through our two annual product launches.\n Perfect the core service.\n Our innovations are focused on improving our Host and guest experiences, making Airbnb more accessible and appealing for new Hosts and guests and driving increased engagement and loyalty with our existing community. Two years ago, we started doing twice-a-year product releases to address feedback from our existing community. Since then, we've launched more than 430 new features and upgrades to our core service. In the past year alone, this included improved customer service, total price display, and new tools to help Hosts set more competitive prices. We intend to continue to invest in our brand to educate new Hosts and guests on the benefits of Airbnb and the uniqueness of our offerings. We will continue to leverage our brand through a cohesive and integrated marketing strategy through our two annual product launches.\n \"Expand our global network.We've made significant progress over the past three years to build a strong and profitable business. In addition to laying the foundation for differentiated offerings for our Hosts and guests, we've been focused on international expansion. We are investing in under-penetrated international markets and have seen strong results. We plan to continue to expand our global network and partner with communities to update laws and regulations for short-term rentals to allow more Hosts to join our platform.\n Expand our global network.\n We've made significant progress over the past three years to build a strong and profitable business. In addition to laying the foundation for differentiated offerings for our Hosts and guests, we've been focused on international expansion. We are investing in under-penetrated international markets and have seen strong results. We plan to continue to expand our global network and partner with communities to update laws and regulations for short-term rentals to allow more Hosts to join our platform.\n Our Platform\n Our Platform for Hosts\n We built our platform to seamlessly onboard new Hosts, especially those who previously had not considered hosting. We partner with Hosts throughout the process of setting up their listing and provide them with a robust suite of tools to successfully manage their listings, including scheduling, merchandising, integrated payments, community support, Host protections, pricing guidance, and feedback from reviews. During 2023, we launched new pricing tools to help Hosts set competitive prices, easily add weekly and monthly discounts, and compare their listing to similar ones in their area.\n We count the number of Hosts on our platform based on the number of users with available listings, defined as accommodations and experiences that are viewable on our platform (excluding HotelTonight), as of a certain date. We consider a listing of a home or an experience to be an \"active listing\" if it is viewable on Airbnb and has been previously booked at least once on Airbnb (excluding HotelTonight).\n 3\n Table of Contents\n Our Platform for Guests\n Our website and mobile apps provide our guests with an engaging way to explore a wide variety of unique homes and experiences and an easy way to book them. To better meet the needs of our guests, we have launched a series of new features and upgrades through our biannual product releases to help guests find affordable, high quality and reliable stays across the platform.\n Our System of Trust\n The system for trust that we have designed includes the following components: Host and guest reviews, account protection, risk scoring, secure payments, a nondiscrimination policy, watchlist and background",
    "item1a": "Item 1A. Risk Factors\n \n Our business, operations, and financial results are subject to various risks and uncertainties, including those described below, that could materially adversely affect our business, results of operations, financial condition, and the trading price of our Class A common stock. The following material factors, among others, could cause our actual results to differ materially from historical results and those expressed in forward-looking statements made by us or on our behalf in filings with the SEC, press releases, communications with investors, and oral statements.\n Risks Related to Our Business\n Our revenue growth rate has slowed over time, and we expect it to continue to slow in the future.\n We have experienced significant revenue growth in the past; however, our revenue growth rate has slowed over time and there is no assurance that historic growth rates will return. Our future revenue growth depends on the growth of supply and demand for listings on our platform, and our business is affected by general economic and business conditions worldwide as well as trends in the global travel and hospitality industries and the short and long-term accommodation regulatory landscape. In addition, we believe that our revenue growth depends upon a number of factors, including:\n \"global macroeconomic conditions, including inflation and rising interest rates and recessionary concerns;\n \"\n global macroeconomic conditions, including inflation and rising interest rates and recessionary concerns;\n \"our ability to retain and grow the number of guests and Nights and Experiences Booked;\n our ability to retain and grow the number of guests and Nights and Experiences Booked;\n \"our ability to retain and grow the number of Hosts and the number of available listings on our platform;\n our ability to retain and grow the number of Hosts and the number of available listings on our platform;\n \"events beyond our control such as pandemics and other health concerns, restrictions on travel and immigration, political, social or economic instability, including international disputes, war, or terrorism, trade disputes, economic downturns, and the impact of climate change on travel including the availability of preferred destinations and the increase in the frequency and severity of weather-related events, including fires, floods, droughts, extreme temperatures and ambient temperature increases, severe weather, and other natural disasters, and the impact of other climate change on seasonal destinations;\n events beyond our control such as pandemics and other health concerns, restrictions on travel and immigration, political, social or economic instability, including international disputes, war, or terrorism, trade disputes, economic downturns, and the impact of climate change on travel including the availability of preferred destinations and the increase in the frequency and severity of weather-related events, including fires, floods, droughts, extreme temperatures and ambient temperature increases, severe weather, and other natural disasters, and the impact of other climate change on seasonal destinations;\n \"competition;\n competition;\n \"the legal and regulatory landscape and changes in the application of existing laws and regulations or adoption of new laws and regulations that impact our business, Hosts, and/or guests, including changes in short-term occupancy, tax laws, and real estate broker laws;\n the legal and regulatory landscape and changes in the application of existing laws and regulations or adoption of new laws and regulations that impact our business, Hosts, and/or guests, including changes in short-term occupancy, tax laws, and real estate broker laws;\n \"the attractiveness of home sharing to prospective Hosts and guests;\n the attractiveness of home sharing to prospective Hosts and guests;\n \"the level of consumer awareness and perception of our brand;\n the level of consumer awareness and perception of our brand;\n \"our ability to build and strengthen trust and safety on our platform and among members of our community;\n our ability to build and strengthen trust and safety on our platform and among members of our community;\n \"the level of spending on brand and performance marketing to attract Hosts and guests to our platform;\n the level of spending on brand and performance marketing to attract Hosts and guests to our platform;\n \"our ability to grow new offerings and to deepen our presence in certain geographies;\n our ability to grow new offerings and to deepen our presence in certain geographies;\n \"timing, effectiveness, and costs of expansion and upgrades to our platform and infrastructure; and\n timing, effectiveness, and costs of expansion and upgrades to our platform and infrastructure; and\n \"other risks described elsewhere in this Annual Report on Form 10-K.\n other risks described elsewhere in this Annual Report on Form 10-K.\n A softening of demand, whether caused by events outside of our control, challenging macroeconomic and political conditions, changes in Host and guest preferences, public health crises such as pandemics, and any of the other factors described above, in this Annual Report on Form 10-K, or otherwise, may result in decreased revenue and our business, results of operations, and financial condition would be materially adversely affected.\n If we fail to retain existing Hosts or add new Hosts, or if Hosts fail to provide high-quality stays and experiences, our business, results of operations, and financial condition would be materially adversely affected.\n Our business depends on Hosts maintaining their listings on our platform and engaging in practices that encourage guests to book those listings, including increasing the number of nights and experiences that are available to book, providing timely responses to inquiries from guests, offering a variety of desirable and differentiated listings at competitive prices that meet the expectations of guests, and offering exceptional hospitality, services, and experiences to guests. These practices are outside of our direct control. If Hosts do not establish or maintain a sufficient number of listings and availability for listings, the number of Nights and Experiences Booked declines for a particular period, or the price charged by Hosts declines, our revenue would decline and our business, results of operations, and financial condition would be materially adversely affected.\n Hosts manage and control their spaces and experiences and typically market them on our platform with no obligation to make them available to guests for specified dates and with no obligation to accept bookings from prospective guests. We have had many Hosts list their properties on our platform in one period and cease to offer these properties in subsequent periods for a variety of reasons. While we plan to continue to invest in our Host community and in tools to assist Hosts, these investments may not be successful in growing our Hosts and listings on our platform. In addition, Hosts may not establish or maintain listings if we cannot attract prospective guests to our platform and generate bookings from a large number of guests. If we are unable to retain existing Hosts or add new Hosts, or if Hosts elect to market their listings exclusively with a competitor or cross-list with a competitor, we may be unable to offer a sufficient supply and variety of properties or experiences to attract guests to use our platform. In particular, it is critical that we continue to attract and retain individual Hosts who list their spaces, including private rooms, primary homes, or vacation homes, on Airbnb. We attract individual Hosts predominantly through organic channels such as word of mouth and our strong brand recognition. If we are unable to attract and retain individual Hosts in a cost-effective manner, or at all, our business, results of operations, and financial condition would be materially adversely affected.\n Professional ",
    "item7": "Item 1B. Unresolved Staff Comments\n None.\n \n Item 1C. Cybersecurity\n Cybersecurity Risk Management and Strategy\n We have developed and implemented a cybersecurity risk management program intended to protect the confidentiality, integrity, and availability of our critical systems and information, including information pertaining to Hosts, guests, employees, and other users. Our cybersecurity risk management program includes a cybersecurity incident response plan (\"Incident Response Plan\").\n Our cybersecurity risk management program is integrated into our overall enterprise risk management program and, while distinct in certain aspects described below, the program shares common methodologies, reporting channels and governance processes that apply across the enterprise risk management program to other legal, compliance, strategic, operational, and financial risk areas.\n Our cybersecurity risk management program includes:\n \"risk assessments designed to help identify material cybersecurity risks to our critical systems, information, products, services, and our broader enterprise IT environment;\n \"\n risk assessments designed to help identify material cybersecurity risks to our critical systems, information, products, services, and our broader enterprise IT environment;\n \"an information security team who, in collaboration with the broader technology organization, manages and maintains our (1) cybersecurity risk assessment processes including our Incident Response Plan, (2) security controls, and (3) response to cybersecurity incidents;\n an information security team who, in collaboration with the broader technology organization, manages and maintains our (1) cybersecurity risk assessment processes including our Incident Response Plan, (2) security controls, and (3) response to cybersecurity incidents;\n \"the use of external service providers, where appropriate, to assess, test or otherwise assist with aspects of our security controls;\n the use of external service providers, where appropriate, to assess, test or otherwise assist with aspects of our security controls;\n \"cybersecurity awareness training of our employees, incident response personnel, and senior management;\n cybersecurity awareness training of our employees, incident response personnel, and senior management;\n \"an Incident Response Plan that includes procedures for recognizing and responding to cybersecurity incidents; and\n an Incident Response Plan that includes procedures for recognizing and responding to cybersecurity incidents; and\n \"a third-party risk management process for service providers, suppliers, and vendors who have access to our critical systems and information.\n a third-party risk management process for service providers, suppliers, and vendors who have access to our critical systems and information.\n We have not identified risks from known cybersecurity threats, including as a result of any prior cybersecurity incidents, that have materially affected or are reasonably likely to materially affect us, including our operations, business strategy, results of operations, or financial condition.\n Cybersecurity Governance\n Our board of directors considers cybersecurity risk as part of its risk oversight function and has delegated to the Audit Risk and Compliance Committee (the \"Audit Committee\") oversight of cybersecurity, privacy and other information technology risks. The Audit Committee has responsibility for oversight of management's implementation of our cybersecurity risk management program.\n The Audit Committee receives regular reports and briefings from management on our cybersecurity risks and cybersecurity risk management program updates. In addition, management updates the Audit Committee, as necessary, regarding any material cybersecurity incidents, as well as any incidents with lesser impact potential.\n Our management team, including our Chief Legal Officer, our Chief Security Officer and our Chief Technology Officer, is responsible for assessing and managing our material risks from cybersecurity threats. The team has primary responsibility for our overall cybersecurity risk management program and supervises both our internal information security team and our retained external cybersecurity consultants. Our management team has over 20 years of cybersecurity technology leadership experience.\n Our management team supervises our information security team's efforts to prevent, detect, mitigate, and remediate cybersecurity risks and incidents through various means, which may include briefings from internal security personnel; threat intelligence and other information obtained from governmental, public or private sources, or external consultants engaged by us; and alerts and reports produced by security tools deployed in the IT environment.\n Item 2. Properties\n We are headquartered in San Francisco, California, where we have lease commitments for approximately828,000square feet, including approximately 533,000square feet offered for sublease, across multiple buildings.\n We are headquartered in San Francisco, California, where we have lease commitments for approximately\n 828,000\n square feet, including approximately 5\n 33,000\n square feet offered for sublease, across multiple buildings.\n As of December 31, 2023, we leased office facilities totaling approximately1.4 million square feet in multiple locations in the United States and internationally. In 2022, as a result of the COVID-19 pandemic's impact on the working environment, we announced our Live and Work Anywhere policy. This policy allows for the vast majority of our employees to work remotely on a permanent basis. Where we ceased using office space, we have either terminated, subleased, or offered for sublease. See Note 18,Restructuring,to our consolidated financial statements included in Item 8 of this Annual Report on Form 10-K. We believe our facilities are adequate and suitable for our current needs.\n As of December 31, 2023, we leased office facilities totaling approximately\n 1.4 millio\n n square feet in multiple locations in the United States and internationally. In 2022, as a result of the COVID-19 pandemic's impact on the working environment, we announced our Live and Work Anywhere policy. This policy allows for the vast majority of our employees to work remotely on a permanent basis. Where we ceased using office space, we have either terminated, subleased, or offered for sublease. See Note 18,\n Restructuring,\n to our consolidated financial statements included in Item 8 of this Annual Report on Form 10-K. We believe our facilities are adequate and suitable for our current needs.\n Item 3. Legal Proceedings\n We are currently involved in, and may in the future be involved in, legal proceedings, claims, and government investigations in the ordinary course of business. These include proceedings, claims, and investigations relating to, among other things, regulatory matters, commercial matters, intellectual property, competition, tax, employment, pricing, discrimination, consumer rights, personal injury, and property rights. See Note 13,Commitments and Contingencies–Legal and Regulatory Matters, to our consolidated financial statements included in Item 8 of this Annual Report on Form 10-K.\n We are currently involved in, and may in the future be involved in, legal proceedings, claims, and government investigations in the ordinary course of business. These include proceedings, claims, and investigations relating to, among other things, regulatory matters, commercial matters, intellectual property, competition, tax, employment, pricing, discrimination, consumer rights, personal injury, and property rights. See Note 13,\n Commitments and Contingencies\n –\n Legal and Regulatory Matters\n , to our consolidated financial statements included in Item 8 of this Annual Report on Form 10-K.\n 49\n Table of Contents\n Depending on the nature of the proceeding, claim, or investigation, we may be subject to monetary damage awards, fines, pena",
    "item7a": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\n \n Our substantial operations around the world expose us to various market risks. These risks primarily include foreign currency risk and investment risk.\n Foreign Currency Exchange Risk\n We offer the ability to transact on our platform in over 40 currencies, of which the most significant foreign currencies to our operations in 2023 were the Euro, British Pound, Canadian Dollar, Australian Dollar, Brazilian Real, and Mexican Peso. Our international revenue, as well as costs and expenses denominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the U.S. dollar. Accordingly, we are subject to foreign currency risk, which may adversely impact our financial results.\n We have foreign currency exchange risks related primarily to:\n \"revenue and cost of revenue associated with bookings on our platform denominated in currencies other than the U.S. dollar;\n \"\n revenue and cost of revenue associated with bookings on our platform denominated in currencies other than the U.S. dollar;\n \"balances held as funds receivable and amounts held on behalf of customers and funds payable and amounts payable to customers;\n balances held as funds receivable and amounts held on behalf of customers and funds payable and amounts payable to customers;\n \"unbilled amounts for confirmed bookings under the terms of our Pay Less Upfront program; and\n unbilled amounts for confirmed bookings under the terms of our Pay Less Upfront program; and\n \"intercompany balances primarily related to our payment entities that process customer payments.\n intercompany balances primarily related to our payment entities that process customer payments.\n For revenue and cost of revenue associated with bookings on our platform outside of the United States, we generally receive net foreign currency amounts and therefore benefit from a weakening of the U.S. dollar and are adversely affected by a strengthening of the U.S. dollar. Movements in foreign exchange rates are recorded in other income (expense), net in our consolidated statements of operations. Furthermore, our platform generally enables guests to make payments in the currency of their choice to the extent that the currency is supported by Airbnb, which may not match the currency in which the Host elects to be paid. As a result, in those cases, we bear the currency risk of both the guest payment as well as the Host payment due to timing differences in such payments.\n We enter into foreign currency derivative contracts to protect against foreign exchange risks. These hedges are primarily designed to manage foreign exchange risk associated with forecasted foreign denominated revenue, balances held as funds payable and amounts payable to customers, and unbilled amounts for confirmed bookings under the terms of our Pay Less Upfront program. These contracts reduce, but do not entirely eliminate, the impact of foreign currency exchange rate movements on our revenue, assets and liabilities. However, we may choose not to hedge certain exposures for a variety of reasons including accounting considerations or the prohibitive economic cost of hedging particular exposures.\n We have experienced and will continue to experience fluctuations in foreign exchange gains and losses related to changes in exchange rates. If our foreign-currency denominated assets, liabilities, revenues or expenses increase, our results of operations may be more significantly impacted by fluctuations in the exchange rates of the currencies in which we do business.\n If an adverse 10% foreign currency exchange rate change was applied to total net monetary assets and liabilities denominated in currencies other than the local currencies as of December 31, 2023, it would have resulted in a loss of approximately $20 million.\n Investment and Interest Rate Risk\n We are exposed to interest rate risk related primarily to our investment portfolio. Changes in interest rates affect the interest earned on our total cash, cash equivalents, available-for-sale short-term investments, and the fair value of those securities.\n We had cash and cash equivalents of $6.9 billion and short-term investments of $3.2 billion as of December 31, 2023, which primarily consisted of corporate debt securities, commercial paper, certificates of deposit, U.S. government and government agency debt securities (\"government bonds\"), and mortgage-backed and asset-backed securities and time deposits. As of December 31, 2023, we had an additional $5.9 billion that we held for bookings in advance of guests completing check-ins, which we record separately on our consolidated balance sheets as funds receivable and amounts held on behalf of customers. The primary objective of our investment activities is to preserve capital and meet liquidity requirements without significantly increasing risk. We invest primarily in highly-liquid, investment grade debt securities, and we limit the amount of credit exposure to any one issuer. We do not enter into investments for trading or speculative purposes and have not used any derivative financial instruments to manage our interest rate risk exposure. Because our cash equivalents and short-term investments generally have short maturities, the fair value of our portfolio is relatively insensitive to interest rate fluctuations. Due to the short-term nature of our investments, we have not been exposed to, nor do we anticipate being exposed to, material risks due to changes in interest rates. A hypothetical 100 basis point increase in interest rates would have resulted in a decrease of $20 million to our investment portfolio as of December 31, 2023.\n 63\n Table of Contents\n"
}