{
    "cik": 1652044,
    "cusip6": "02079K",
    "cusip": [
        "02079K107"
    ],
    "names": [
        "ALPHABET CLASS C",
        "ALPHABET INC",
        "ALPHABET INC CAP STK CL C",
        "Alphabet Inc-Cl C",
        "Alphabet Inc Cl C",
        "ALPHABET INC/CA",
        "ALPHABET INC CLASS C",
        "ALPHABET INC-CL C",
        "Alphabet Inc - C",
        "ALPHABET INC. CLASS C",
        "Alphabet Inc",
        "Alphabet Inc Cap Stk Cl C",
        "Alphabet Inc. Class C",
        "ALPHABET INC C",
        "Alphabet Inc Class C",
        "Alphabet Inc. Cl. C",
        "ALPHABET INC. CLASS                  C",
        "ALPHABET INC.",
        "Google Inc Class C",
        "Alphabet Inc Cap STK CL C",
        "Alphabet INC Class C",
        "ALPHABET INC - CL C",
        "Alphabet Inc. - C Shares",
        "ALPHABET INC",
        "ALPHABET, INC. CLASS C",
        "Alphabet CL C",
        "Alphabet Inc  Class C",
        "Alphabet inc., C",
        "ALPHABET INC. CLASS                  C",
        "GOOGLE INC CL C",
        "Alphabet Inc. Class                  C",
        "ALPHABET INC COM CL C",
        "ALPHABET INC CL C",
        "ALPHABET INC C",
        "ALPHABET     INC",
        "ALPHABET INC CAP STOCK CL C",
        "Alphabet Inc Class C",
        "Alphabet Inc. Cl C",
        "Alphabet Inc. CL C",
        "ALPHABET INC-C",
        "ALPHABET INC",
        "Alphabet Inc CL C",
        "ALPHABET-C-",
        "ALPHABET INC.           CLASS                  C",
        "ALPHABET INC CLASS-C",
        "ALPHABET INC",
        "ALPHABET C",
        "ALPHABET INC. CMN CLASS C",
        "Alphabet Inc  C",
        "Alphabet, Inc.",
        "Alphabet Inc-C",
        "ALPHABET, INC.",
        "ALPHABET INC CAP STKCL C",
        "ALLSTATE CORP",
        "Alphabet Inc. - Class C",
        "Alphabet Inc C",
        "Alphabet Inc Class C",
        "ALPHABET INC. CMN  CLASS C",
        "Alphabet Class-C Share",
        "Alphabet Inc - CL C",
        "Alphabet Inc-Cl C (goog)",
        "Alphabet C",
        "Alphabet Inc Cap Stock Cl C",
        "Alphabet Inc.",
        "Alphabet Inc class C",
        "Alphabet Inc Cl C",
        "ALPHABET",
        "ALPHABET INC-CL C",
        "ALPHABET INCORPORATED CAP STK CLASS C",
        "ALPHABET INC CAP STK",
        "ALPHABET, INC",
        "Alphabet Inc - C Shares",
        "Alphabet Inc.",
        "Alphabet",
        "ALPHABET CL C",
        "ALPHABET INC            CLASS                  C",
        "Alphabet Inc Class                  C",
        "ALPHABET INC",
        "Alphabet Cl C",
        "Alphabet, Inc. - Class C",
        "Alphabet, Inc. Cl C",
        "ALPHABET INC USD0.001 Class C Capital Stock",
        "Alphabet Inc. Cl-C",
        "ALPHABET INC -CL C",
        "Alphabet Inc - Class C",
        "ALPHABET CLASS-C SHARE",
        "ALPHABET INC",
        "Alphabet Class C",
        "Alphabet Inc Class C",
        "ALPHABET INC  NON VOTING CAP STK CL C",
        "Alphabet -CL C",
        "ALPHABET I",
        "Alphabet, Inc. - CL A",
        "Alphabet, Inc. - CL C",
        "ALPHABET INC.",
        "Google",
        "Alphabet Inc., Class C",
        "ALPHABET INC CL-C",
        "GOOGLE INC",
        "Google Inc",
        "ALPHABET INC-CL C GOOG US",
        "ALPHABET INC  GOOG",
        "ALPHABET INC/CA-CL C",
        "Alphabet (Google) C",
        "Alphabet, Inc. Class C - Formerly Google C",
        "Alphabet Inc. Class C Capital",
        "ALPHABET INC CAP STK CL C",
        "ALPHABET INC CAP STK CLC",
        "ALPHABETINCCAPSTKCLC",
        "Alphabet, Inc Class C",
        "ALPHABET INC CAP",
        "ALPHABET INC - CLASS C",
        "Alphabet Inc Cap Stk Class C",
        "ALPHABET INC",
        "Alphabet, Inc. C",
        "ALPHABET INC  NON VOTING CAP STK CL C",
        "ALPHABET CL C ORD",
        "GROUP 1 AUTOMOTI",
        "Alphabet Inc US$0.001 'C'",
        "Alphabet Inc. Class C",
        "ALPHABET INC. CL C",
        "Google Inc Cl C",
        "Google Inc",
        "Alphabet Inc - Class C",
        "ALPHABET INC",
        "ALPHABET INC",
        "ALPHABET INC- CL C",
        "ALPHABET INC",
        "ALPHABET INC CAP STK",
        "ALPHABET, INC. - CLASS C",
        "Alphabet Inc CL C NON Voting",
        "GOOG",
        "Alphabet Inc Capital Stock Cl C",
        "ALPHABET INC- CLASS C (non-vot",
        "Alphabet Class C",
        "AlphabetIncClassC",
        "Alphabet Cl C",
        "ALPHABET INC CAP STK CL C",
        "Alphabet Inc Cap Stk CL C Cap",
        "ALPHABET INC                CAP STK CL C",
        "Alphabet INC",
        "ALPHABET INC CLASS C",
        "ALPHABET INC., CLASS-C",
        "ALPHABET - CLASS C",
        "ALPHABET INC - CL C  (Non-Voting)",
        "ALPHABET INC CL C           COM",
        "Alphabet Inc Cap STK",
        "ALPHABET CLASS C               COM",
        "ALPHABET INC NON-VOTING CL C",
        "ALPHABET INC C",
        "ALPHABET INC-CL",
        "ALPHABET INC CAP STK",
        "Alphabet (Google) Cl C",
        "Alphabet, Inc Cl C",
        "Alphabet Inc Cap Stk CL C",
        "ALPHABET INCORPORATED",
        "Alphabet, Inc. Class C",
        "Alphabet C Non-voting (Google)",
        "Alphabet Inc-CL C",
        "ALPHABET INC CL C",
        "Alphabet inc-cl c",
        "ALPHABET INC CL C (GOOGLE C)",
        "ALPHABET INC.",
        "ALPHABET INC (CLASS C)",
        "Alphabet, Inc. - Cl C (GOOG)",
        "ALPHABET INCORPORATED CAP STK",
        "Alphabet Inc",
        "ALPHABET INC NON VOTING CAP STK CL C",
        "ALPHABET INC USD.001",
        "Alphabet Inc Class C Cap STK",
        "Alphabet INC CLASS C CORP COMMON",
        "ALPHABET INC                 CAP STK CL C",
        "ALPHABET INC  CLASS C",
        "ALPHABET INC CAP STK CLASS C",
        "ALPHABET INC                        C",
        "AlphabetIncC",
        "Alphabet Inc., 'C'",
        "ALPHABET INC USD 0.001 CL C",
        "ALPHABET INC CL",
        "ALPHABET INC COM CL C USD0.001",
        "Alphabet Class C (GOOG)",
        "Alphabet Inc Cap Stock Cl C (Google)",
        "ALPHABET INC CLASS C COMMON"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1652044/000165204424000022/goog-20231231.htm",
    "item1": "ITEM 1.BUSINESS\n ITEM 1.\n BUSINESS\n \n Overview\n As our founders Larry and Sergey wrote in the original founders' letter, \"Google is not a conventional company. We do not intend to become one.\" That unconventional spirit has been a driving force throughout our history, inspiring us to tackle big problems and invest in moonshots. It led us to be a pioneer in the development of AI and, since 2016, an AI-first company. We continue this work under the leadership of Alphabet and Google CEO, Sundar Pichai.\n Alphabet is a collection of businesses   the largest of which is Google. We report Google in two segments, Google Services and Google Cloud, and all non-Google businesses collectively as Other Bets. Alphabet's structure is about helping each of our businesses prosper through strong leaders and independence.\n Access and Technology for Everyone\n The Internet is one of the world's most powerful equalizers; it propels ideas, people, and businesses large and small. Our mission to organize the world's information and make it universally accessible and useful is as relevant today as it was when we were founded in 1998. Since then, we have evolved from a company that helps people find answers to a company that also helps people get things done.\n We are focused on building an even more helpful Google for everyone, and we aspire to give everyone the tools they need to increase their knowledge, health, happiness, and success. Google Search helps people find information and make sense of the world in more natural and intuitive ways, with trillions of searches on Google every year. YouTube provides people with entertainment, information, and opportunities to learn something new. Google Assistant offers the best way to get things done seamlessly across different devices, providing intelligent help throughout a person's day, no matter where they are. Google Cloud helps customers solve today's business challenges, improve productivity, reduce costs, and unlock new growth engines. We are continually innovating and building new products and features that will help our users, partners, customers, and communities and have invested more than $150 billion in research and development in the last five years in support of these efforts.\n Making AI Helpful for Everyone\n AI is a transformational technology that can bring meaningful and positive change to people and societies across the world, and for our business. At Google, we have been bringing AI into our products and services for more than a decade and making them available to our users. Our journey began in 2001, when machine learning was first incorporated into Google Search to suggest better spellings to users searching the web. Today, AI in our products is\n 4.\n Table of ContentsAlphabet Inc.\n Table of Contents\n Alphabet Inc.\n used by billions of people globally through features like autocomplete suggestions in Google Search; translation across 133 languages in Google Translate; and organization, searching, and editing in Google Photos.\n Large language models (LLMs) are an exciting aspect of our work in AI based on deep learning architectures, such as the Transformer, a neural network architecture that we introduced in 2017 that helped with language understanding. This led to the Bidirectional Encoder Representations from Transformers, or BERT, in 2019 that helped Search understand the intent of user search queries better than ever before.\n Google was a company built in the cloud, and we continue to invest in our Google Cloud offerings, including Google Cloud Platform and Google Workspace, to help organizations stay at the forefront of AI innovation with our AI-optimized infrastructure, mature AI platform and world-class models, and assistive agents.\n We believe AI can solve some of the hardest societal, scientific and engineering challenges of our time. For example, in 2020, Google DeepMind's AlphaFold system solved a 50-year-old protein folding challenge. Since then, we have open-sourced to the scientific community 200 million of AlphaFold's protein structures which are used to work on everything from accelerating new malaria vaccines to advancing cancer drug discovery and developing plastic-eating enzymes. As another example, AI can also have a transformative effect on climate progress by providing helpful information, predicting climate-related events, and optimizing climate action. Using advanced AI and geospatial analysis, Google Research has developed flood forecasting models that can provide early warning and real-time flooding information to communities and individuals.\n As AI continues to improve rapidly, we are focused on giving helpful features to our users and customers as we deliver on our mission to organize the world's information and make it universally accessible and useful. With a bold and responsible approach, we continue to take the next steps to make this technology even more helpful for everyone.\n Deliver the Most Advanced, Safe, and Responsible AI\n We aim to build the most advanced, safe, and responsible AI with models that are developed, trained, and rigorously tested at scale powered by our continued investment in AI technical infrastructure. In December 2023, we launched Gemini, our most capable and general model. It was built from the ground up to be multimodal, which means it can generalize and seamlessly understand, operate across, and combine different types of information, including text, code, audio, images, and video. Our teams across Alphabet will leverage Gemini, as well as other AI models we have previously developed and announced, across our business to deliver the best product and service experiences for our users, advertisers, partners, customers, and developers.\n We believe our approach to AI must be both bold and responsible. That means developing AI in a way that maximizes the positive benefits to society while addressing the challenges, guided by our AI Principles. We published these in 2018, as one of the first companies to articulate principles that put beneficial use, users, safety, and avoidance of harms above business considerations. While there is natural tension between being bold and being responsible, we believe it is possible   and in fact critical   to embrace that tension productively.\n Enable Organizations and Developers to Innovate on Google Cloud\n AI is not only a powerful enabler, it is also a major platform shift. Globally, businesses from startups to large enterprises, and the public sector are thinking about how to drive transformation. That is why we are focused on making it easy and scalable for others to innovate, and grow, with AI. That means providing the most advanced computing infrastructure and expanding access to Google's latest AI models that have been rigorously tested in our own products. Our Vertex AI platform gives developers the ability to train, tune, augment, and deploy applications using generative AI models and services such as Enterprise Search and Conversations. Duet AI for Google Cloud provides pre-packaged AI agents that assist developers to write, test, document, and operate software.\n Improve Knowledge, Learning, Creativity, and Productivity\n Things that we now consider routine – like spell check, mobile check deposit, or Google Search, Google Translate, and Google Maps – all use AI. As AI continues to improve rapidly, we are focused on giving helpful features to our users as we continue to deliver on our mission to organize the world's information and make it universally accessible and useful.\n While we have been integrating AI into our products for years, we are now embedding the power of generative AI to continue helping our users express themselves and get things done. For example, Duet AI in Google Workspace helps users write, organize, visualize, accelerate workflows, and have richer meetings. Bard allows users to collaborate with experimental AI with new features that include image capabilities, coding support, and app integrati",
    "item1a": "ITEM 1A.RISK FACTORS\n ITEM 1A.\n RISK FACTORS\n Our operations and financial results are subject to various risks and uncertainties, including but not limited to those described below, which could harm our business, reputation, financial condition, and operating results, and affect the trading price of our Class A and Class C stock.\n Risks Specific to our Company\n We generate a significant portion of our revenues from advertising. Reduced spending by advertisers, a loss of partners, or new and existing technologies that block ads online and/or affect our ability to customize ads could harm our business.\n We generated more than 75% of total revenues from online advertising in 2023. Many of our advertisers, companies that distribute our products and services, digital publishers, and content providers can terminate their contracts with us at any time. These partners may not continue to do business with us if we do not create more value (such as increased numbers of users or customers, new sales leads, increased brand awareness, or more effective monetization) than their available alternatives. Changes to our advertising policies and data privacy practices, such as our initiatives to phase out third-party cookies, as well as changes to other companies' advertising and/or data privacy practices have in the past, and may in the future, affect the advertising that we are able to provide. In addition, technologies have been developed that make customized ads more difficult, or that block the display of ads altogether, and some providers of online services have integrated these technologies that could potentially impair the availability and functionality of third-party digital advertising. Failing to provide superior value or deliver advertisements effectively and competitively could harm our business, reputation, financial condition, and operating results.\n In addition, expenditures by advertisers tend to correlate with overall economic conditions. Adverse macroeconomic conditions have affected, and may in the future affect, the demand for advertising, resulting in fluctuations in the amounts our advertisers spend on advertising, which could harm our financial condition and operating results.\n We face intense competition. If we do not continue to innovate and provide products and services that are useful to users, customers, and other partners, we may not remain competitive, which could harm our business, financial condition, and operating results.\n Our business environment is rapidly evolving and intensely competitive. Our businesses face changing technologies, shifting user needs, and frequent introductions of rival products and services. To compete successfully, we must accurately anticipate technology developments and deliver innovative, relevant and useful products, services, and technologies in a timely manner. As our businesses evolve, the competitive pressure to innovate will encompass a wider range of products and services. We must continue to invest significant resources in technical infrastructure and R&D, including through acquisitions, in order to enhance our technology, products, and services.\n We have many competitors in different industries. Our current and potential domestic and international competitors range from large and established companies to emerging start-ups. Some competitors have longer operating histories and well-established relationships in various sectors. They can use their experience and resources in ways that could affect our competitive position, including by making acquisitions and entering into other strategic arrangements; continuing to invest heavily in technical infrastructure, R&D, and in talent; initiating intellectual property and competition claims (whether or not meritorious); and continuing to compete for users, advertisers, customers, and content providers. Further, discrepancies in enforcement of existing laws may enable our lesser known competitors to aggressively interpret those laws without commensurate scrutiny, thereby affording them competitive advantages. Our competitors may also be able to innovate and provide products and services faster than we can or may foresee the need for products and services before we do.\n We are expanding our investment in AI across the entire company. This includes generative AI and continuing to integrate AI capabilities into our products and services. AI technology and services are highly competitive, rapidly evolving, and require significant investment, including development and operational costs, to meet the changing needs and expectations of our existing users and attract new users. Our ability to deploy certain AI technologies critical for our products and services and for our business strategy may depend on the availability and pricing of third-party equipment and technical infrastructure. Additionally, other companies may develop AI products and technologies that are similar or superior to our technologies or more cost-effective to deploy. Other companies may also have (or in the future may obtain) patents or other proprietary rights that would prevent, limit, or interfere with our ability to make, use, or sell our own AI products and services.\n Our financial condition and operating results may also suffer if our products and services are not responsive to the evolving needs and desires of our users, advertisers, publishers, customers, and content providers. As new and existing technologies continue to develop, competitors and new entrants may be able to offer experiences that are, or\n 11.\n \n Table of ContentsAlphabet Inc.\n Table of Contents\n Alphabet Inc.\n that are seen to be, substantially similar to or better than ours. These technologies could reduce usage of our products and services, and force us to compete in different ways and expend significant resources to develop and operate equal or better products and services. Competitors' success in providing compelling products and services or in attracting and retaining users, advertisers, publishers, customers, and content providers could harm our financial condition and operating results.\n Our ongoing investment in new businesses, products, services, and technologies is inherently risky, and could divert management attention and harm our business, financial condition, and operating results.\n We have invested and expect to continue to invest in new businesses, products, services, and technologies in a wide range of industries beyond online advertising. The investments that we are making across our businesses, such as building AI capabilities into new and existing products and services, reflect our ongoing efforts to innovate and provide products and services that are helpful to users, advertisers, publishers, customers, and content providers. Our investments ultimately may not be commercially viable or may not result in an adequate return of capital and, in pursuing new strategies, we may incur unanticipated liabilities. Innovations in our products and services could also result in changes to user behavior and affect our revenue trends. These endeavors involve significant risks and uncertainties, including diversion of resources and management attention from current operations, different monetization models, and the use of alternative investment, governance, or compensation structures that may fail to adequately align incentives across the company or otherwise accomplish their objectives.\n Within Google Services, we continue to invest heavily in devices, including our smartphones, home devices, and wearables, which is a highly competitive market with frequent introduction of new products and services, rapid adoption of technological advancements by competitors, increased market saturation in developed countries, short product life cycles, evolving industry standards, continual improvement in performance characteristics, and price and feature sensitivity on the part of consumers and businesses. There can be no assuran",
    "item7": "ITEM 7.MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n ITEM 7.\n MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \n Please read the following discussion and analysis of our financial condition and results of operations together with \"Note about Forward-Looking Statements,\" Part I, Item 1 \"Business,\" Part I, Item 1A \"Risk Factors,\" and our consolidated financial statements and related notes included under Item 8 of this Annual Report on Form 10-K.\n The following section generally discusses 2023 results compared to 2022 results. Discussion of 2022 results compared to 2021 results to the extent not included in this report can be found in Item 7 of our 2022 Annual Report on Form 10-K.\n Understanding Alphabet's Financial Results\n Alphabet is a collection of businesses   the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For additional information on our segments, see Part I, Item 1 Business andNote 15of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n Alphabet is a collection of businesses   the largest of which is Google. We report Google in two segments, Google Services and Google Cloud; we also report all non-Google businesses collectively as Other Bets. For additional information on our segments, see Part I, Item 1 Business and\n Note 15\n of the Notes to Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\n Trends in Our Business and Financial Effect\n The following long-term trends have contributed to the results of our consolidated operations, and we anticipate that they will continue to affect our future results:\n \"Users' behaviors and advertising continue to shift online as the digital economy evolves.\n \"\n Users' behaviors and advertising continue to shift online as the digital economy evolves.\n The continuing evolution of the online world has contributed to the growth of our business and our revenues since inception. We expect that this evolution will continue to benefit our business and our revenues, although at a slower pace than we have experienced historically, in particular after the outsized growth in our advertising revenues during the COVID-19 pandemic. In addition, we face increasing competition for user engagement and advertisers, which may affect our revenues.\n \"Users continue to access our products and services using diverse devices and modalities, which allows for new advertising formats that may benefit our revenues but adversely affect our margins.\n Users continue to access our products and services using diverse devices and modalities, which allows for new advertising formats that may benefit our revenues but adversely affect our margins.\n Our users are accessing our products and services via diverse devices and modalities, such as smartphones, wearables, connected TVs, and smart home devices, and want to be able to be connected no matter where they are or what they are doing. We are focused on expanding our products and services to stay in front of these trends in order to maintain and grow our business.\n We benefit from advertising revenues generated from different channels, including mobile, and newer advertising formats. The margins from these channels and newer products have generally been lower than those from traditional desktop search. Additionally, as the market for a particular device type or modality matures, our advertising revenues may be affected. For example, changing dynamics within the global smartphone market, such as increased market saturation in developed countries, can affect our mobile advertising revenues.\n We expect TAC paid to our distribution partners and Google Network partners to increase as our revenues grow and TAC as a percentage of our advertising revenues (\"TAC rate\") to be affected by changes in device mix; geographic mix; partner agreement terms; partner mix; the percentage of queries channeled through paid access points; product mix; the relative revenue growth rates of advertising revenues from different channels; and revenue share terms.\n We expect these trends to continue to affect our revenues and put pressure on our margins.\n \"As online advertising evolves, we continue to expand our product offerings, which may affect our monetization.\n As online advertising evolves, we continue to expand our product offerings, which may affect our monetization.\n As interactions between users and advertisers change, and as online user behavior evolves, we continue to expand our product offerings to serve these changing needs, which may affect our monetization. For example, revenues from ads on YouTube and Google Play monetize at a lower rate than our traditional search ads. We also expect to continue to incorporate AI innovations into our products, such as AI in Search, that could affect our monetization trends. When developing new products and services we generally focus first on user experience and then on monetization.\n \"As users in developing economies increasingly come online, our revenues from international markets continue to increase, and may require continued investments. In addition, movements in foreign exchange rates affect such revenues.\n As users in developing economies increasingly come online, our revenues from international markets continue to increase, and may require continued investments. In addition, movements in foreign exchange rates affect such revenues.\n 29.\n Table of ContentsAlphabet Inc.\n Table of Contents\n Alphabet Inc.\n The shift to online, as well as the advent of the multi-device world, has brought opportunities outside of the U.S., including in emerging markets, such as India. We continue to invest heavily and develop localized versions of our products and advertising programs relevant to our users in these markets. This has led to a trend of increased revenues from emerging markets. We expect that our results will continue to be affected by our performance in these markets, particularly as low-cost mobile devices become more available. This trend could affect our revenues as developing markets initially monetize at a lower rate than more mature markets.\n International revenues represent a significant portion of our revenues and are subject to fluctuations in foreign currency exchange rates relative to the U.S. dollar. While we have a foreign exchange risk management program designed to reduce our exposure to these fluctuations, this program does not fully offset their effect on our revenues and earnings.\n \"The revenues that we derive beyond advertising are increasing and may adversely affect our margins.\n The revenues that we derive beyond advertising are increasing and may adversely affect our margins.\n Revenues from cloud, consumer subscriptions, platforms, and devices, which may have differing characteristics than our advertising revenues, have grown over time, and we expect this trend to continue as we focus on expanding our products and services. The margins on these revenues vary significantly and are generally lower than the margins on our advertising revenues. For example, sales of our devices  adversely affect our consolidated margins due to pressures on pricing and higher cost of sales.\n \"As we continue to serve our users and expand our businesses, we will invest heavily in operating and capital expenditures.\n As we continue to serve our users and expand our businesses, we will invest heavily in operating and capital expenditures.\n We continue to make significant research and development investments in areas of strategic focus as we seek to develop new, innovative offerings, improve our existing offerings, and rapidly and responsibly deploy AI across our businesses. We also expect to increase, relative to 2023, our investment in our technical infrastructure, including servers, network ",
    "item7a": "ITEM 7A.QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n ITEM 7A.\n QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n We are exposed to financial market risks, including changes in foreign currency exchange rates, interest rates, and equity investment risks.\n Foreign Currency Exchange Risk\n We transact business globally in multiple currencies. International revenues, as well as costs and expenses denominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the U.S. dollar. As discussed below, we enter into derivative instruments to hedge foreign currency risk. Principal currencies hedged included the Australian dollar, British pound, Canadian dollar, Euro, and Japanese yen. For the purpose of analyzing foreign currency exchange risk, we considered the historical trends in foreign currency exchange rates and determined that it was reasonably possible that adverse changes in exchange rates of 10% could be experienced.\n We use foreign currency forward and option contracts to offset the foreign exchange risk on assets and liabilities denominated in currencies other than the functional currency of the subsidiary. These forward and option contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements on our assets and liabilities. The foreign currency gains and losses on these assets and liabilities are recorded in OI&E, which are offset by the gains and losses on the forward and option contracts.\n If an adverse 10% foreign currency exchange rate change was applied to total monetary assets, liabilities, and commitments denominated in currencies other than the functional currencies at the balance sheet date, it would have resulted in an adverse effect on income before income taxes of approximately $136 millionand $503 million as ofDecember 31, 2022and 2023, respectively, after consideration of the effect of foreign exchange contracts in place for the years endedDecember 31, 2022and 2023.\n If an adverse 10% foreign currency exchange rate change was applied to total monetary assets, liabilities, and commitments denominated in currencies other than the functional currencies at the balance sheet date, it would have resulted in an adverse effect on income before income taxes of approxima\n tely $136 million\n and $503 million as of\n December 31, 2022\n and 2023, respectively, after consideration of the effect of foreign exchange contracts in place for the years ended\n and 2023.\n We use foreign currency forward and option contracts, including collars (an option strategy comprised of a combination of purchased and written options) to protect forecasted U.S. dollar-equivalent earnings from changes in foreign currency exchange rates. When the U.S. dollar strengthens, gains from foreign currency forward and option contacts reduce the foreign currency losses related to our earnings. When the U.S. dollar weakens, losses from foreign currency forward and option contracts offset the foreign currency gains related to our earnings. These hedging contracts reduce, but do not entirely eliminate, the effect of foreign currency exchange rate movements. We designate these contracts as cash flow hedges for accounting purposes. We reflect the gains or losses of foreign currency spot rate changes as a component of accumulated other comprehensive income (AOCI) and subsequently reclassify them into revenues to offset the hedged exposures as they occur.\n If the U.S. dollar weakened by 10% as of December 31, 2022 and 2023, the amount recorded in AOCI related to our cash flow hedges before tax effect would have been approximately$1.3 billion and$1.5 billionlower as of December 31, 2022 and 2023, respectively. The change in the value recorded in AOCI would be expected to offset a corresponding foreign currency change in forecasted hedged revenues when recognized.\n I\n f the U.S. dollar weakened by 10% as of December 31, 2022 and 2023, the amount recorded in AOCI related to our cash flow hedges before tax effect would have been approximately\n $1.3 billion and\n \n $1.5 billion\n lower as of December 31, 2022 and 2023, respectively. The change in the value recorded in AOCI would be expected to offset a corresponding foreign currency change in forecasted hedged revenues when recognized.\n We use foreign exchange forward contracts designated as net investment hedges to hedge the foreign currency risks related to investment in foreign subsidiaries. These forward contracts serve to offset the foreign currency translation risk from our foreign operations.\n If the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $903 million and$946 millionlower as of December 31, 2022 and 2023, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries.\n If the U.S. dollar weakened by 10%, the amount recorded in cumulative translation adjustment (CTA) within AOCI related to our net investment hedges before tax effect would have been approximately $903 million and\n $946 million\n lower as of December 31, 2022 and 2023, respectively. The change in value recorded in CTA would be expected to offset a corresponding foreign currency translation gain or loss from our investment in foreign subsidiaries.\n Interest Rate Risk\n Our Corporate Treasury investment strategy is to achieve a return that will allow us to preserve capital and maintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities, mortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate derivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and floating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair market value adversely affected due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. Unrealized gains or losses on our marketable debt securities are primarily due to interest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. We measure securities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until the securities are sold, less any expected credit losses.\n Our Corporate Treasury investment strategy is to achieve a return that w\n ill allow us to preserve capital and maintain liquidity. We invest primarily in debt securities, including government bonds, corporate debt securities, mortgage-backed and asset-backed securities, money market and other funds, time deposits, and interest rate derivatives. By policy, we limit the amount of credit exposure to any one issuer. Our investments in both fixed rate and floating rate interest earning securities carry a degree of interest rate risk. Fixed rate securities may have their fair market value adversely affected due to a rise in interest rates, while floating rate securities may produce less income than predicted if interest rates fall. Unrealized gains or losses on our marketable debt securities are primarily due to interest rate fluctuations as compared to interest rates at the time of purchase. For certain fixed and variable rate debt securities, we have elected the fair value option for which changes in fair value are recorded in OI&E. We measure securities for which we have not elected the fair value option at fair value with gains and losses recorded in AOCI until the securities are sold, less any expected credit losses.\n 45.\n Ta"
}