{
    "cik": 4962,
    "cusip6": "025816",
    "cusip": [
        "025816109"
    ],
    "names": [
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS CO COM",
        "American Express Co",
        "AMER EXPRESS COMPANY",
        "AMERICAN EXPRESS",
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS COMPANY",
        "AMER EXPRESS CO",
        "American Express Co.",
        "American Express Company",
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS CO",
        "American Express Co - US",
        "Amer Express Company",
        "American Express",
        "American Express CO",
        "AMERICAN  EXPRESS     CO",
        "American Express",
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS CO. CMN",
        "AMERICAN EXPRESS CO.",
        "AMERICAN WOODMARK CORP",
        "American Express",
        "AMER EXPRESS",
        "AMER. EXPRESS",
        "AMERICAN EXPRESS CO COM USD0 20",
        "AMERN EXPRESS CO",
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS ORD (NYS)",
        "AMERICAN EXPRESS CORP USD0.20 Common Stock",
        "AMERICAN EXPRESS",
        "AMERICAN E",
        "AMERICAN EXPRESS ORD",
        "AMERICAN EXPRESS CO.",
        "AMERICAN EXPRESS CO COM USD0.20",
        "AMERN EXPRESS CO",
        "AMERICAN EXPRESS CO.",
        "AMERICAN EXPRESS COMPANY",
        "AMERICAN EXPRESS CO",
        "American Express Co Com US$0.20",
        "American Express Company",
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS CO",
        "American Express Compa",
        "AMER EXPRESS CO.",
        "American Express Co Com",
        "AMERICAN EXPRESS CO COM USD0.20",
        "AMERICAN EXPRESS CORP",
        "AMERICAN",
        "AXP",
        "AMERICAN EXPRESS INC",
        "AMERICAN EXPRESS CO",
        "AMERICAN EXPRESS CO         COM",
        "AMERICAN EXPRESS CO COM USD0.2",
        "American express co",
        "American Express Co.",
        "American Express Company",
        "AMERICAN EXPRESS CO          COM",
        "AMERICAN EXPRESS COMMON",
        "AMERICAN EXPRESS CO                 C",
        "AmericanExpressCompany",
        "AMEREXPRESS"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/4962/000000496224000013/axp-20231231.htm",
    "item1": "ITEM 1.    BUSINESS\n \n Overview\n American Express is a globally integrated payments company, providing customers with access to products, insights and experiences that enrich lives and build business success. We are a leader in providing credit and charge cards to consumers, small businesses, mid-sized companies and large corporations around the world. American Express®cards issued by us, as well as by third-party banks and other institutions on the American Express network, can be used by Card Members to charge purchases at the millions of merchants around the world that accept cards bearing our logo.\n American Express is a globally integrated payments company, providing customers with access to products, insights and experiences that enrich lives and build business success. We are a leader in providing credit and charge cards to consumers, small businesses, mid-sized companies and large corporations around the world. American Express\n ®\n cards issued by us, as well as by third-party banks and other institutions on the American Express network, can be used by Card Members to charge purchases at the millions of merchants around the world that accept cards bearing our logo.\n Our various products and services are offered globally to diverse customer groups through various channels, including mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, direct mail, telephone, in-house sales teams and direct response advertising.\n We were founded in 1850 as a joint stock association and were incorporated in 1965 as a New York corporation. American Express Company and its principal operating subsidiary, American Express Travel Related Services Company, Inc. (TRS), are bank holding companies under the Bank Holding Company Act of 1956, as amended (the BHC Act), subject to supervision and examination by the Board of Governors of the Federal Reserve System (the Federal Reserve).\n We principally engage in businesses comprising four reportable operating segments: U.S. Consumer Services (USCS), Commercial Services (CS), International Card Services (ICS) and Global Merchant and Network Services (GMNS). Corporate functions and certain other businesses are included in Corporate & Other. Our businesses function together to form our end-to-end integrated payments platform, which we believe is a differentiator that underpins our business model. For further information about our reportable operating segments, see \"Business Segment Results of Operations\" under \"MD&A.\"\n Our Integrated Payments Platform and Technology\n Through our general-purpose card-issuing, merchant-acquiring and card network businesses, we are able to connect participants and provide differentiated value across the commerce path. We maintain direct relationships with Card Members (as a card issuer) and merchants (as an acquirer), which provides us with direct access to information at both ends of the card transaction, distinguishing our integrated payments platform from the bankcard networks. Through contractual relationships, we also obtain information from third-party card issuers, merchant acquirers, aggregators and processors with whom we do business.\n 1\n Table of Contents\n Our integrated payments platform and the systems and infrastructure that underlie it allow us to analyze information on Card Member spending, build models and use analytical tools to help us underwrite risk, reduce fraud and provide targeted marketing and other information services for merchants and partners and special offers and services to Card Members, all while maintaining our commitment to respect Card Member preferences and protect Card Member and merchant data in compliance with applicable policies and legal requirements. We also leverage technology to allow for faster introduction and greater differentiation of products, as well as to develop and improve our service capabilities to continue to deliver a high-quality customer experience.\n Card Issuing Businesses\n Our global proprietary card-issuing businesses are conducted through our USCS, CS and ICS reportable operating segments. We offer a broad set of card products, rewards and services to a diverse consumer and commercial customer base, in the United States and internationally. We acquire and retain high-spending, engaged and creditworthy Card Members by:\n \"Designing innovative credit, charge and debit card products and payment and lending solutions that appeal to our target customer base and meet their spending and borrowing needs\n \"\n Designing innovative credit, charge and debit card products and payment and lending solutions that appeal to our target customer base and meet their spending and borrowing needs\n \"Using incentives to drive spending on our various card products and increase customer engagement, including our Membership Rewards®and Amex®Offers programs, cash-back reward features, interest rates offered on deposits and participation in loyalty programs sponsored by our cobrand and other partners\n Using incentives to drive spending on our various card products and increase customer engagement, including our Membership Rewards\n and Amex\n Offers programs, cash-back reward features, interest rates offered on deposits and participation in loyalty programs sponsored by our cobrand and other partners\n \"Providing digital and mobile services and an array of benefits and experiences across card products, such as lounge access, dining experiences and other travel and lifestyle benefits\n Providing digital and mobile services and an array of benefits and experiences across card products, such as lounge access, dining experiences and other travel and lifestyle benefits\n \"Creating world-class service experiences by delivering exceptional customer care\n Creating world-class service experiences by delivering exceptional customer care\n \"Developing a wide range of partner relationships, including with other corporations and institutions that sponsor certain of our cards under cobrand arrangements and provide benefits and services to our Card Members\n Developing a wide range of partner relationships, including with other corporations and institutions that sponsor certain of our cards under cobrand arrangements and provide benefits and services to our Card Members\n Over the last several years, we have focused on broadening the appeal of our products to attract new customers, particularly Millennial and Gen Z customers, as well as expanding our position with small and mid-sized enterprise (SME) customers by providing more ways to help them manage and grow their businesses. We have a number of products that complement our card products, such as our business checking and consumer rewards checking account products, our business-to-business (B2B) payment products and other non-card payment and financing products, our Business Blueprint digital cash flow management hub, our Resy restaurant platform and other new digital capabilities. Additionally, we are focused on driving growth and efficiencies internationally, including a greater focus on local priorities in international jurisdictions. Jurisdictions that represent a significant portion of our billed business outside of the United States include the United Kingdom (UK), the European Union (EU), Australia, Japan, Canada and Mexico.\n For the year ended December 31, 2023, worldwide billed business (spending on American Express cards issued by us) was $1,460 billion and at December 31, 2023, we had 80.2 million proprietary cards-in-force worldwide.\n Merchant Acquiring Business\n Our GMNS reportable operating segment builds and manages relationships with millions of merchants around the world that choose to accept American Express cards. This includes signing new merchants to accept our cards, agreeing on the discount rate (a fee charged to the merchant for accepting our cards) and handling servicing for merchants. We also build and maintain relationships wit",
    "item1a": "ITEM 1A.    RISK FACTORS\n This section highlights certain risks that could affect us and our businesses, broadly categorized in accordance with the risk types identified in our Enterprise Risk Management (ERM) Framework: \"Strategic & Business, Reputational and Country Risks,\" \"Operational and Compliance/Legal Risks\" and \"Market, Funding & Liquidity, Credit and Model Risks.\" You should carefully consider each of the following risks and all of the other information set forth in this Annual Report on Form 10-K, including in \"Risk Management\" under \"MD&A,\" which describes our approach to identifying, monitoring and managing the risks we assume in conducting our businesses and provides certain quantitative and qualitative disclosures about market risks. The risks and uncertainties we face are not limited to those described below. Additional risks and uncertainties not presently known to us or that we currently believe to be immaterial may also adversely affect our business.\n Strategic & Business, Reputational and Country Risks\n \n Business and economic conditions are a major driver of our results of operations and difficult conditions in the business and economic environment may materially adversely affect our business.\n We offer a broad array of products and services to consumers, small businesses, mid-sized companies and large corporations and thus are very dependent upon the level of consumer and business activity and the demand for payment and financing products. Slow economic growth, economic contraction or shifts in broader consumer and business trends significantly impact customer behaviors, including spending on our cards, the ability and willingness of Card Members to borrow and pay amounts owed to us and demand for fee-based products and services.\n Factors such as consumer spending and confidence, household income and housing prices, unemployment rates, business investment and inventory levels, bankruptcies, geopolitical instability, public policy decisions, government spending, international trade relationships, interest rates, taxes, inflation and deflation (including the effects of related governmental responses), energy costs, availability of capital and credit and the lingering impacts of the COVID-19 pandemic all affect the economic environment and, ultimately, our profitability. Additionally, sustained periods of high inflation may, among other things, increase certain of our expenses and erode consumer purchasing power, confidence and spending. An economic downturn or recession may result in higher unemployment and lower household income, consumer spending, corporate earnings and business investment, which may negatively impact spending on our cards and demand for our products, and increase delinquencies and write-off rates.\n Travel and entertainment (T&E) expenditures, which comprised approximately 28 percent of our worldwide billed business during 2023, for example, are sensitive to business and personal discretionary spending levels and tend to decline during general economic downturns. Likewise, spending by small business and corporate clients, which comprised approximately 43 percent of our worldwide billed business during 2023, depends in part on the economic environment and a favorable climate for continued business investment and new business formation. Increases in delinquencies and write-off rates as a result of increases in bankruptcies, unemployment rates, changes in customer behaviors or otherwise could also have a material adverse effect on our results of operations. The consequences of negative circumstances impacting us or the economic environment generally can be sudden and severe and can impact customer types and geographies in which we operate in very different ways.\n Our business is subject to the effects of geopolitical conditions, weather, natural disasters and other catastrophic events.\n Geopolitical conditions, terrorist attacks, military conflicts, natural disasters, severe weather, widespread health emergencies or pandemics, information or cybersecurity incidents (including intrusion into or degradation or unavailability of systems or technology by cyberattacks), operational incidents and other catastrophic events can have a material adverse effect on our business. Political and social conditions, including actions upending geopolitical stability (such as from tensions involving China and the U.S.), fiscal and monetary policies (including developments related to the U.S. federal debt ceiling, budgetary issues and government shutdowns), trade wars and tariffs, labor shortages, regional or domestic hostilities, economic sanctions and the prospect or occurrence of more widespread conflicts could also negatively affect our business, operations and partners, consumer and business spending, including travel patterns and business investment, and demand for credit. Because we derive a portion of our revenues from travel-related spending, our business is sensitive to safety concerns related to travel and tourism, limitations on travel and mobility and health-related risks. In addition, disruptions in air travel and other forms of travel can result in the payment of claims under travel protection products we offer.\n The COVID-19 pandemic had widespread, rapidly evolving and unpredictable impacts on global society, economies, financial markets and consumer and business behaviors. The pandemic and resulting containment measures adversely impacted a significant portion of our network volumes. The global macroeconomic outlook continues to remain uncertain due to a variety of factors, including the emergence of new variants, impacts to the labor market, supply chain disruptions and inflation. The extent to which our business and results of operations may continue to be adversely affected by this macroeconomic uncertainty will depend on numerous evolving factors and future developments, including the continued spread and severity of the virus and new variants; the availability, distribution, use and effectiveness of treatments and vaccines; the extent and duration of lingering effects on the economy, inflation, consumer confidence and consumer and business spending; and the impact on consumers and businesses as forbearance and government support programs end, including the end of the moratorium on student loan repayments.\n Several military conflicts are taking place across the world (such as the ongoing Russia-Ukraine and Israel-Hamas wars), which may adversely affect our business, and geopolitical tensions may result in additional conflicts or escalate existing conflicts. Following the Russian invasion of Ukraine, we announced that we suspended business operations in Russia and Belarus and this\n 22\n Table of Contents\n conflict has led to economic uncertainty and market disruptions, including the imposition of financial and economic sanctions and export controls designed to constrain Russia. The conflict in Israel and surrounding areas has also created economic uncertainty and regional instability, including due to the risk of escalation into a wider regional conflict, and resulted in the imposition of sanctions targeting Hamas-affiliated individuals and entities. The broader consequences of these conflicts remain uncertain, but may include further sanctions, regional instability and geopolitical shifts, increased prevalence and sophistication of cyberattacks, potential retaliatory action against companies such as us, heightened regulatory scrutiny related to sanctions compliance, increased inflation, further increases or fluctuations in commodity and energy prices, decreases in global travel, further disruptions to the global supply chain and other adverse effects on macroeconomic conditions.\n Hurricanes and other natural disasters have impacted spending and credit performance in the areas affected. Other disasters or catastrophic events in the future, and the impact of such events on certain industries or the overall economy",
    "item7": "ITEM 7.    MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS (MD&A)\n \n EXECUTIVE OVERVIEW\n BUSINESS INTRODUCTION\n We are a globally integrated payments company with four reportable operating segments: U.S. Consumer Services (USCS), Commercial Services (CS), International Card Services (ICS) and Global Merchant and Network Services (GMNS). Corporate functions and certain other businesses and operations are included in Corporate & Other.\n Our range of products and services includes:\n \"Credit card, charge card, banking and other payment and financing products\n \"\n Credit card, charge card, banking and other payment and financing products\n \"Merchant acquisition and processing, servicing and settlement, and point-of-sale marketing and information products and services for merchants\n Merchant acquisition and processing, servicing and settlement, and point-of-sale marketing and information products and services for merchants\n \"Network services\n Network services\n \"Other fee services, including fraud prevention services and the design and operation of customer loyalty programs\n Other fee services, including fraud prevention services and the design and operation of customer loyalty programs\n \"Expense management products and services\n Expense management products and services\n \"Travel and lifestyle services\n Travel and lifestyle services\n Our various products and services are offered globally to diverse customer groups, including consumers, small businesses, mid-sized companies and large corporations. These products and services are offered through various channels, including mobile and online applications, affiliate marketing, customer referral programs, third-party service providers and business partners, direct mail, telephone, in-house sales teams and direct response advertising.\n The following types of revenue are generated from our various products and services:\n \"Discount revenue, our largest revenue source, represents the amount we earn and retain from the merchant payable for facilitating transactions between Card Members and merchants on payment products issued by American Express. The amount of fees charged for accepting our cards as payment, or merchant discount, varies with, among other factors, the industry in which the merchant conducts business, the merchant's overall American Express-related transaction volume, the method of payment, the settlement terms with the merchant, the method of submission of transactions and, in certain instances, the geographic scope for the card acceptance agreement between the merchant and us (e.g., local or global) and the transaction amount. In some instances, an additional flat transaction fee is assessed as part of the merchant discount, and additional fees may be charged such as a variable fee for \"non-swiped\" card transactions or for transactions using cards issued outside the United States at merchants located in the United States;\n Discount revenue, our largest revenue source, represents the amount we earn and retain from the merchant payable for facilitating transactions between Card Members and merchants on payment products issued by American Express. The amount of fees charged for accepting our cards as payment, or merchant discount, varies with, among other factors, the industry in which the merchant conducts business, the merchant's overall American Express-related transaction volume, the method of payment, the settlement terms with the merchant, the method of submission of transactions and, in certain instances, the geographic scope for the card acceptance agreement between the merchant and us (e.g., local or global) and the transaction amount. In some instances, an additional flat transaction fee is assessed as part of the merchant discount, and additional fees may be charged such as a variable fee for \"non-swiped\" card transactions or for transactions using cards issued outside the United States at merchants located in the United States;\n \"Interest income, principally represents interest earned on outstanding loan balances;\n Interest income, principally represents interest earned on outstanding loan balances;\n \"Net card fees, represent revenue earned from annual card membership fees, which vary based on the type of card and the number of cards for each account;\n Net card fees, represent revenue earned from annual card membership fees, which vary based on the type of card and the number of cards for each account;\n \"Service fees and other revenue, primarily represent service fees earned from merchants and other customers, travel commissions and fees, Card Member delinquency fees, foreign currency-related fees charged to Card Members, and income (losses) from our investments in which we have significant influence; and\n Service fees and other revenue, primarily represent service fees earned from merchants and other customers, travel commissions and fees, Card Member delinquency fees, foreign currency-related fees charged to Card Members, and income (losses) from our investments in which we have significant influence; and\n \"Processed revenue, primarily represents revenues related to network partnership agreements, comprising royalties, fees and amounts earned for facilitating transactions on cards issued by network partners.\n Processed revenue, primarily represents revenues related to network partnership agreements, comprising royalties, fees and amounts earned for facilitating transactions on cards issued by network partners.\n Refer to the \"Glossary of Selected Terminology\" below for the definitions of certain key terms and related information appearing within this Form 10-K.\n NON-GAAP MEASURES\n We prepare our Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States of America (GAAP). However, certain information included within this report constitutes non-GAAP financial measures. Our calculations of non-GAAP financial measures may differ from the calculations of similarly titled measures by other companies.\n 42\n Table of Contents\n TABLE 1: SUMMARY OF FINANCIAL PERFORMANCEYears Ended December 31,ChangeChange(Millions, except percentages, per share amounts and where indicated)2023202220212023 vs. 20222022 vs. 2021Selected Income Statement DataTotal revenues net of interest expense$60,515$52,862$42,380$7,65314%$10,48225%Provisions for credit losses4,9232,182(1,419)2,741#3,601#Total expenses45,07941,09533,1103,984107,98524Pretax income10,5139,58510,68992810(1,104)(10)Income tax provision2,1392,0712,629683(558)(21)Net income8,3747,5148,06086011(546)(7)Earnings per common share   diluted(a)$11.21$9.85$10.02$1.3614%$(0.17)(2)%Selected Balance Sheet DataCash and cash equivalents$46,596$33,914$22,028$12,68237%$11,88654%Card Member receivables60,41157,61353,6452,79853,9687Card Member loans125,995107,96488,56218,0311719,40222Customer deposits129,144110,23984,38218,9051725,85731Long-term debt$47,866$42,573$38,675$5,29312%$3,89810%Common Share Statistics(b)Cash dividends declared per common share$2.40$2.08$1.72$0.3215%$0.3621%Average common shares outstanding:Basic735751789(16)(2)%(38)(5)%Diluted736752790(16)(2)%(38)(5)%Selected Metrics and RatiosNetwork volumes(Billions)$1,680.1$1,552.8$1,284.2$1278%$26921%Billed business(Billions)$1,459.6$1,338.3$1,089.8$1219%$24923%Card Member loans and receivablesNet write-off rate   principal, interest and fees(c)2.0%1.0%0.8%Net write-off rate   principal only - consumer and small business(c)(d)1.8%0.9%0.7%30+ days past due as a % of total - consumer and small business(e)1.3%1.1%0.7%Effective tax rate20.3%21.6%24.6%Return on average equity(f)31.5%32.3%33.7%Common Equity Tier 110.5%10.3%10.5%# Denotes a variance of 100 percent or more\n TABLE 1: SUMMARY OF FINANCIAL PERFORMANCE\n Years Ended December 31,ChangeChange(Millions, except percentages, per share amounts and where indicated)2023202220212023 vs. 20222022 vs. 2021Selected Income Statement DataTotal revenues net of interest expense$",
    "item7a": "ITEM 7A.    QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n Refer to \"Risk Management\" under \"MD&A\" for quantitative and qualitative disclosures about market risk.\n \n"
}