{
    "cik": 12927,
    "cusip6": "097023",
    "cusip": [
        "097023105"
    ],
    "names": [
        "BOEING COMPANY",
        "BOEING CO COM",
        "BOEING CO",
        "Boeing Co/The",
        "Boeing Co",
        "BOEING",
        "BOEING CO.",
        "Boeing Company",
        "1BOEING CO",
        "BOEING CO",
        "BOEING CO",
        "Boeing Co/The - US",
        "Boeing",
        "BOEING CO/THE",
        "THE BOEING COMPANY",
        "BOEING CO",
        "BOEING COMPANY CMN",
        "BOEING  CO",
        "BOEING CO",
        "BOEING COTHE",
        "BOEING CO",
        "BOEING CO.",
        "BLUCORA INC",
        "The Boeing Company",
        "BOEING CO (THE)",
        "Boeing Co The",
        "Boeing Co/the",
        "BOEING CO",
        "BOEING CO",
        "Boeing Co.",
        "BOEING ORD (NYS)",
        "BOEING CO USD5 Common Stock",
        "The Boeing Co.",
        "BOEING CO COM",
        "BOEING CO",
        "BOEING ORD",
        "THE BOEING COMPANY",
        "Boeing Company Inc",
        "BOEING COMPANY/THE",
        "BOEING CO",
        "Boeing Company",
        "Boeing Co",
        "BOEING CO",
        "BOEING CO",
        "BOEING CO",
        "BOEING CO                   COM",
        "Boeing",
        "Boeing Co Com",
        "BOEING CO",
        "Boeing Corp.",
        "BOEING CO THE",
        "Boeing CO",
        "BA",
        "The Boeing Co",
        "BOEING COMPANY              COM",
        "BOEING CO COM USD5.00",
        "Boeing Co./The",
        "Boeing CO.",
        "BOEING COMPANY               COM",
        "BOEING COMPANY",
        "Boeing Co Common",
        "BOEING CO                           C",
        "BOEINGCO",
        "Boeing Company (BA)",
        "BOEING CO CAPITAL STOCK COMMON",
        "BOEING CO COMMON",
        "Boeing Company (The)"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/12927/000001292724000010/ba-20231231.htm",
    "item1": "Item 1. Business\n The Boeing Company, together with its subsidiaries (herein referred to as \"Boeing,\" the \"Company,\" \"we,\" \"us,\" \"our\"), is one of the world's major aerospace firms.\n We are organized based on the products and services we offer. We operate in three reportable segments:\n \"Commercial Airplanes (BCA);\n \"\n Commercial Airplanes (BCA);\n \"Defense, Space & Security (BDS);\n Defense, Space & Security (BDS);\n \"Global Services (BGS).\n Global Services (BGS).\n \n Commercial Airplanes Segment\n This segment develops, produces and markets commercial jet aircraft principally to the commercial airline industry worldwide. We are a leading producer of commercial aircraft and offer a family of commercial jetliners designed to meet a broad spectrum of global passenger and cargo requirements of airlines. This family of commercial jet aircraft in production includes the 737 narrow-body model and the 767, 777 and 787 wide-body models. Development continues on the 777X program and the 737-7 and 737-10 derivatives.\n Defense, Space & Security Segment\n This segment engages in the research, development, production and modification of manned and unmanned military aircraft and weapons systems for strike, surveillance and mobility, including fighter and trainer aircraft; vertical lift, including rotorcraft and tilt-rotor aircraft; and commercial derivative aircraft, including anti-submarine and tanker aircraft. In addition, this segment engages in the research, development, production and modification of the following products and related services: strategic defense and intelligence systems, including strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR), cyber and information solutions, and intelligence systems, satellite systems, including government and commercial satellites and space exploration.\n Global Services Segment\n This segment provides services to our commercial and defense customers worldwide. Global Services sustains aerospace platforms and systems with a full spectrum of products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services.\n Intellectual Property\n We own numerous patents and have licenses for the use of patents owned by others, which relate to our products and their manufacture. In addition to owning a large portfolio of intellectual property, we also license intellectual property to and from third parties. For example, the U.S. government has licenses in our patents that are developed in performance of government contracts, and it may use or authorize others to use the inventions covered by such patents for government purposes. Unpatented research, development and engineering skills, as well as certain trademarks, trade secrets and other intellectual property rights, also make an important contribution to our business. While our intellectual\n 1\n Table of Contents\n property rights in the aggregate are important to the operation of each of our businesses, we do not believe that our business would be materially affected by the expiration of any particular intellectual property right or termination of any particular intellectual property patent license agreement.\n Human Capital\n As of December 31, 2023 and 2022, Boeing's total workforce was approximately 171,000 and 156,000 with 14% and 13% located outside of the U.S.\n As of December 31, 2023, our workforce included approximately 57,000 union members. Our principal collective bargaining agreements and their current status are summarized in the following table:\n UnionPercent of our Employees RepresentedStatus of Major Agreements with UnionThe International Association of Machinists and Aerospace Workers (IAM)21%We have two major agreements; one with IAM District 751 (Washington) expiring in September 2024 and one with IAM District 837 (Missouri) expiring in July 2025.The Society of Professional Engineering Employees in Aerospace (SPEEA)10%We have two major agreements; one with SPEEA Professional and one with SPEEA Technical, both expiring in October 2026.The United Automobile, Aerospace and Agricultural Implement Workers of America (UAW)1%We have one major agreement with UAW District 1069 (Pennsylvania) expiring in April 2027.\n UnionPercent of our Employees RepresentedStatus of Major Agreements with Union\n Union\n Percent of our Employees Represented\n Status of Major Agreements with Union\n The International Association of Machinists and Aerospace Workers (IAM)21%We have two major agreements; one with IAM District 751 (Washington) expiring in September 2024 and one with IAM District 837 (Missouri) expiring in July 2025.\n The International Association of Machinists and Aerospace Workers (IAM)\n 21%\n We have two major agreements; one with IAM District 751 (Washington) expiring in September 2024 and one with IAM District 837 (Missouri) expiring in July 2025.\n The Society of Professional Engineering Employees in Aerospace (SPEEA)10%We have two major agreements; one with SPEEA Professional and one with SPEEA Technical, both expiring in October 2026.\n The Society of Professional Engineering Employees in Aerospace (SPEEA)\n 10%\n We have two major agreements; one with SPEEA Professional and one with SPEEA Technical, both expiring in October 2026.\n The United Automobile, Aerospace and Agricultural Implement Workers of America (UAW)1%We have one major agreement with UAW District 1069 (Pennsylvania) expiring in April 2027.\n The United Automobile, Aerospace and Agricultural Implement Workers of America (UAW)\n 1%\n We have one major agreement with UAW District 1069 (Pennsylvania) expiring in April 2027.\n Guided by our values, we are committed to creating a company where everyone is included and respected, and where we support each other in reaching our full potential. We are committed to diverse representation across all levels of our workforce to reflect the vibrant and thriving diversity of the communities in which we live and work. In May 2023, we released our third Global Equity, Diversity and Inclusion report with our workforce composition. As of December 2022, our global workforce was comprised of approximately 24% women, and our U.S. workforce was comprised of 35% racial and ethnic minorities and 15% U.S. veterans. We also support Business Resource Groups open to all employees with more than 15,000 participants across 176 chapters globally that focus on gender, race and ethnicity, generations, gender identity, sexual orientation, disability or veteran status. These groups help foster inclusion among all teammates, build awareness, recruit and retain a diverse workforce and support the company in successfully operating in a global, multicultural business environment.\n To attract and retain the best-qualified talent, we offer competitive benefits, including market-competitive compensation, healthcare, paid time off, parental leave, retirement benefits, tuition assistance, employee skills development, leadership development and rotation programs. In 2023, our voluntary resignation rate was approximately 3%. Additionally, we hired approximately 23,000 new employees in 2023 for critical skills and had an offer acceptance rate of 82%.\n Employees are encouraged to provide feedback about their experience through ongoing employee engagement activities. Boeing actively listens to its employees via surveys ranging from pre-hire to exiting the company. These voluntary surveys provide aggregate trend reports for the company to address in real time and ensure Boeing maintains an employee-focused experience and culture. We also invest in rewarding performance and have established a multi-level recognition program for the purpose of acknowledging the achievements of excellent individual or team performance.\n 2\n We are comm",
    "item1a": "Item 1A. Risk Factors\n An investment in our common stock or debt securities involves risks and uncertainties, and our actual results and future trends may differ materially from our past or projected future performance. We urge investors to consider carefully the risk factors described below in evaluating the information contained in this report.\n Risks Related to Our Business and Operations\n We depend heavily on commercial airlines, subjecting us to unique risks.\n Market conditions have a significant impact on demand for our commercial aircraft and related services.The commercial aircraft market is predominantly driven by long-term trends in airline passenger and cargo traffic. The principal factors underlying long-term traffic growth are sustained economic growth and political stability both in developed and emerging markets. Demand for our commercial aircraft is further influenced by airline profitability, availability of aircraft financing, world trade policies, government-to-government relations, technological advances, price and other competitive factors, fuel prices, terrorism, pandemics, epidemics and environmental regulations. Historically, the airline industry has been cyclical and very competitive and has experienced significant profit swings and constant challenges to be more cost competitive. Significant deterioration in the global economic environment, the airline industry generally or the financial stability of one or more of our major customers could result in fewer new orders for aircraft or services, or could cause customers to seek to postpone or cancel contractual orders and/or payments to us, which could result in lower revenues, profitability and cash flows and a reduction in our contractual backlog. In addition, because our commercial aircraft backlog consists of aircraft scheduled for delivery over a period of several years, any of these macroeconomic, industry or customer impacts could unexpectedly affect deliveries over a long period.\n Market conditions have a significant impact on demand for our commercial aircraft and related services.\n The commercial aircraft market is predominantly driven by long-term trends in airline passenger and cargo traffic. The principal factors underlying long-term traffic growth are sustained economic growth and political stability both in developed and emerging markets. Demand for our commercial aircraft is further influenced by airline profitability, availability of aircraft financing, world trade policies, government-to-government relations, technological advances, price and other competitive factors, fuel prices, terrorism, pandemics, epidemics and environmental regulations. Historically, the airline industry has been cyclical and very competitive and has experienced significant profit swings and constant challenges to be more cost competitive. Significant deterioration in the global economic environment, the airline industry generally or the financial stability of one or more of our major customers could result in fewer new orders for aircraft or services, or could cause customers to seek to postpone or cancel contractual orders and/or payments to us, which could result in lower revenues, profitability and cash flows and a reduction in our contractual backlog. In addition, because our commercial aircraft backlog consists of aircraft scheduled for delivery over a period of several years, any of these macroeconomic, industry or customer impacts could unexpectedly affect deliveries over a long period.\n We enter into firm fixed-price aircraft sales contracts with indexed price escalation clauses, which could subject us to losses if we have cost overruns or if increases in our costs exceed the applicable escalation rate.Commercial aircraft sales contracts are often entered into years before the aircraft are delivered. In order to help account for economic fluctuations between the contract date and delivery date, aircraft pricing generally consists of a fixed amount as modified by price escalation formulas derived from labor, commodity and other price indices. Our revenue estimates are based on current expectations with respect to these escalation formulas, but the actual escalation amounts are outside of our control. Escalation factors can fluctuate significantly from period to period. Changes in escalation amounts can significantly impact revenues and operating margins in our BCA business.\n We enter into firm fixed-price aircraft sales contracts with indexed price escalation clauses, which could subject us to losses if we have cost overruns or if increases in our costs exceed the applicable escalation rate.\n Commercial aircraft sales contracts are often entered into years before the aircraft are delivered. In order to help account for economic fluctuations between the contract date and delivery date, aircraft pricing generally consists of a fixed amount as modified by price escalation formulas derived from labor, commodity and other price indices. Our revenue estimates are based on current expectations with respect to these escalation formulas, but the actual escalation amounts are outside of our control. Escalation factors can fluctuate significantly from period to period. Changes in escalation amounts can significantly impact revenues and operating margins in our BCA business.\n We derive a significant portion of our revenues from a limited number of commercial airlines.We can make no assurance that any customer will exercise purchase options, fulfill existing purchase commitments or purchase additional products or services from us. In addition, fleet decisions, airline consolidations or financial challenges involving any of our major commercial airline customers could significantly reduce our revenues and limit our opportunity to generate profits from those customers. Airlines also are experiencing increased fuel and other costs, and the global economy has experienced high inflation.\n We derive a significant portion of our revenues from a limited number of commercial airlines.\n We can make no assurance that any customer will exercise purchase options, fulfill existing purchase commitments or purchase additional products or services from us. In addition, fleet decisions, airline consolidations or financial challenges involving any of our major commercial airline customers could significantly reduce our revenues and limit our opportunity to generate profits from those customers. Airlines also are experiencing increased fuel and other costs, and the global economy has experienced high inflation.\n Our Commercial Airplanes business depends on our ability to maintain a healthy production system, ensure every airplane in our production system conforms to exacting specifications,\n 6\n \n Table of Contents\n achieve planned production rate targets, successfully develop and certify new aircraft or new derivative aircraft, and meet or exceed stringent performance and reliability standards.\n The commercial aircraft business is extremely complex, involving extensive coordination and integration with U.S. and non-U.S. suppliers, highly-skilled labor performed by thousands of employees of ours and other partners, and stringent and evolving regulatory requirements and performance and reliability standards. We have experienced and may continue to experience production quality issues, including in our supply chain.\n On January 10, 2024, the FAA notified us that it has initiated an investigation into our quality control system. This was followed by the FAA announcing actions to increase its oversight of us, including conducting (1) an audit involving the 737-9 production line and suppliers to evaluate compliance with approved quality procedures, (2) increased monitoring of 737-9 in-service events, and (3) an assessment of safety risks around delegated authority and quality oversight, and examination of options to move these functions under independent third parties. On January 24, 2024, the FAA stated that it wi",
    "item7": "Item 1B. Unresolved Staff Comments\n Not applicable\n \n Item 1C. Cybersecurity\n Risk Management and Strategy\n Our cybersecurity strategy prioritizes detection, analysis and response to known, anticipated or unexpected threats; effective management of security risks; and resiliency against incidents. Our cybersecurity risk management processes include technical security controls, policy enforcement mechanisms, monitoring systems, employee training, contractual arrangements, tools and related services from third-party providers, and management oversight to assess, identify and manage material risks from cybersecurity threats. We implement risk-based controls to protect our information, the information of our customers, suppliers, and other third parties, our information systems, our business operations, and our products and related services. We have adopted security-control principles based on the National Institute of Standards and Technology (NIST) Cybersecurity Framework, other industry-recognized standards, and contractual requirements, as applicable. We also leverage government partnerships, industry and government associations, third-party benchmarking, the results from regular internal and third-party audits, threat intelligence feeds, and other similar resources to inform our cybersecurity processes and allocate resources.\n We maintain security programs that include physical, administrative and technical safeguards, and we maintain plans and procedures whose objective is to help us prevent and timely and effectively respond to cybersecurity threats or incidents. Through our cybersecurity risk management process, we continuously monitor cybersecurity vulnerabilities and potential attack vectors to company systems as well as our aerospace products and services, and we evaluate the potential operational and financial\n 17\n Table of Contents\n effects of any threat and of cybersecurity countermeasures made to defend against such threats. We continue to integrate our cyber practice into our Enterprise Risk Management program and our Compliance Risk Management program, both of which are overseen by our Board of Directors and provide central, standardized frameworks for identifying and tracking cyber-related business and compliance risks across the Company. Risks from cybersecurity threats to our products and services are also overseen by our Board of Directors. In addition, we periodically engage third-party consultants to assist us in assessing, enhancing, implementing, and monitoring our cybersecurity risk management programs and responding to any incidents.\n As part of our cybersecurity risk management process, we conduct \"tabletop\" exercises during which we simulate cybersecurity incidents to ensure that we are prepared to respond to such an incident and to highlight any areas for potential improvement in our cyber incident preparedness. These exercises are conducted at both the technical level and senior management level, which has included participation by a member of our Board of Directors. In addition, all employees are required to pass a mandatory cybersecurity training course on an annual basis and receive monthly phishing simulations to provide \"experiential learning\" on how to recognize phishing attempts.\n We have established a cybersecurity supply chain risk management program, which is a cross-functional program that forms part of our Enterprise Risk Management program and is supported by our security, compliance, and supply chain organizations. Through this evolving program, we assess the risks from cybersecurity threats that impact select suppliers and third-party service providers with whom we share personal identifying and confidential information. We continue to evolve our oversight processes to mature how we identify and manage cybersecurity risks associated with the products or services we procure from such suppliers. We generally require our suppliers to adopt security-control principles based on industry-recognized standards.\n We have experienced, and may in the future experience, whether directly or through our supply chain or other channels, cybersecurity incidents. While prior incidents have not materially affected our business strategy, results of operations or financial condition, and although our processes are designed to help prevent, detect, respond to, and mitigate the impact of such incidents, there is no guarantee that a future cyber incident would not materially affect our business strategy, results of operations or financial condition. See \"Risks Related to Cybersecurity and Business Disruptions\" in \"Risk Factors\" on page 14 of this Form 10-K.\n Governance\n Our Board of Directors has overall responsibility for risk oversight, with its committees assisting the Board in performing this function based on their respective areas of expertise. Our Board of Directors has delegated oversight of risks related to cybersecurity to two Board committees, the Audit Committee and the Aerospace Safety Committee, and each committee reports on its activities and findings to the full Board after each meeting. The Audit Committee is charged with reviewing our cybersecurity processes for assessing key strategic, operational, and compliance risks. Our Chief Information Officer and Senior Vice President, Information Technology & Data Analytics (CIO) and our Chief Security Officer (CSO) provide presentations to the Audit Committee on cybersecurity risks at each of its bimonthly meetings. These briefings include assessments of cyber risks, the threat landscape, updates on incidents, and reports on our investments in cybersecurity risk mitigation and governance. In addition, the Audit Committee has designated one of its members with expertise in cyber risk management to meet regularly with management and review our cybersecurity strategy and key initiatives and progress toward our objectives. In the event of a potentially material cybersecurity event, the Chair of the Audit Committee is notified and briefed, and meetings of the Audit Committee and/or full Board of Directors would be held, as appropriate. The Aerospace Safety Committee provides oversight of the risks from cybersecurity threats related to our aerospace products and services. The Aerospace Safety Committee receives regular updates and reports from senior management, including the Chief\n 18\n Engineer, the Chief Aerospace Safety Officer, and the Chief Product Security Engineer, who provide briefings on significant cybersecurity threats or incidents that may pose a risk to the safe operation of our aerospace products. Both committees brief the full Board on cybersecurity matters discussed during committee meetings, and the CIO provides annual briefings to the Board on information technology and data analytics related matters, including cybersecurity.\n At the management level, we have established a Global Security Governance Council (the Council) to further strengthen our cybersecurity risk management activities across the Company, including the prevention, detection, mitigation, and remediation of cybersecurity incidents. The Council is responsible for developing and coordinating enterprise cybersecurity policy and strategy, and for providing guidance to key management and oversight bodies.\n Richard Puckett, as our CSO, serves as the chair of the Council. He is responsible for overseeing a unified security program that provides cybersecurity, fire and protection operations, physical security, insider threat, and classified security. Mr. Puckett has nearly 30 years of experience in the cybersecurity industry, including, prior to joining Boeing in 2022, as Chief Information Security Officer of SAP SE and Thomson Reuters Corporation, Vice President, Product and Commercial Security of General Electric, Inc., and Senior Security Architect at Cisco Systems, Inc. He reports directly to the CIO and meets regularly with other members of senior management and the Audit Committee.\n The Council",
    "item7a": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\n Interest Rate Risk\n We have financial instruments that are subject to interest rate risk, principally fixed-rate debt obligations. The investors in our fixed-rate debt obligations do not generally have the right to demand we pay off these obligations prior to maturity. Therefore, exposure to interest rate risk is not believed to be material for our fixed-rate debt.\n Foreign Currency Exchange Rate Risk\n We are subject to foreign currency exchange rate risk relating to receipts from customers and payments to suppliers in foreign currencies. We use foreign currency forward contracts to hedge the price risk associated with firmly committed and forecasted foreign denominated payments and receipts related to our ongoing business. Foreign currency forward contracts are sensitive to changes in foreign currency exchange rates. At December 31, 2023, a 10% increase or decrease in the exchange rate in our portfolio of foreign currency contracts would have increased or decreased our unrealized losses by $361 million. Consistent with the use of these contracts to neutralize the effect of exchange rate fluctuations, such unrealized losses or gains would be offset by corresponding gains or losses, respectively, in the remeasurement of the underlying transactions being hedged. When taken together, these forward currency contracts and the offsetting underlying commitments do not create material market risk.\n Commodity Price Risk\n We are subject to commodity price risk relating to commodity purchase contracts for items used in production that are subject to changes in the market price. We use commodity swaps and commodity purchase contracts to hedge against these potentially unfavorable price changes. Our commodity purchase contracts and derivatives are both sensitive to changes in the market price. At December 31, 2023, a 10% increase or decrease in the market price in our commodity derivatives would have increased or decreased our unrealized losses by $37 million. Consistent with the use of these contracts to neutralize the effect of market price fluctuations, such unrealized losses or gains would be offset by corresponding gains or losses, respectively, in the remeasurement of the underlying transactions being hedged. When taken together, these commodity purchase contracts and the offsetting swaps do not create material market risk.\n Market Risk\n Participants in deferred compensation plans can diversify the deferred amounts among investment funds which are subject to potential changes in fair value. As of December 31, 2023, the deferred compensation liability, which is being marked to market, was $1.6 billion. A 10% change in the fair value of these investment funds would increase or decrease the liability by $164 million. Changes in the liability are recorded in operating earnings.\n 49\n \n Table of Contents\n"
}