{
    "cik": 18230,
    "cusip6": "149123",
    "cusip": [
        "149123101"
    ],
    "names": [
        "CATERPILLAR INC",
        "CATERPILLAR INC COM",
        "Caterpillar Inc",
        "Caterpillar Inc Del",
        "CATERPILLAR INC.",
        "Caterpillar Inc.",
        "Caterpillar",
        "Caterpillar Inc - US",
        "Caterpillar",
        "CATERPILLAR       INC",
        "CATERPILLAR",
        "Caterpillar Inc",
        "CATERPILLAR INC DEL",
        "CATERPILLAR INC",
        "CATERPILLAR INC",
        "CATERPILLAR INC (DELAWARE) CMN",
        "Caterpillar, Inc.",
        "CATERPILLAR INC.",
        "CASEYS GENERAL STORES INC",
        "CATERPILLAR INC DEL COM",
        "Caterpillar Inc",
        "CATERPILLAR INC",
        "CAT 17NOV23 200 P",
        "CATERPILLAR INCORPORATED",
        "CATERPILLAR INS COM",
        "CATERPILLAR INC",
        "CATERPILLAR INC",
        "CATERPILLAR ORD (NYS)",
        "CATERPILLER INC",
        "CATERPILLAR INC USD1 Common Stock",
        "Caterpillar Inc Common",
        "Caterpillar Inc",
        "CATERPILLA",
        "CATERPILLAR ORD",
        "CATERPILLAR INC COM",
        "CATERPILLARINCCOM",
        "CATERPILLAR INC DEL",
        "CATERPILLAR INC",
        "CATERPILLAR INC",
        "Caterpillar",
        "Caterpillar Tractor",
        "Caterpillar Inc.",
        "Caterpillar Inc Del Com",
        "CATERPILLAR INC (DELAWARE)",
        "CATERPILLAR INC",
        "CATERPILLAR INC             COM",
        "CAT",
        "Caterpillar Inc",
        "CATERPILLAR TRACTOR",
        "Caterpillar",
        "CATERPILLAR INC COM",
        "CATERPILLAR INC",
        "CATERPILLER",
        "CATERPILLAR INC.            COM",
        "Caterpillar Incorporated",
        "Caterpillar, Inc",
        "Caterpillar Inc Com",
        "CATERPILLAR INC DEL",
        "Caterpillar inc",
        "Caterpiller, Inc DEL",
        "CATERPILLAR INC              COM",
        "CATERPILLAR INC                     C",
        "CATERPILLAR INC DEL         COM",
        "CATERPILLAR INC STOCK",
        "CATERPILLAR INC COM USD1.00",
        "CATERPILLARI",
        "CATERPILLAR, INC.",
        "CATERPILLAR INC. COMMON"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/18230/000001823024000009/cat-20231231.htm",
    "item1": "Item 1.Business.\n Item 1.\n Business.\n \n General\n Originally organized as Caterpillar Tractor Co. in 1925 in the State of California, our company was reorganized as Caterpillar Inc. in 1986 in the State of Delaware.  As used herein, the term \"Caterpillar,\" \"we,\" \"us,\" \"our\" or \"the company\" refers to Caterpillar Inc. and its subsidiaries unless designated or identified otherwise.\n Overview\n With 2023 sales and revenues of $67.060 billion, Caterpillar is the world's leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives.  The company principally operates through its three primary segments - Construction Industries, Resource Industries and Energy & Transportation - and also provides financing and related services through its Financial Products segment.  Caterpillar is also a leading U.S. exporter.  Through a global network of independent dealers and direct sales of certain products, Caterpillar builds long-term relationships with customers around the world.\n Enterprise Strategy\n Our company strategy, rolled out in 2017, reflects our legacy and our continuing commitment to meet the needs of our customers and the communities in which we live and work. United by our Values, Caterpillar employees around the world share a focused view of our business through the Operating & Execution Model, through which we are making strategic choices today to create long-term profitable growth. Since 2017, we focused on three strategic areas: Expanded Offerings, Operational Excellence and Services. In 2022, we updated our strategy to also include Sustainability as a strategic area. For nearly 100 years, our longstanding commitment to sustainability has inspired us to set and achieve meaningful environmental, social and governance goals. It's also allowed us to develop innovative products, technologies and services to support our customers on their sustainability journey. The addition of sustainability as a strategic area, together with operational excellence, expanded offerings and services, highlights our work to help customers build a better, more sustainable world.\n Currently, we have five operating segments, of which four are reportable segments and are described below.\n Categories of Business Organization\n 1.Machinery, Energy & TransportationCaterpillar Inc. and its subsidiaries, excluding Financial Products.  Machinery, Energy & Transportation information relates to the design, manufacturing and marketing of our products.\n 1.\n Machinery, Energy & Transportation\n Caterpillar Inc. and its subsidiaries, excluding Financial Products.  Machinery, Energy & Transportation information relates to the design, manufacturing and marketing of our products.\n 2.Financial ProductsOur finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n 2.\n Financial Products\n Our finance and insurance subsidiaries, primarily Caterpillar Financial Services Corporation (Cat Financial) and Caterpillar Insurance Holdings Inc. (Insurance Services). Financial Products information relates to the financing to customers and dealers for the purchase and lease of Caterpillar and other equipment.\n Other information about our operations in 2023, including certain risks associated with our operations, is included in Part II, Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\n Construction Industries\n Our Construction Industries segment is primarily responsible for supporting customers using machinery in infrastructure and building construction.  The majority of machine sales in this segment are made in the heavy and general construction, rental, quarry and aggregates and mining.\n The nature of customer demand for construction machinery varies around the world.  Customers in developing economies often prioritize purchase price in making their investment decisions, while customers in developed economies generally weigh productivity and other performance criteria that contribute to lower owning and operating costs over the lifetime of the machine.  To meet customer expectations in developing economies, Caterpillar developed differentiated product offerings that target customers in those regions, including our SEM brand machines.  We believe that these customer-driven product innovations enable us to compete more effectively in developing economies.  The majority of Construction Industries' research and development spending in 2023 focused on the next generation of construction machines.\n 1\n Table of Contents\n The competitive environment for construction machinery is characterized by some global competitors and many regional and specialized local competitors.Examples of global competitors include CASE (part of CNH Industrial N.V.), Deere Construction & Forestry (part of Deere & Company), Doosan Bobcat (Part of Doosan Group), Hitachi Construction Machinery Co., Ltd., Hyundai Construction Equipment Co., Ltd., Hyundai Doosan Infracore Co., Ltd. (both part of Hyundai Heavy Industries Group), J.C. Bamford Excavators Ltd., Kobelco Construction Machinery (part of Kobe Steel, Ltd), Komatsu Ltd., Kubota Farm & Industrial Machinery (part of Kubota Corporation), Sany Heavy Industry Co., Ltd., and Volvo Construction Equipment (part of the Volvo Group).As an example of regional and local competitors, our competitors in China also include Guangxi LiuGong Machinery Co., Ltd., Longking Holdings Ltd., Sany Heavy Industry Co, XCMG Construction Machinery Co., Ltd., Shandong Lingong Construction Machinery Co., Ltd. (SDLG, JV with Volvo Construction Equipment) and Shantui Construction Machinery Co., Ltd., (part of Shandong Heavy Industry Group Co.).Each of these companies has varying product lines that compete with Caterpillar products, and each has varying degrees of regional focus.\n The competitive environment for construction machinery is characterized by some global competitors and many regional and specialized local competitors.\n Examples of global competitors include CASE (part of CNH Industrial N.V.), Deere Construction & Forestry (part of Deere & Company), Doosan Bobcat (Part of Doosan Group), Hitachi Construction Machinery Co., Ltd., Hyundai Construction Equipment Co., Ltd., Hyundai Doosan Infracore Co., Ltd. (both part of Hyundai Heavy Industries Group), J.C. Bamford Excavators Ltd., Kobelco Construction Machinery (part of Kobe Steel, Ltd), Komatsu Ltd., Kubota Farm & Industrial Machinery (part of Kubota Corporation), Sany Heavy Industry Co., Ltd., and Volvo Construction Equipment (part of the Volvo Group).\n As an example of regional and local competitors, our competitors in China also include Guangxi LiuGong Machinery Co., Ltd., Longking Holdings Ltd., Sany Heavy Industry Co, XCMG Construction Machinery Co., Ltd., Shandong Lingong Construction Machinery Co., Ltd. (SDLG, JV with Volvo Construction Equipment) and Shantui Construction Machinery Co., Ltd., (part of Shandong Heavy Industry Group Co.).\n Each of these companies has varying product lines that compete with Caterpillar products, and each has varying degrees of regional focus.\n The Construction Industries portfolio includes the following product families as well as related parts and work tools:\n · asphalt pavers· motor graders· track-type tractors (small, medium)· backhoe loaders· pipelayers· track excavators (mini, small· cold planers· road reclaimersmedium, large)· compactors· skid steer loaders· wheel excavators· compact track loaders· telehandlers· wheel loaders (compact, small,· forestry machines· track-type loadersmedium)· material handlers\n · asphalt pavers· motor graders· track-type tractors (small, medium)\n · asphalt pavers\n · motor graders\n · track-type tract",
    "item1a": "Item 1A.Risk Factors.\n Item 1A.\n Risk Factors.\n \n The statements in this section describe the most significant risks to our business and should be considered carefully in conjunction with Part II, Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and the \"Notes to Consolidated Financial Statements\" of Part II, Item 8 \"Financial Statements and Supplementary Data\" to this Form 10-K.  In addition, the statements in this section and other sections of this Form 10-K, including in Part II, Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations,\" include \"forward-looking statements\" as that term is defined in the Private Securities Litigation Reform Act of 1995 and involve uncertainties that could significantly impact results.  Forward-looking statements give current expectations or forecasts of future events about the company or our outlook.  You can identify forward-looking statements by the fact they do not relate to historical or current facts and by the use of words such as \"believe,\" \"expect,\" \"estimate,\" \"anticipate,\" \"will be,\" \"should,\" \"plan,\" \"forecast,\" \"target,\" \"guide,\" \"project,\" \"intend,\" \"could\" and similar words or expressions.\n Forward-looking statements are based on assumptions and on known risks and uncertainties. Although we believe we have been prudent in our assumptions, any or all of our forward-looking statements may prove to be inaccurate, and we can make no guarantees about our future performance.  Should known or unknown risks or uncertainties materialize or underlying assumptions prove inaccurate, actual results could materially differ from past results and/or those anticipated, estimated or projected.\n We undertake no obligation to publicly update forward-looking statements, whether as a result of new information, future events or otherwise. You should, however, consult any subsequent disclosures we make in our filings with the SEC on Form  10-Q or Form 8-K.\n 9\n Table of Contents\n The following is a cautionary discussion of risks, uncertainties and assumptions that we believe are material to our business. In addition to the factors discussed elsewhere in this report, the following are some of the important factors that, individually or in the aggregate, we believe could make our actual results differ materially from those described in any forward-looking statements. It is impossible to predict or identify all such factors and, as a result, you should not consider the following factors to be a complete discussion of risks, uncertainties and assumptions.\n MACROECONOMIC RISKS\n Our business and the industries we serve are highly sensitive to global and regional economic conditions.\n Our results of operations are materially affected by economic conditions globally and regionally and in the particular industries we serve.  The demand for our products and services tends to be cyclical and can be significantly reduced in periods of economic weakness characterized by lower levels of government and business investment, lower levels of business confidence, lower corporate earnings, high real interest rates, lower credit activity or tighter credit conditions, perceived or actual industry overcapacity, higher unemployment and lower consumer spending. A prolonged period of economic weakness may also result in increased expenses due to higher allowances for doubtful accounts and potential goodwill and asset impairment charges.  Economic conditions vary across regions and countries, and demand for our products and services generally increases in those regions and countries experiencing economic growth and investment.  Slower economic growth or a change in the global mix of regions and countries experiencing economic growth and investment could have an adverse effect on our business, results of operations and financial condition.\n The energy, transportation, and mining industries are significant adopters of Caterpillar products. In these industries customers are likely to base their purchase decisions upon expected future commodity dynamics, including price. Commodity price volatility may be abrupt and unpredictable in response to global economic conditions, government actions, regulatory changes, supply/demand dynamics, innovation, and commodity substitutions among others. Economic conditions affecting the industries we serve may reduce capital expenditures in response to a variety of the aforementioned conditions. Reduction in these capital expenditures may lead to decreased demand for Caterpillar products and services as well as aftermarket parts as customers may choose to extend preventative maintenance and delay overhauls when possible.\n The rates of infrastructure spending, commercial construction and housing starts also play a significant role in our results.  Our products are an integral component of these activities, and as these activities decrease, demand for our products and services may be significantly impacted, which could negatively impact our results.\n Catastrophic events, including global pandemics, could materially adversely affect our business, results of operations and/or financial condition.\n The occurrence of a major earthquake, fire, flood, tsunami or other weather event, power loss, telecommunications failure, software or hardware malfunctions, pandemics, cyber-attack, war, terrorist attack or other catastrophic event that our disaster recovery plans do not adequately address, could adversely affect our employees, our systems, our ability to produce and distribute our products, and our reputation. For example, a pandemic had a significant impact around the world, prompting governments and businesses to take unprecedented measures in response. Such measuresincluded travel bans and restrictions, quarantines, shelter in place orders and shutdowns. Those measures impacted or could again impact all or portions of our workforce and operations and the operations of our customers, dealers and suppliers. Current material and component shortages, logistics constraints and labor inefficiencies limited and or could continue to limit our ability to meet customer demand, which could have a material adverse effect on our business, results of operations and/or financial condition.\n The occurrence of a major earthquake, fire, flood, tsunami or other weather event, power loss, telecommunications failure, software or hardware malfunctions, pandemics, cyber-attack, war, terrorist attack or other catastrophic event that our disaster recovery plans do not adequately address, could adversely affect our employees, our systems, our ability to produce and distribute our products, and our reputation. For example, a pandemic had a significant impact around the world, prompting governments and businesses to take unprecedented measures in response. Such measures\n included travel bans and restrictions, quarantines, shelter in place orders and shutdowns. Those measures impacted or could again impact all or portions of our workforce and operations and the operations of our customers, dealers and suppliers. Current material and component shortages, logistics constraints and labor inefficiencies limited and or could continue to limit our ability to meet customer demand, which could have a material adverse effect on our business, results of operations and/or financial condition.\n Pandemics can significantly increase economic and customer demand uncertainty, cause inflationary pressure in the U.S. and elsewhere and lead to volatility in customer demand for the Company's products and services and cause supply chain disruptions. Economic uncertainties could continue to affect customer demand for the Company's products and services, the value of the equipment financed or leased, the demand for financing and the financial condition and credit risk of our dealers and customers.\n A catastrophic event resulting in the destruction or disruption of our workforce, our systems, our",
    "item7": "Item 7.Management's Discussion and Analysis of Financial Condition and Results of Operations.\n Item 7.\n Management's Discussion and Analysis of Financial Condition and Results of Operations.\n \n The following Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A) is intended to provide information that will assist the reader in understanding the company's Consolidated Financial Statements, the changes in certain key items in those financial statements between select periods and the primary factors that accounted for those changes. In addition, we discuss how certain accounting principles, policies and critical estimates affect our Consolidated Financial Statements. Our discussion also contains certain forward-looking statements related to future events and expectations. This MD&A should be read in conjunction with our discussion of cautionary statements and significant risks to the company's business under Item 1A. Risk Factors of the 2023 Form 10-K.\n Highlights for the full-year 2023 include:\n \"Sales and revenues for 2023 were $67.060 billion, an increase of $7.633 billion, or 13 percent, compared with $59.427 billion for 2022. Sales were higher across the three primary segments.\n \"\n Sales and revenues for 2023 were $67.060 billion, an increase of $7.633 billion, or 13 percent, compared with $59.427 billion for 2022. Sales were higher across the three primary segments.\n \"Operating profit as a percent of sales and revenues was 19.3 percent in 2023, compared with 13.3 percent in 2022.Adjusted operating profit marginwas 20.5 percent in 2023, compared with 15.4 percent in 2022.\n Operating profit as a percent of sales and revenues was 19.3 percent in 2023, compared with 13.3 percent in 2022.\n Adjusted operating profit margin\n was 20.5 percent in 2023, compared with 15.4 percent in 2022.\n \"Profit per share for 2023 was $20.12, and excluding the items in the table below,adjusted profit per sharewas $21.21. Profit per share for 2022 was $12.64, and excluding the items in the table below, adjusted profit per share was $13.84.\n Profit per share for 2023 was $20.12, and excluding the items in the table below,\n adjusted profit per share\n was $21.21. Profit per share for 2022 was $12.64, and excluding the items in the table below, adjusted profit per share was $13.84.\n \"In order for our results to be more meaningful to our readers, we have separately quantified the impact of several significant items. A detailed reconciliation of GAAP to non-GAAP financial measures is included on page 47.\n In order for our results to be more meaningful to our readers, we have separately quantified the impact of several significant items. A detailed reconciliation of GAAP to non-GAAP financial measures is included on page 47.\n Full Year 2023Full Year 2022(Dollars in millions except per share data)Profit Before TaxesProfitPer ShareProfit Before TaxesProfitPer ShareProfit$13,050$20.12$8,752$12.64Restructuring costs- Longwall divestiture5861.14Otherrestructuring costs1940.302990.43Mark-to-market (gains) losses(97)(0.14)(606)(0.91)Deferred tax valuation allowance adjustments(0.21)Goodwill impairment9251.68Adjusted profit$13,733$21.21$9,370$13.84\n Full Year 2023Full Year 2022\n Full Year 2023\n Full Year 2022\n (Dollars in millions except per share data)Profit Before TaxesProfitPer ShareProfit Before TaxesProfitPer Share\n (Dollars in millions except per share data)\n Profit Before Taxes\n ProfitPer Share\n Profit$13,050$20.12$8,752$12.64\n Profit\n $\n 13,050\n 20.12\n 8,752\n 12.64\n Restructuring costs- Longwall divestiture5861.14\n Restructuring costs- Longwall divestiture\n Restructuring costs\n - Longwall divestiture\n 586\n 1.14\n Otherrestructuring costs1940.302990.43\n Otherrestructuring costs\n Other\n restructuring costs\n 194\n 0.30\n 299\n 0.43\n Mark-to-market (gains) losses(97)(0.14)(606)(0.91)\n Mark-to-market (gains) losses\n (97)\n (0.14)\n (606)\n (0.91)\n Deferred tax valuation allowance adjustments(0.21)\n Deferred tax valuation allowance adjustments\n (0.21)\n Goodwill impairment9251.68\n Goodwill impairment\n 925\n 1.68\n Adjusted profit$13,733$21.21$9,370$13.84\n Adjusted profit\n 13,733\n 21.21\n 9,370\n 13.84\n \"Enterprise operating cash flow was $12.9 billion in 2023. Caterpillar ended 2023 with $7.0 billion of enterprise cash.\n Enterprise operating cash flow was $12.9 billion in 2023. Caterpillar ended 2023 with $7.0 billion of enterprise cash.\n OVERVIEW\n Total sales and revenues for 2023 were $67.060 billion, an increase of $7.633 billion, or 13 percent, compared with $59.427 billion for 2022. The increase was primarily due to favorableprice realizationand highersales volume.Profit per share was $20.12 in 2023, compared with profit per share of $12.64 in 2022. Profit was $10.335 billion in 2023, compared with $6.705 billion in 2022. The increase was primarily due to favorable price realization, higher sales volume and the absence of a 2022 goodwill impairment charge related to the Rail division, partially offset by higher selling, general and administrative (SG&A) and research and development (R&D) expenses, unfavorablemanufacturing costs, the impact of the divestiture of the company's Longwall business and lower mark-to-market gains for remeasurement ofpension and other postemployment benefit (OPEB)plans.\n Total sales and revenues for 2023 were $67.060 billion, an increase of $7.633 billion, or 13 percent, compared with $59.427 billion for 2022. The increase was primarily due to favorable\n price realization\n and higher\n sales volume.\n Profit per share was $20.12 in 2023, compared with profit per share of $12.64 in 2022. Profit was $10.335 billion in 2023, compared with $6.705 billion in 2022. The increase was primarily due to favorable price realization, higher sales volume and the absence of a 2022 goodwill impairment charge related to the Rail division, partially offset by higher selling, general and administrative (SG&A) and research and development (R&D) expenses, unfavorable\n manufacturing costs\n , the impact of the divestiture of the company's Longwall business and lower mark-to-market gains for remeasurement of\n pension and other postemployment benefit (OPEB)\n plans.\n Trends and Economic Conditions\n Outlook for Key End Markets\n Overall demand remains healthy across most of our end markets for our products and services.\n InConstruction Industries, we expect North America to remain healthy in 2024. We expect non-residential construction in North America to remain at similar demand levels as 2023 due to government-related infrastructure investments. Residential construction is expected to remain healthy relative to historical levels. In Asia Pacific, excluding China, we expect some softening in economic conditions. We anticipate China will remain at a relatively low level in the excavator industry above 10-tons. InEAME, we anticipate the region will be slightly down due to economic uncertainty in Europe, partially offset by continuing strong construction demand in the Middle East. Construction activity inLatin Americais expected to increase due to easing financial conditions. In addition, we anticipate the ongoing benefit of ourservicesinitiatives will positively impact Construction Industries in 2024.\n In\n Construction Industries\n , we expect North America to remain healthy in 2024. We expect non-residential construction in North America to remain at similar demand levels as 2023 due to government-related infrastructure investments. Residential construction is expected to remain healthy relative to historical levels. In Asia Pacific, excluding China, we expect some softening in economic conditions. We anticipate China will remain at a relatively low level in the excavator industry above 10-tons. In\n EAME\n , we anticipate the region will be slightly down due to economic uncertainty in Europe, partially offset by continuing strong construction demand in the Middle East. Construction activity in\n Latin America\n is expected to increase due to easing financial co",
    "item7a": "Item 7A.Quantitative and Qualitative Disclosures About Market Risk.\n Item 7A.\n Quantitative and Qualitative Disclosures About Market Risk.\n \n Information required by Item 7A appears in Note 1   \"Operations and summary of significant accounting policies,\" Note 4     \"Derivative financial instruments and risk management,\" Note 18   \"Fair value disclosures\" and Note 19   \"Concentration of credit risk\" of Part II, Item 8 \"Financial Statements and Supplementary Data.\"  Other information required by Item 7A is included in Part II, Item 7 \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\n 52\n Table of Contents\n"
}