{
    "cik": 93410,
    "cusip6": "166764",
    "cusip": [
        "166764100"
    ],
    "names": [
        "CHEVRON CORP",
        "CHEVRON CORP NEW COM",
        "CHEVRON CORP NEW",
        "Chevron Corp",
        "CHEVRON CORPORATION",
        "Chevron Corp.",
        "CHEVRON CORP NEW",
        "Chevron Corporation",
        "CHEVRON",
        "Chevron",
        "Chevron Corp - US",
        "CHEVRON TEXACO CORP COM",
        "CHEVRON CORPORATION",
        "CHEVRON CORPORATION COM",
        "Chevron Corp New",
        "CHEVRON CORP",
        "CHEVRON   CORP   NEW",
        "CHEVRONTEXACO CORP",
        "Chevron Corp",
        "CHEVRON CORP NEW",
        "Chevron Corp New",
        "CHEVRON CORP NEW",
        "CHEVRON CORPORATION CMN",
        "ChevronTexaco Corp",
        "CHEMED CORP",
        "Chevron Corp New Com",
        "CHEVRON ORD",
        "CHEVRON TEXACO",
        "Chevron Corp",
        "CHEVRON CORPORATION NEW",
        "Chevron Texaco Corporation",
        "CHEVRONTEXACO",
        "CHEVRON CORP",
        "CHEVRON CORP.",
        "CHEVRON CORP",
        "CHEVRON CORPORATION",
        "CHEVRON ORD (NYS)",
        "CHEVRON CORPORATION",
        "CHEVRON CORP USD0.75 Common Stock",
        "Chevron Corporation New",
        "CHEVRON CORP",
        "Chevron Corporation",
        "Chevron Corp",
        "CHEVRON CORP",
        "CHEVRON CO",
        "CHEVRON CORP COM",
        "Chevrontexaco Corp",
        "ChevronTexaco",
        "Chevron Corp Com",
        "CHEVRON CORP/U",
        "Chevron Corp New Com",
        "CHEVRON CORP NEW",
        "CHEVRON CORP NEW",
        "Chevron Corporation Com US$0.75",
        "Chevron Corporation",
        "CHEVRON CORP NEW",
        "CHEVRON CORP NEW",
        "CVX",
        "Chevron Corp",
        "ChevrontexacoCorp",
        "Chevron Corp.",
        "CHEVRON CORP NEW COM",
        "CHEVRON CORP",
        "ChevronTexaco Corporation",
        "Chevron Corporation (cvx)",
        "Chevrontexaco Corp Com",
        "CHEVRON CORP                COM",
        "CHEVRON CORP NEW",
        "CHEVRON CORPORATION         COM",
        "Chevron Texaco Corp",
        "Chevron Corp com",
        "Chevron Corp. (CVX)",
        "CHEVRON CORPORATION",
        "CHEVRONTEXACO CORP COM",
        "CHEVRON CORPORATION          COM",
        "Chevron Corp.",
        "Chevron Common",
        "CHEVRON CORP NEW             COM",
        "CHEVRON CORP NEW                    C",
        "ChevronCorp",
        "CHEVRONTEXACO CORP          COM",
        "CHEVRON COM",
        "CHEVRON CORP (NEW)",
        "CHEVRON CORP COM USD0.75",
        "CHEVRON CORP NEW            COM",
        "CHEVNORP",
        "Chevron Corp (CVX)",
        "CHEVRON-TEXACO CORP",
        "CHEVRON CORPORATION COMMON"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/93410/000009341024000013/cvx-20231231.htm",
    "item1": "Item 1. Business\n \n General Development of Business\n Summary Description of Chevron\n Chevron Corporation,*a Delaware corporation, manages its investments in subsidiaries and affiliates and provides administrative, financial, management and technology support to U.S. and international subsidiaries that engage in integrated energy and chemicals operations. Upstream operations consist primarily of exploring for, developing, producing and transporting crude oil and natural gas; processing, liquefaction, transportation and regasification associated with liquefied natural gas; transporting crude oil by major international oil export pipelines; transporting, storage and marketing of natural gas; carbon capture and storage, and a gas-to-liquids plant. Downstream operations consist primarily of refining crude oil into petroleum products; marketing of crude oil, refined products, and lubricants; manufacturing and marketing of renewable fuels; transporting crude oil and refined products by pipeline, marine vessel, motor equipment and rail car; and manufacturing and marketing of commodity petrochemicals, plastics for industrial uses and fuel and lubricant additives.\n Chevron Corporation,\n *\n a Delaware corporation, manages its investments in subsidiaries and affiliates and provides administrative, financial, management and technology support to U.S. and international subsidiaries that engage in integrated energy and chemicals operations. Upstream operations consist primarily of exploring for, developing, producing and transporting crude oil and natural gas; processing, liquefaction, transportation and regasification associated with liquefied natural gas; transporting crude oil by major international oil export pipelines; transporting, storage and marketing of natural gas; carbon capture and storage, and a gas-to-liquids plant. Downstream operations consist primarily of refining crude oil into petroleum products; marketing of crude oil, refined products, and lubricants; manufacturing and marketing of renewable fuels; transporting crude oil and refined products by pipeline, marine vessel, motor equipment and rail car; and manufacturing and marketing of commodity petrochemicals, plastics for industrial uses and fuel and lubricant additives.\n A list of the company's significant subsidiaries is presented inExhibit 21.1.\n A list of the company's significant subsidiaries is presented in\n Exhibit 21.1\n .\n Overview of Petroleum Industry\n Petroleum industry operations and profitability are influenced by many factors. Prices for crude oil, natural gas, liquefied natural gas, petroleum products and petrochemicals are generally determined by supply and demand. Production levels from the members of Organization of Petroleum Exporting Countries (OPEC), Russia and the United States are the major factors in determining worldwide supply. Demand for crude oil and its products and for natural gas is largely driven by the conditions of local, national and global economies, although weather patterns, the pace of energy transition and taxation relative to other energy sources also play a significant part. Laws and governmental policies, particularly in the areas of taxation, energy and the environment, affect where and how companies invest, conduct their operations, select feedstocks, and formulate their products and, in some cases, limit their profits directly.\n Strong competition exists in all sectors of the petroleum and petrochemical industries in supplying the energy, fuel and chemical needs of industry and individual consumers. In the upstream business, Chevron competes with fully integrated, major global petroleum companies, as well as independent and national petroleum companies, for the acquisition of crude oil and natural gas leases and other properties and for the equipment and labor required to develop and operate those properties. In its downstream business, Chevron competes with fully integrated, major petroleum companies, as well as independent refining and marketing, transportation and chemicals entities and national petroleum companies in the refining, manufacturing, sale and marketing of fuels, lubricants, additives and petrochemicals.\n Operating Environment\n Refer toBusiness Environment and Outlookof this Form 10-K in Management's Discussion and Analysis of Financial Condition and Results of Operations for a discussion of the company's current business environment and outlook.\n Refer to\n Business Environment and Outlook\n of this Form 10-K in Management's Discussion and Analysis of Financial Condition and Results of Operations for a discussion of the company's current business environment and outlook.\n Chevron's Strategic Direction\n Chevron's strategy is to leverage our strengths to safely deliver lower carbon energy to a growing world. Our objective is to safely deliver higher returns, lower carbon and superior shareholder value in any business environment. We are building on our capabilities, assets and customer relationships as we aim to lead in lower carbon intensity oil, products and natural gas, as well as advance new products and solutions that reduce the carbon emissions of major industries. We aim to grow our oil and gas business, lower the carbon intensity of our operations and grow lower carbon businesses in renewable fuels, carbon capture and offsets, hydrogen and other emerging technologies.\n Information about the company is available on the company's website atwww.chevron.com. Information contained on the company's website is not part of this Annual Report on Form 10-K. The company's Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge on the company's website soon after such reports are filed with or furnished to the U.S. Securities and Exchange Commission (SEC). The reports are also available on the SEC's website atwww.sec.gov.\n Information about the company is available on the company's website at\n www.chevron.com\n . Information contained on the company's website is not part of this Annual Report on Form 10-K. The company's Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge on the company's website soon after such reports are filed with or furnished to the U.S. Securities and Exchange Commission (SEC). The reports are also available on the SEC's website at\n www.sec.gov\n ________________________________________________________*Incorporated in Delaware in 1926 as Standard Oil Company of California, the company adopted the name Chevron Corporation in 1984 and ChevronTexaco Corporation in 2001. In 2005, ChevronTexaco Corporation changed its name to Chevron Corporation. As used in this report, the term \"Chevron\" and such terms as \"the company,\" \"the corporation,\" \"our,\" \"we,\" \"us\" and \"its\" may refer to Chevron Corporation, one or more of its consolidated subsidiaries, or all of them taken as a whole, but unless stated otherwise they do not include \"affiliates\" of Chevron   i.e., those companies accounted for by the equity method (generally owned 50 percent or less) or non-equity method investments. All of these terms are used for convenience only and are not intended as a precise description of any of the separate companies, each of which manages its own affairs.3\n ________________________________________________________\n *Incorporated in Delaware in 1926 as Standard Oil Company of California, the company adopted the name Chevron Corporation in 1984 and ChevronTexaco Corporation in 2001. In 2005, ChevronTexaco Corporation changed its name to Chevron Corporation. As used in this report, the term \"Chevron\" and such terms as \"the company,\" \"the corporation,\" \"our,\" \"we,\"",
    "item1a": "The company aims to lower the carbon intensity of its oil and gas operations and comply with the greenhouse gas-related laws and regulations to which it is subject. Refer toItem 1A. Risk Factorsfor further discussion of greenhouse gas regulation and climate change and the associated risks to Chevron's business. Refer to Management's Discussion and Analysis of Financial Conditions and Results of OperationsBusiness Environment and Outlookon pages 34 through 36 for further discussion of climate change related trends and uncertainties.\n The company aims to lower the carbon intensity of its oil and gas operations and comply with the greenhouse gas-related laws and regulations to which it is subject. Refer to\n Item 1A. Risk Factors\n for further discussion of greenhouse gas regulation and climate change and the associated risks to Chevron's business. Refer to Management's Discussion and Analysis of Financial Conditions and Results of Operations\n Business Environment and Outlook\n on pages 34 through 36 for further discussion of climate change related trends and uncertainties.\n Refer toManagement's Discussion and Analysis of Financial Conditions and Results of Operationson pages 52 through 54 for additional information on environmental matters and their impact on Chevron, and on the company's 2023 environmental expenditures. Refer to page 52 through 54 andNote 24 Other Contingencies and Commitmentsfor a discussion of environmental remediation provisions and year-end reserves.\n Refer to\n Management's Discussion and Analysis of Financial Conditions and Results of Operations\n on pages 52 through 54 for additional information on environmental matters and their impact on Chevron, and on the company's 2023 environmental expenditures. Refer to page 52 through 54 and\n Note 24 Other Contingencies and Commitments\n for a discussion of environmental remediation provisions and year-end reserves.\n \n As a global energy company, Chevron is subject to a variety of risks that could materially impact the company's results of operations and financial condition.\n BUSINESS AND OPERATIONAL RISK FACTORS\n Chevron is exposed to the effects of changing commodity pricesChevron is primarily in a commodities business that has a history of price volatility. The most significant factor that affects the company's results of operations is the price of crude oil, which can be influenced by general economic conditions and level of economic growth, including low or negative growth; industry production and inventory levels; technology advancements, including those in pursuit of a lower carbon economy; production quotas or other actions that might be imposed by the Organization of Petroleum Exporting Countries or other producers; weather-related damage and disruptions due to other natural or human causes beyond our control; competing fuel prices; geopolitical risks; the pace of energy transition; customer and consumer preferences and the use of\n Chevron is exposed to the effects of changing commodity prices\n Chevron is primarily in a commodities business that has a history of price volatility. The most significant factor that affects the company's results of operations is the price of crude oil, which can be influenced by general economic conditions and level of economic growth, including low or negative growth; industry production and inventory levels; technology advancements, including those in pursuit of a lower carbon economy; production quotas or other actions that might be imposed by the Organization of Petroleum Exporting Countries or other producers; weather-related damage and disruptions due to other natural or human causes beyond our control; competing fuel prices; geopolitical risks; the pace of energy transition; customer and consumer preferences and the use of\n 20\n Table of Contents\n substitutes; and governmental regulations, policies and other actions regarding the development of oil and gas reserves, as well as greenhouse gas emissions and climate change. Chevron evaluates the risk of changing commodity prices as a core part of its business planning process. An investment in the company carries significant exposure to fluctuations in global crude oil prices.\n Extended periods of low prices for crude oil can have a material adverse impact on the company's results of operations, financial condition and liquidity. Among other things, the company's upstream earnings, cash flows, and capital expenditure programs could be negatively affected, as could its production and proved reserves. Upstream assets may also become impaired. Downstream earnings could be negatively affected because they depend upon the supply and demand for refined products and the associated margins on refined product sales. A significant or sustained decline in liquidity could adversely affect the company's credit ratings, potentially increase financing costs and reduce access to capital markets. The company may be unable to realize anticipated cost savings, expenditure reductions and asset sales that are intended to compensate for such downturns, and such downturns may also slow the pace and scale at which we are able to invest in our business, including our Chevron New Energies organization. In some cases, transferred liabilities, including for abandonment and decommissioning of divested oil and gas assets, have returned and may continue to return to the company when an acquirer of those assets subsequently declares bankruptcy. In addition, extended periods of low commodity prices can have a material adverse impact on the results of operations, financial condition and liquidity of the company's suppliers, vendors, partners and equity affiliates upon which the company's own results of operations and financial condition depend.\n The scope of Chevron's business will decline if the company does not successfully develop resourcesThe company is in an extractive business; therefore, if it is not successful in replacing the crude oil and natural gas it produces with good prospects for future organic opportunities or through acquisitions, exploration or technology, the company's business will decline. Creating and maintaining an inventory of economic projects depends on many factors, including obtaining and renewing rights to explore, develop and produce hydrocarbons; drilling success; reservoir optimization; technology advancements; ability to bring long-lead-time, capital-intensive projects to completion on budget and on schedule; partner alignment, including strategic support; and efficient and profitable operation of mature properties.\n The scope of Chevron's business will decline if the company does not successfully develop resources\n The company is in an extractive business; therefore, if it is not successful in replacing the crude oil and natural gas it produces with good prospects for future organic opportunities or through acquisitions, exploration or technology, the company's business will decline. Creating and maintaining an inventory of economic projects depends on many factors, including obtaining and renewing rights to explore, develop and produce hydrocarbons; drilling success; reservoir optimization; technology advancements; ability to bring long-lead-time, capital-intensive projects to completion on budget and on schedule; partner alignment, including strategic support; and efficient and profitable operation of mature properties.\n The company's operations could be disrupted by natural or human causes beyond its controlChevron operates in both urban areas and remote and sometimes inhospitable regions. The company's operations are therefore subject to disruption from natural or human causes beyond its control, including risks from hurricanes, severe storms, floods, heat waves, other forms of severe weather, wildfires, ambient temperature increases, sea level rise, war or other military conflicts such as the war between Israel and Hamas and the military conflict between Russia and Ukraine, accidents, civil un",
    "item7": "Item 1B. Unresolved Staff Comments\n None.\n \n Item 1C. Cybersecurity\n Chevron's business and proprietary information, information technology (IT) and operational technology (OT) networks are essential to its success. The company's cybersecurity program is designed to protect its information assets and operations from external and internal cyber threats by identifying and appropriately managing and mitigating risks while ensuring business resiliency. This program is integrated within the company's Enterprise Risk Management (ERM) process, which is the company's systematic approach to identifying, managing and assessing major risks and safeguards,\n 26\n Table of Contents\n including cybersecurity risks. Chevron uses a risk-based information security process aligned with the National Institute of Standards and Technology (NIST) Cybersecurity Framework to identify, prioritize and mitigate cyber risks.\n The company's worldwide team of cybersecurity professionals undertakes a range of preemptive activities to protect its people, assets and reputation globally. The company also leverages internal and external resources to monitor cybersecurity threats to its systems and networks and to understand the broader threat environment. The company seeks to remove exploitable weaknesses in its systems or devices before they become a threat. Chevron security experts use automated threat intelligence feeds to increase vulnerability awareness, taking action to mitigate the highest risks. The company's cybersecurity guardrails, which are high-level design requirements expected to be built into any new digital solutions being deployed, are also updated on an ongoing basis to align with changes in industry standards and the evolving threat environment.\n Chevron's cyber risk management process includes testing and risk assessments of technologies, third-party suppliers, and its IT and OT networks. These assessments ensure that our focus is on the highest priorities to maintain the security of our company's assets. To further protect the company's systems and data, Chevron's cybersecurity organization has threat intelligence capabilities to monitor security breaches impacting third-party suppliers. As third-party risks increase, the company's approach to third-party supplier risk management and qualification continues to evolve, including the ongoing expansion of its current supplier risk management program beyond IT vendors to other high-risk, third-party vendors.\n Chevron's Chief Information Security Officer (CISO) leads a global cybersecurity team that operationalizes and manages the company's cybersecurity program and strategy.  Chevron's CISO has more than 20 years of cybersecurity experience and is responsible for providing a single and consolidated view of the company's enterprise cybersecurity risk. Before joining Chevron, he held a leadership role in cyber threat analysis with the U.S. Department of State's Bureau of Diplomatic Security. Chevron's CISO reports to the Chief Information Officer (CIO) who is responsible for Chevron's broader IT program, including resiliency and ability to remediate and recover from a cybersecurity incident to minimize impacts to the business and operations. He has more than 30 years of experience in IT and the oil and gas industry.\n Chevron operates four Cyber Intelligence Centers around the world, some co-located with critical assets, with cyber professionals who monitor and respond to cyber threats 24 hours a day, 365 days a year, to limit the scope and impact of cyber incidents in its networks. Chevron's CISO regularly receives cybersecurity operations reports detailing prevention, detection, mitigation and remediation efforts associated with cyber incidents, both on Chevron's networks and third-party supplier networks. The CISO has authority to mobilize a cross-functional cyber incident response team, including outside cybersecurity experts, to drive mitigation and remediation actions. Status updates on incidents are provided to senior management and to the Board, as appropriate.\n The company's dedicated cyber risk organization meets regularly with business units to raise cyber risk awareness and keep diverse cybersecurity skill sets connected across the enterprise. Chevron has invested in broad cybersecurity awareness and required training to educate those with access to Chevron's networks on company policy and best practices. The company conducts regular phishing tests to train and assess its workforce's ability to identify malicious emails.\n Chevron's Corporate Audit Department has a dedicated team responsible for IT and information security (including cybersecurity) audits. Chevron also leverages external resources to reinforce its cybersecurity capabilities. On a regular basis, external consultants provide a maturity assessment of the company's cybersecurity program.\n The company's approach to managing risks, including cybersecurity risks, is embedded within the enterprise Operational Excellence (OE) Management System (OEMS). The OEMS provides a systematic process that enables the company to manage risk and implement safeguards and foster a culture of learning across different focus areas for Chevron's business, including cybersecurity. The company's Business Continuity Planning OE Process, a component of the OEMS, is designed to prepare Chevron to continue operations during an unplanned event or disruption, which aligns with its OE objective to prevent high-consequence security and cybersecurity incidents. Chevron works to identify critical business processes and dependent IT applications and document the processes for continuing operations without IT systems. Cross-functional teams also conduct regular multidisciplinary exercises, including an expansive cybersecurity exercise in 2023, to test and improve response plans.\n The Board provides oversight of Chevron's cybersecurity program, receives reports from management on cybersecurity risks in connection with Chevron's operations and projects, and also reviews cybersecurity risks as part of the company's broader annual ERM process. In support of the Board's oversight of the company's policies and processes with respect to risk management and the company's major financial risk exposures, including cybersecurity, the Audit Committee meets with Chevron's CISO and CIO at least twice a year to review cybersecurity risks and implications, including the results of\n 27\n independent third-party assessments. The CISO and CIO present cybersecurity matters to the Board of Directors at least annually.The CISO and CIO also provide new Board members with a cybersecurity briefing as part of the onboarding process. In 2023, the Audit Committee hosted an external expert to discuss cybersecurity and digital risk management topics.\n independent third-party assessments. The CISO and CIO present cybersecurity matters to the Board of Directors at least annually.\n The CISO and CIO also provide new Board members with a cybersecurity briefing as part of the onboarding process. In 2023, the Audit Committee hosted an external expert to discuss cybersecurity and digital risk management topics.\n To date, the company has not experienced a cybersecurity threat or incident that has materially affected or is reasonably likely to materially affect the company, including its business strategy, results of operations or financial condition; however, the company has experienced and will continue to experience cyber incidents of varying degrees. Despite the cybersecurity measures that the company is taking to mitigate such risks, there can be no guarantee that such measures will be sufficient to protect the company's systems, information, intellectual property and other assets from significant harm and that future cybersecurity incidents will not have a material adverse effect on the company or its results of operations or financial condition or cause reputational or other harm to the company.  Refer toItem 1A. Ris",
    "item7a": "Item 7A. Quantitative and Qualitative Disclosures About Market Risk\n The company's discussion of interest rate, foreign currency and commodity price market risk is contained in Management's Discussion and Analysis of Financial Condition and Results of OperationsFinancial and Derivative Instrumentsand inNote 10 Financial and Derivative Instruments.\n The company's discussion of interest rate, foreign currency and commodity price market risk is contained in Management's Discussion and Analysis of Financial Condition and Results of Operations\n Financial and Derivative Instruments\n and in\n Note 10 Financial and Derivative Instruments\n .\n \n"
}