{
    "cik": 21344,
    "cusip6": "191216",
    "cusip": [
        "191216100"
    ],
    "names": [
        "COCA COLA CO",
        "COCA COLA CO COM",
        "Coca-Cola Co/The",
        "Coca Cola Co",
        "COCA-COLA CO",
        "COCA-COLA CO/THE",
        "Coca Cola Company",
        "COCA COLA COMPANY",
        "THE COCA COLA COMPANY",
        "COCA-COLA CONSOLIDATED INC",
        "COCACOLA",
        "Coca-Cola Company",
        "Coca-Cola Co",
        "THE COCA-COLA CO",
        "Coca Cola",
        "THE COCA-COLA CO",
        "COCA-COLA",
        "The Coca-Cola Co",
        "COCA COLA CO",
        "COCA COLA CO",
        "COCA-COLA CO COM",
        "COCA COLA",
        "COCA COLA CO",
        "COCA   COLA   CO",
        "COCA COLA CO.",
        "Coca Cola",
        "COCA COLA COM",
        "Coca-Cola Co.",
        "COCA-COLA COMPANY",
        "COCA COLA CO",
        "COCA COLA CO/THE",
        "Coca Cola Co/The",
        "Coca Cola Co.",
        "COCA COLA COTHE",
        "COCA COLA CO",
        "COCA-COLA COMPANY (THE) CMN",
        "The Coca-Cola Co.",
        "CMS ENERGY CORP",
        "Coca Cola Companies",
        "KO US Equity",
        "Coca-Cola",
        "The Coca-Cola Company",
        "Coca Cola Co",
        "COCA-COLA ORD",
        "COCA-COLA CO (THE)",
        "Coca-Cola Co/The (ko)",
        "Coca Cola Co",
        "Coca-Cola Co The",
        "Coca-Cola Company",
        "Coca-cola Co/the",
        "COCA-COLA CO.",
        "THE COCA COLA CO",
        "COCA COLA CO",
        "COCA-COLA ORD (NYS)",
        "COCA-COLA CO USD0.25 Common Stock",
        "Coca-Cola Co Common",
        "Coca-Cola Co",
        "COCA COLA CO",
        "The Coca Cola Company",
        "COCA COLA CO",
        "COCA-COLA",
        "Coca-Cola Company",
        "THE COCA-COLA CO",
        "COCA-COLA COMPANY/THE",
        "COCA COLA CO",
        "Coca-cola Company",
        "COCA-COLA COMPANY",
        "Coca-Cola Com US$0.25",
        "Coca Cola",
        "COCA-COLA COMPANY (THE)",
        "COCA COLA CO",
        "COCA COLA CO",
        "COCA COLA CO                COM",
        "KO",
        "Coca Cola Company",
        "Coca-Cola",
        "COCA COLA COMPANY (THE)",
        "Coca Cola Co Com",
        "THE COCA-COLA CO",
        "COCA-COLA CO",
        "Coca-Cola Company - Common",
        "COCA COLA COMPANY",
        "COCA COLA CO THE",
        "Coca Cola CO",
        "COCA COLA CO",
        "COCA COLA COMPANY           COM",
        "COCA",
        "Coca-cola co/the",
        "Coca-Cola Co./The",
        "Coca Cola Co. (KO)",
        "Coca-Cola CO.",
        "COCA COLA CO                 COM",
        "COCA-COLA COMPANY",
        "COCACOLA CO THE",
        "COCA COLA CO                        C",
        "CocaColaCompany",
        "COCA-COLA CO",
        "COCA COLA COMMON STOCK",
        "COCA-COLA INC COM USD0.25",
        "COCACOLACO",
        "Coca Cola Company (KO)",
        "Coca Cola Corp Com",
        "COCA-COLA  COMMON",
        "COCA - COLA CO"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/21344/000002134424000009/ko-20231231.htm",
    "item1": "ITEM 1.  BUSINESS\n In this report, the terms \"The Coca-Cola Company,\" \"Company,\" \"we,\" \"us\" and \"our\" mean The Coca-Cola Company and all entities included in our consolidated financial statements.\n General\n The Coca-Cola Company is a total beverage company, and beverage products bearing our trademarks, sold in the United States since 1886, are now sold in more than 200 countries and territories. We own or license and market numerous beverage brands, which we group into the following categories: Trademark Coca-Cola; sparkling flavors; water, sports, coffee and tea; juice, value-added dairy and plant-based beverages; and emerging beverages. We own and market several of the world's largest nonalcoholic sparkling soft drink brands, including Coca-Cola, Sprite, Fanta, Coca-Cola Zero Sugar and Diet Coke/Coca-Cola Light.\n We make our branded beverage products available to consumers throughout the world through our network of independent bottling partners, distributors, wholesalers and retailers as well as our consolidated bottling and distribution operations. Beverages bearing trademarks owned by or licensed to the Company account for 2.2 billion of the estimated 64 billion servings of all beverages consumed worldwide every day.\n We believe our success depends on our ability to connect with consumers by providing them with a wide variety of beverage options to meet their desires, needs and lifestyles. Our success further depends on the ability of our people to execute effectively, every day.\n We are guided by our purpose, which is to refresh the world and make a difference. Our vision for growth has three connected pillars:\n \"Loved Brands. We craft meaningful brands and a choice of drinks that people love and enjoy and that refresh them in body and spirit.\n \"\n Loved Brands. We craft meaningful brands and a choice of drinks that people love and enjoy and that refresh them in body and spirit.\n \"Done Sustainably. We grow our business in ways that achieve positive change in the world and build a more sustainable future for our planet.\n Done Sustainably. We grow our business in ways that achieve positive change in the world and build a more sustainable future for our planet.\n \"For a Better Shared Future. We invest to improve people's lives, from our employees to all those who touch our business system, to our investors, to the communities we call home.\n For a Better Shared Future. We invest to improve people's lives, from our employees to all those who touch our business system, to our investors, to the communities we call home.\n The Coca-Cola Company was incorporated in September 1919 under the laws of the State of Delaware and succeeded to the business of a Georgia corporation with the same name that had been organized in 1892.\n 2\n \n Operating Segments\n The Company's operating structure is the basis for our internal financial reporting. Our operating structure includes the following operating segments:\n \"Europe, Middle East and Africa\n Europe, Middle East and Africa\n \"Latin America\n Latin America\n \"North America\n North America\n \"Asia Pacific\n Asia Pacific\n \"Global Ventures\n Global Ventures\n \"Bottling Investments\n Bottling Investments\n Additionally, our operating structure includes operating units, which sit under our four geographic operating segments. The operating units are focused on regional and local execution and are highly interconnected, with the goal of eliminating duplication of resources and scaling new products more quickly. The operating units work closely with five global marketing category leadership teams to rapidly scale ideas while staying close to the consumer. The global marketing category leadership teams primarily focus on innovation as well as marketing efficiency and effectiveness.\n Our operating structure also includes Corporate, which consists of two components: (1) a center focusing on strategic initiatives, policy, governance and scaling global initiatives, and (2) a platform services organization supporting the operating units, global marketing category leadership teams and the center by providing efficient and scaled global services and capabilities, including, but not limited to, transactional work, data management, consumer analytics, digital commerce and social/digital hubs.\n For additional information about our operating segments and Corporate, refer to Note 20 of Notes to Consolidated Financial Statements set forth in Part II, \"Item 8. Financial Statements and Supplementary Data\" of this report.\n Except to the extent that differences among operating segments are material to an understanding of our business taken as a whole, the description of our business in this report is presented on a consolidated basis.\n Products and Brands\n As used in this report:\n \"\"concentrates\" means flavorings and other ingredients which, when combined with water and, depending on the product, sweeteners (nutritive or non-nutritive) are used to prepare syrups or finished beverages, and includes powders/minerals for purified water products;\n \"concentrates\" means flavorings and other ingredients which, when combined with water and, depending on the product, sweeteners (nutritive or non-nutritive) are used to prepare syrups or finished beverages, and includes powders/minerals for purified water products;\n \"\"syrups\" means intermediate products in the beverage manufacturing process produced by combining concentrates with water and, depending on the product, sweeteners (nutritive or non-nutritive);\n \"syrups\" means intermediate products in the beverage manufacturing process produced by combining concentrates with water and, depending on the product, sweeteners (nutritive or non-nutritive);\n \"\"fountain syrups\" means syrups that are sold to fountain retailers, such as restaurants and convenience stores, which use dispensing equipment to mix the syrups with sparkling or still water at the time of purchase to produce finished beverages that are served in cups or glasses for immediate consumption;\n \"fountain syrups\" means syrups that are sold to fountain retailers, such as restaurants and convenience stores, which use dispensing equipment to mix the syrups with sparkling or still water at the time of purchase to produce finished beverages that are served in cups or glasses for immediate consumption;\n \"\"Company Trademark Beverages\" means beverages bearing our trademarks and certain other beverages bearing trademarks licensed to us by third parties for which we provide marketing support and from the sale of which we derive an economic benefit; and\n \"Company Trademark Beverages\" means beverages bearing our trademarks and certain other beverages bearing trademarks licensed to us by third parties for which we provide marketing support and from the sale of which we derive an economic benefit; and\n \"\"Trademark Coca-Cola Beverages\" or \"Trademark Coca-Cola\" means nonalcoholic beverages bearing the trademark Coca-Cola or any trademark that includes Coca-Cola or Coke (that is, Coca-Cola, Diet Coke/Coca-Cola Light and   Coca-Cola Zero Sugar and all their variations and any line extensions, including caffeine free Diet Coke, Cherry Coke, etc.). Likewise, when we use the capitalized word \"Trademark\" together with the name of one of our other beverage products (such as \"Trademark Fanta,\" \"Trademark Sprite\" or \"Trademark Simply\"), we mean nonalcoholic beverages bearing the indicated trademark (that is, Fanta, Sprite or Simply, respectively) and all its variations and line extensions (such that \"Trademark Fanta\" includes Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, etc.; \"Trademark Sprite\" includes Sprite, Sprite Zero Sugar, etc.; and \"Trademark Simply\" includes Simply Orange, Simply Apple, Simply Grapefruit, etc.).\n \"Trademark Coca-Cola Beverages\" or \"Trademark Coca-Cola\" means nonalcoholic beverages bearing the trademark Coca-Cola or any trademark that includes Coca-Cola or Coke (that is, Coca-Cola, Diet Coke/Coca-Cola Light and   Coca-Cola Zero Sugar and ",
    "item1a": "ITEM 1A.  RISK FACTORS\n In addition to the other information set forth in this report, you should carefully consider the following factors, which could materially affect our business, financial condition and results of operations in future periods. The risks described below are not the only risks facing our Company. Additional risks not currently known to us or that we currently deem to be immaterial also may materially adversely affect our business, financial condition or results of operations in future periods.\n RISKS RELATED TO OUR OPERATIONS\n Unfavorable general economic and geopolitical conditions could negatively impact our financial results.\n Our business, operating results, financial condition and liquidity may be adversely affected by changes in global economic conditions, including global inflationary pressures, prevailing interest rates, credit market conditions, increased unemployment, levels of consumer and business confidence, bank failures, commodity (including energy) prices and supply, a recession or economic slowdown, trade policies, foreign currency exchange rates, changing policy positions or priorities, governmental rules and approaches to taxation, levels of government spending and deficits, and actual or anticipated default on sovereign debt. Many of the jurisdictions in which our products are sold have experienced, and could continue to experience, unfavorable changes in economic conditions, which could negatively affect the affordability of, and consumer demand for, our beverages, and certain markets in which our products are sold experienced intensified inflation throughout 2023, which may continue to accelerate in 2024. Under difficult economic conditions, consumers may seek to reduce discretionary spending by forgoing purchases of our products or by shifting away from our beverages to lower-priced products offered by other companies, including private-label brands, which could reduce our profitability and negatively affect our overall financial performance. In addition, the occurrence or resurgence of global or regional health events, such as the COVID-19 pandemic, and the related governmental, private sector and individual consumer responses, could contribute to a recession, depression or global economic downturn.\n Other financial uncertainties in our major markets and unstable geopolitical conditions or events in certain markets, including international conflicts, civil unrest, acts of war, terrorism, governmental changes, or changes in international relations, could undermine global consumer confidence and reduce consumers' purchasing power, thereby reducing demand for our products. Geopolitical instability may also lead to heightened security risk, impacting employee safety and/or damage to infrastructure or our assets. At times, we have faced product boycotts resulting from activism, which have reduced demand for our products. Restrictions on our ability to transfer earnings or capital across borders, price controls, limitations on profits, retaliatory tariffs, import authorization requirements and other restrictions on business activities, which have been or may be imposed or expanded as a result of political and economic instability, deterioration of economic relations between countries or otherwise, could impact our profitability. In addition, U.S. trade sanctions against countries designated by the U.S. government as state sponsors of terrorism and/or financial institutions accepting transactions for commerce within such countries could increase significantly, which could make it difficult, or even impossible, for us to continue to make sales to bottlers in such countries. The imposition of retaliatory sanctions against U.S. multinational corporations by countries that are or may become subject to U.S. trade sanctions, or the delisting of our branded products by retailers in various countries in reaction to U.S. trade sanctions or other governmental actions or policies, could also negatively affect our business.\n 12\n \n Throughout 2023, the Company faced disruptions to our operations due to international conflicts, including the conflict between Russia and Ukraine and conflicts in the Middle East. These conflicts have resulted, and could continue to result, in volatile commodity markets; logistical, transportation and supply chain disruptions; increased risk of cyber incidents or other disruptions to our information systems; reputational risk; heightened risks to employee safety; business disruptions (including labor shortages); reduced availability and increased costs of transportation, energy, packaging, raw materials and other input costs; sanctions, export controls and other legislation or regulation; or difficulty protecting and enforcing our intellectual property rights. While we currently do not anticipate that the effects of these conflicts will have a material impact on our results of operations, we cannot predict how and the extent to which these conflicts will continue to affect our employees, operations, customers or business partners.\n Increased competition could hurt our business.\n We operate in the highly competitive commercial beverage industry. For additional information regarding the competitive environment in which we operate, including the names of certain of our significant competitors, refer to the heading \"Competition\" set forth in Part I, \"Item 1. Business\" of this report. Our ability to maintain or gain share of sales in the global market or in regional or local markets may be limited as a result of actions by competitors. Competitive pressures may cause the Company and our bottling partners to reduce prices we charge customers or may restrict our and our bottlers' ability to increase prices, as may be necessary in response to commodity and other cost increases. Such pressures may also increase marketing costs along with in-store placement, slotting and other marketing fees. In addition, the rapid growth of e‑commerce may create additional consumer price deflation by, among other things, facilitating comparison shopping, and could potentially threaten the value of some of our legacy route-to-market strategies and thus negatively affect revenues. If we do not continuously strengthen our capabilities in marketing and innovation to maintain consumer interest, brand loyalty and market share while strategically expanding into other profitable categories of the commercial beverage industry, our business could be negatively affected.\n If we are not successful in our innovation activities, our financial results may be negatively affected.\n Achieving our business growth objectives depends in part on our ability to evolve and improve our existing beverage products through innovation and to successfully develop, introduce and market new beverage products. The success of our innovation activities depends on our ability to correctly anticipate customer and consumer acceptance and trends; obtain, maintain and enforce necessary intellectual property rights; and avoid infringing on the intellectual property rights of others. If we are not successful in our innovation activities, we may not be able to achieve our growth objectives, which may have a negative impact on our financial results.\n Changes in the retail landscape or the loss of key retail or foodservice customers could adversely affect our financial results.\n Our industry is being affected by the trend toward consolidation in, and the blurring of the lines between, retail channels, particularly in Europe and the United States. Retailers may seek lower prices from us and our bottling partners, may demand increased marketing or promotional expenditures in support of their businesses, and may be more likely to use their distribution networks to introduce and develop private-label brands, any of which could negatively affect the Coca-Cola system's profitability. In addition, in developed markets, discounters and value stores are growing at a rapid pa",
    "item7": "ITEM 7.  MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n The following Management's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is intended to help the reader understand The Coca-Cola Company, our operations and our present business environment. MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and the accompanying notes thereto contained in \"Item 8. Financial Statements and Supplementary Data\" of this report. MD&A includes the following sections:\n \"Our Businessa general description of our business and its challenges and risks.\n \"\n Our Business\n a general description of our business and its challenges and risks.\n \"Critical Accounting Policies and Estimatesa discussion of accounting policies that require critical judgments and estimates.\n Critical Accounting Policies and Estimates\n a discussion of accounting policies that require critical judgments and estimates.\n \"Operations Reviewan analysis of our consolidated results of operations for 2023 and 2022 and year-to-year comparisons between 2023 and 2022. An analysis of our consolidated results of operations for 2022 and 2021 and year-\n Operations Review\n an analysis of our consolidated results of operations for 2023 and 2022 and year-to-year comparisons between 2023 and 2022. An analysis of our consolidated results of operations for 2022 and 2021 and year-\n 34\n \n to-year comparisons between 2022 and 2021 can be found in MD&A in Part II, Item 7 of the Company's Form 10-K for the year ended December 31, 2022.\n \"Liquidity, Capital Resources and Financial Positionan analysis of cash flows, contractual obligations, foreign exchange, and the impact of inflation and changing prices.\n Liquidity, Capital Resources and Financial Position\n an analysis of cash flows, contractual obligations, foreign exchange, and the impact of inflation and changing prices.\n OUR BUSINESS\n General\n The Coca-Cola Company is a total beverage company, and beverage products bearing our trademarks, sold in the United States since 1886, are now sold in more than 200 countries and territories. We own or license and market numerous beverage brands, which we group into the following categories: Trademark Coca-Cola; sparkling flavors; water, sports, coffee and tea; juice, value-added dairy and plant-based beverages; and emerging beverages. We own and market several of the world's largest nonalcoholic sparkling soft drink brands, including Coca-Cola, Sprite, Fanta, Coca-Cola Zero Sugar and Diet Coke/Coca-Cola Light.\n We make our branded beverage products available to consumers throughout the world through our network of independent bottling partners, distributors, wholesalers and retailers as well as the Company's consolidated bottling and distribution operations. Beverages bearing trademarks owned by or licensed to us account for 2.2 billion of the estimated 64 billion servings of all beverages consumed worldwide every day.\n We believe our success depends on our ability to connect with consumers by providing them with a wide variety of beverage options to meet their desires, needs and lifestyles. Our success further depends on the ability of our people to execute effectively, every day.\n Our Company operates in two lines of business: concentrate operations and finished product operations.\n Our concentrate operations typically generate net operating revenues by selling beverage concentrates, sometimes referred to as \"beverage bases,\" syrups, including fountain syrups, and certain finished beverages to authorized bottling operations (to which we typically refer as our \"bottlers\" or our \"bottling partners\"). Our bottling partners either combine concentrates with still or sparkling water and sweeteners (depending on the product), or combine syrups with still or sparkling water, to produce finished beverages. The finished beverages are packaged in authorized containers, such as cans and refillable and nonrefillable glass and plastic bottles, bearing our trademarks or trademarks licensed to us and are then sold to retailers directly or, in some cases, through wholesalers or other bottlers. In addition, outside the United States, our bottling partners are typically authorized to manufacture fountain syrups, using our concentrates, which they sell to fountain retailers for use in producing beverages for immediate consumption, or to authorized fountain wholesalers who in turn sell and distribute the fountain syrups to fountain retailers. Our concentrate operations are included in our geographic operating segments and our Global Ventures operating segment.\n Our finished product operations generate net operating revenues by selling sparkling soft drinks and a variety of other finished beverages to retailers, or to distributors and wholesalers who in turn sell the beverages to retailers. Generally, finished product operations generate higher net operating revenues but lower gross profit margins than concentrate operations. These operations consist primarily of our consolidated bottling and distribution operations, which are included in our Bottling Investments operating segment. In certain markets, the Company also operates non-bottling finished product operations in which we sell finished beverages to distributors and wholesalers that are generally not one of the Company's bottling partners. These operations are generally included in one of our geographic operating segments or our Global Ventures operating segment. Additionally, we sell directly to consumers through retail stores operated by Costa. These sales are included in our Global Ventures operating segment. In the United States, we manufacture fountain syrups and sell them to fountain retailers, who use the fountain syrups to produce beverages for immediate consumption, or to authorized fountain wholesalers or bottling partners who in turn sell and distribute the fountain syrups to fountain retailers. These fountain syrup sales are included in our North America operating segment.\n 35\n The following table sets forth the percentage of total net operating revenues attributable to concentrate operations and finished product operations:\n Year Ended December 31,20232022Concentrate operations58%56%Finished product operations4244Total100%100%\n Year Ended December 31,20232022\n Year Ended December 31,\n 2023\n 2022\n Concentrate operations58%56%\n Concentrate operations\n 58\n %\n 56\n Finished product operations4244\n Finished product operations\n 42\n 44\n Total100%100%\n Total\n 100\n The following table sets forth the percentage of total worldwide unit case volume attributable to concentrate operations and finished product operations:\n Year Ended December 31,20232022Concentrate operations83%82%Finished product operations1718Total100%100%\n Concentrate operations83%82%\n 83\n 82\n Finished product operations1718\n 17\n 18\n We operate in the highly competitive commercial beverage industry. We face strong competition from numerous other general and specialty beverage companies. We, along with other beverage companies, are affected by a number of factors, including, but not limited to, the cost to manufacture and distribute products, consumer spending, economic conditions, availability and quality of water, consumer preferences, inflation, geopolitical conditions including international conflicts, local and national laws and regulations, foreign currency exchange rate fluctuations, fuel prices, weather patterns and health crises.\n Despite the dynamic world in which we are currently operating, we believe we are well positioned to create value for our Company and our stakeholders. In an effort to support our future growth, we are continuing to invest in our portfolio of brands, our strategic capabilities and our people. We are focused on the following strategic priorities: unlocking the potential of our portfolio of strong global, regional and scaled local brands; developing a robust in",
    "item7a": "ITEM 7A.  QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n Our Company uses derivative financial instruments primarily to reduce our exposure to adverse fluctuations in foreign currency exchange rates, interest rates, commodity prices and other market risks. We do not enter into derivative financial instruments for trading purposes. As a matter of policy, all of our derivative positions are used to reduce risk by hedging an underlying economic exposure. Because of the high correlation between the hedging instruments and the underlying exposures, fluctuations in the values of the instruments are generally offset by reciprocal changes in the values of the underlying exposures.\n We monitor our exposure to market risks using several objective measurement systems, including a sensitivity analysis to measure our exposure to fluctuations in foreign currency exchange rates, interest rates and commodity prices. Refer to Note 5 of Notes to Consolidated Financial Statements for additional information about our hedging transactions and derivative financial instruments.\n Foreign Currency Exchange Rates\n We manage most of our foreign currency exposures on a consolidated basis, which allows us to net certain exposures and take advantage of any natural offsets. In 2023, we generated $29.2 billion of our net operating revenues from operations outside the United States. Due to the geographic diversity of our operations, weakness in some currencies may be offset by strength in other currencies over time. We use derivative financial instruments to further reduce our net exposure to foreign currency exchange rate fluctuations.\n Our Company enters into forward exchange contracts and purchases foreign currency options and collars (principally euro, British pound and Japanese yen) to hedge certain portions of forecasted cash flows denominated in foreign currencies. Additionally, we enter into forward exchange contracts to offset the earnings impact related to foreign currency exchange rate fluctuations on certain monetary assets and liabilities. We also enter into forward exchange contracts as hedges of net investments in foreign operations.\n The total notional values of our foreign currency derivatives were $17,505 million and $11,370 million as of December 31, 2023 and 2022, respectively. These values included derivative instruments that were designated and qualified for hedge accounting along with derivative instruments that are economic hedges. The fair value of foreign currency derivatives that qualified for hedge accounting resulted in a net unrealized gain of $22 million as of December 31, 2023, and we estimate that a 10% weakening of the U.S. dollar would have resulted in a $278 million decrease in fair value. The fair value of the foreign currency derivatives that did not qualify for hedge accounting resulted in a net unrealized loss of $15 million as of December 31, 2023, and we estimate that a 10% weakening of the U.S. dollar would have resulted in a $161 million decrease in fair value.\n 58\n \n Interest Rates\n The Company is subject to interest rate volatility with regard to existing and future issuances of debt. We monitor our mix of fixed-rate and variable-rate debt as well as our mix of short-term debt and long-term debt. From time to time, we enter into interest rate swap agreements to manage our exposure to interest rate fluctuations.\n Based on the Company's variable-rate debt and derivative instruments outstanding as of December 31, 2023, we estimate that a 1 percentage point increase in interest rates would have increased interest expense by $134 million in 2023. However, this increase in interest expense would have been partially offset by the increase in interest income due to higher interest rates.\n The Company is subject to interest rate risk related to its investments in highly liquid debt securities. These investments are primarily managed by external managers within the guidelines of the Company's investment policy. Our policy requires these investments to be investment grade, with the primary objective of minimizing the risk of principal loss. In addition, our policy limits the amount of credit exposure to any one issuer. We estimate that a 1 percentage point increase in interest rates would have resulted in a $29 million decrease in the fair value of our portfolio of highly liquid debt securities.\n Commodity Prices\n The Company is subject to market risk with respect to commodity price fluctuations, principally related to our purchases of sweeteners, metals, juices, PET and fuels. We manage our exposure to commodity risks primarily through the use of supplier pricing agreements, which enable us to establish the purchase prices for certain inputs that are used in our manufacturing and distribution operations. When deemed appropriate, we use derivative financial instruments to further manage our exposure to commodity risks. Certain of these derivatives do not qualify for hedge accounting, but they are effective economic hedges that help the Company mitigate the price risk associated with the purchases and transportation of materials used in our manufacturing processes.\n The total notional values of our commodity derivatives were $379 million and $371 million as of December 31, 2023 and 2022, respectively. These values included derivative instruments that were designated and qualified for hedge accounting along with derivative instruments that are economic hedges. The fair value of commodity derivatives that qualified for hedge accounting resulted in a net unrealized loss of $3 million as of December 31, 2023, and we estimate that a 10% decrease in underlying commodity prices would have resulted in a $3 million decrease in fair value.The fair value of the commodity derivatives that did not qualify for hedge accounting resulted in a net loss of $58 million as of December 31, 2023, and we estimate that a 10% decrease in underlying commodity prices would have resulted in a $54 million decrease in fair value.\n The total notional values of our commodity derivatives were $379 million and $371 million as of December 31, 2023 and 2022, respectively. These values included derivative instruments that were designated and qualified for hedge accounting along with derivative instruments that are economic hedges. The fair value of commodity derivatives that qualified for hedge accounting resulted in a net unrealized loss of $3 million as of December 31, 2023, and we estimate that a 10% decrease in underlying commodity prices would have resulted in a $3 million decrease in fair value\n .\n The fair value of the commodity derivatives that did not qualify for hedge accounting resulted in a net loss of $58 million as of December 31, 2023, and we estimate that a 10% decrease in underlying commodity prices would have resulted in a $54 million decrease in fair value.\n 59\n"
}