{
    "cik": 1065088,
    "cusip6": "278642",
    "cusip": [
        "278642103"
    ],
    "names": [
        "EBAY INC. COM",
        "Ebay Inc",
        "EBAY INC.",
        "EBAY INC",
        "EBAY INC COM",
        "Ebay Inc - US",
        "EBAY INC",
        "EBAY   INC.",
        "eBay Inc.",
        "eBay Inc",
        "Ebay, Inc.",
        "EBAY",
        "eBay, Inc.",
        "EBAY INC.",
        "EASTMAN CHEMICAL CO",
        "Ebay",
        "Ebay INC CORP",
        "EBAY ORD",
        "E BAY INC",
        "EBAY INC.",
        "EBAY INC  COM",
        "EBAY INC",
        "EBAY INC",
        "Ebay Inc.",
        "Ebay Inc. Com",
        "EBAY INC",
        "EBAY INC.",
        "EBAY INC.",
        "EBAY INC.",
        "EBAY INC.",
        "Ebay Inc",
        "EBAY INC                    COM",
        "EBAY INC COM                   COM",
        "EBAY INC",
        "E Bay Inc.",
        "Ebay inc",
        "Ebay INC CORP COMMON",
        "EbayInc",
        "EBAY INC COM USD0.001 (US LISTED)",
        "Ebay Inc Com",
        "EBAYINC",
        "EBAY Inc Com"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1065088/000106508824000036/ebay-20231231.htm",
    "item1": "ITEM 1:BUSINESS\n ITEM 1:\n BUSINESS\n \n Unless otherwise expressly stated or the context otherwise requires, when we refer to \"we,\" \"our,\" \"us,\" \"eBay\" or the \"Company\" in this annual report on Form 10-K, we mean eBay Inc. and its consolidated subsidiaries.\n Overview\n Founded in 1995 in San Jose, California, eBay Inc. is a global commerce leader that connects people and builds communities to create economic opportunity for all. Our technology empowers millions of buyers and sellers in more than 190 markets around the world, providing everyone the opportunity to grow and thrive. Our Marketplace platforms, including our online marketplace located at www.ebay.com and its localized counterparts, our off-platform businesses in Japan and the United States, and our suite of mobile apps, together, create one of the world's largest and most vibrant marketplaces for discovering great value and unique selection. In 2023, eBay enabled more than $73 billion of gross merchandise volume. For more information about the Company and its global portfolio of online brands, visit www.ebayinc.com.\n Our Strategy\n As a global commerce leader and third-party marketplace, our technologies and services are designed to provide buyers choice and a breadth of relevant inventory from around the globe, and to enable sellers' access to eBay's 132 million buyers worldwide. Our business model and pricing are designed so our business is successful when our sellers are successful. We earn revenue primarily through fees collected on paid sales, inclusive of payment processing and first-party advertising.\n eBay's strategy is to leverage technology to enhance the marketplace experience for our customers to drive growth in Gross Merchandise Volume (\"GMV\"), while increasing the rate of revenue growth through our advertising initiatives and delivering healthy operating margins. Beginning in 2020, we embarked on a multi-year journey to build more compelling category experiences for enthusiastic consumers, to become the partner of choice for sellers and to strengthen trust in relationships with buyers on our Marketplace platforms. In 2023, we evolved our strategy to focus on reinventing the future of ecommerce for enthusiasts. We derived a majority of GMV in 2023 from the following product categories: parts & accessories, collectibles, fashion, electronics, and home & garden.\n Since late 2021, eBay has managed payments for all transactions on our Marketplace platforms, delivering buyers and sellers a simplified end-to-end payments experience. Through managed payments, we are able to provide a frictionless experience for current and next-generation customers, consistent with today's retail standards. We offer buyers more flexibility and choice in how to pay and offer sellers a more streamlined way to run their businesses.\n We are focused on growing our first-party advertising revenue through our suite of Promoted Listings products while reducing our focus on non-strategic, third-party advertising. We currently offer several Promoted Listings products, including: Promoted Listings Standard (a cost-per-acquisition product), Promoted Listings Express (a cost-per-acquisition product for auction listings), Promoted Listings Advanced (a cost-per-click product) and External Promoted Listings (an off-platform advertising product). Through our portfolio of Promoted Listings offerings, we provide sellers with data-driven recommendations to improve their conversion and drive velocity, while testing and building more technology features to drive growth, position eBay as the seller's platform of choice and surface relevant inventory to buyers.\n We have acquired, and also disposed of, a significant number of businesses, technologies, services and products, and we maintain investments in certain businesses. We regularly review and manage our investments to ensure they support eBay's strategic direction and complement our disciplined approach to value creation, profitability and capital allocation. We expect to continue to evaluate and consider potential strategic transactions as part of our strategy, including business combinations, acquisitions and dispositions of businesses, technologies, services, products and other assets, as well as strategic investments and joint ventures.\n 5\n Tableof Contents\n Tabl\n e\n of Contents\n Our Customer Offerings\n We provide a number of features for our sellers and buyers that align with our approach to becoming the partner of choice for sellers and building life-long, trusted buyer relationships. These offerings are designed to build trust and confidence on our Marketplace platforms and drive GMV.\n To become the partner of choice for sellers, we continuously invest in technology to deliver quality selling experiences and products to grow the seller tools ecosystem. Our new magical listing experience offers an artificial intelligence (\"AI\") driven description for all listings across our Marketplace platforms   desktop, mobile and app   reducing the time to list and enhance seller experience. In 2023, we expanded our Promoted Listings offerings to help our sellers drive greater velocity and price realization for their inventory. We also expanded the eBay International Shipping program for United States sellers surfacing millions of listings to buyers across more than 190 countries while removing the friction of international shipping and customs formalities.\n To further strengthen our buyers' confidence and trust in our services, we offer \"eBay Money Back Guarantee,\" which allows buyers to receive their money back if the item they ordered does not arrive, is faulty or damaged or does not match the listing. eBay Money Back Guarantee covers most items purchased on the eBay Marketplace platform in the United States, the United Kingdom, Germany, Australia, Canada, France, Italy and Spain through a qualifying payment method. In addition, eBay authenticates eligible luxury and collectible items in five categories through \"Authenticity Guarantee\", an independent authentication service available in the United States, the United Kingdom, Germany, Australia and Canada. In our parts & accessories category, we focused on fitment to ensure that automotive enthusiasts are able to find the right parts to fit their vehicles by integrating the acquired technical capabilities of MyFitment onto our platforms. We also continue to expand our eBay Refurbished offering, a dedicated destination that brings inventory from pre-selected brands and top rated sellers with standardized condition grading, to meet consumer demand for top products backed by a warranty.\n Our Impact and Responsibility\n eBay's purpose is to empower people and create economic opportunity for all through our technology for our global community of users. Every day, people build businesses on our Marketplace platforms. With a low cost of entry for sellers, we offer a highly accessible way for all types of users to interact in a global marketplace that's inclusive and connects people of all backgrounds. Accordingly, we prioritize our corporate responsibility efforts to impact the areas of economic empowerment and sustainable commerce. Key economic programs include eBay for Charity, the eBay Foundation and our small business enablement efforts, such as our Up & Running Grants program.\n eBay for Charity empowers buyers and sellers to support charities around the world. In 2023, eBay for Charity matched donations made to the International Rescue Committee, Team Rubicon, World Central Kitchen, Hawaii Community Foundation and American National Red Cross, and partnered with Homes For Our Troops, GiveLove, Deckaid Inc, Direct Relief and Free The Work. In 2023, nearly $162 million was raised by buyers and sellers to support charities via eBay for Charity.\n The eBay Foundation helps to build economically vibrant and thriving communities. During 2023, the eBay Foundation granted more than $19 million through strategic grantmaking and our employee",
    "item1a": "Item 1A:RISK FACTORS\n Item 1A:\n RISK FACTORS\n \n Risk Factors Summary:\n The summary of risks below provides an overview of the principal risks we are exposed to in the normal course of our business activities:\n \"Our operating and financial results are subject to various risks and uncertainties that could adversely affect our business, financial condition, results of operations and cash flows, as well as the trading price of our common stock and debt securities.\n \"\n Our operating and financial results are subject to various risks and uncertainties that could adversely affect our business, financial condition, results of operations and cash flows, as well as the trading price of our common stock and debt securities.\n \"Substantial and increasingly intense competition worldwide in ecommerce may harm our business.\n Substantial and increasingly intense competition worldwide in ecommerce may harm our business.\n \"We are exposed to fluctuations in foreign currency exchange rates, which could negatively impact our financial results.\n We are exposed to fluctuations in foreign currency exchange rates, which could negatively impact our financial results.\n \"Our international operations and engagement in cross-border trade are subject to risks, which could harm our business.\n Our international operations and engagement in cross-border trade are subject to risks, which could harm our business.\n \"Our business may be adversely affected by geopolitical events, natural disasters, seasonal factors and other factors that cause our users to spend less time, or transact less, on our websites or mobile platforms and applications, including increased usage of other websites.\n Our business may be adversely affected by geopolitical events, natural disasters, seasonal factors and other factors that cause our users to spend less time, or transact less, on our websites or mobile platforms and applications, including increased usage of other websites.\n \"If we cannot keep pace with rapid technological developments or continue to innovate and create new initiatives to provide new programs, products and services, the use of our products and our revenues could decline.\n If we cannot keep pace with rapid technological developments or continue to innovate and create new initiatives to provide new programs, products and services, the use of our products and our revenues could decline.\n \"Changes to our programs to protect buyers and sellers could increase our costs and loss rate, and failure to manage such programs effectively can result in harm to our reputation.\n Changes to our programs to protect buyers and sellers could increase our costs and loss rate, and failure to manage such programs effectively can result in harm to our reputation.\n \"Operations and continued development of our payments system and financial services offerings require ongoing investment, are subject to evolving laws, regulations, rules, and standards, and involve risk, including risks related to our dependence on third-party providers.\n Operations and continued development of our payments system and financial services offerings require ongoing investment, are subject to evolving laws, regulations, rules, and standards, and involve risk, including risks related to our dependence on third-party providers.\n \"We may be unable to adequately protect or enforce our intellectual property rights and face ongoing allegations by third parties that we are infringing their intellectual property rights.\n We may be unable to adequately protect or enforce our intellectual property rights and face ongoing allegations by third parties that we are infringing their intellectual property rights.\n \"Failure to deal effectively with fraudulent activities on our platforms would increase our loss rate and harm our business, and could severely diminish merchant and consumer confidence in and use of our services.\n Failure to deal effectively with fraudulent activities on our platforms would increase our loss rate and harm our business, and could severely diminish merchant and consumer confidence in and use of our services.\n \"Our business is subject to online security risks, including security breaches and cyberattacks.\n Our business is subject to online security risks, including security breaches and cyberattacks.\n \"Systems failures and resulting interruptions in the availability of or degradation in the performance of our websites, applications, products or services could harm our business.\n Systems failures and resulting interruptions in the availability of or degradation in the performance of our websites, applications, products or services could harm our business.\n \"Our success largely depends on key employees. Because competition for key employees is intense, we  may not be able to attract, retain, and develop the highly skilled employees we need to support our business. The loss of senior management or other key employees could harm our business.\n Our success largely depends on key employees. Because competition for key employees is intense, we  may not be able to attract, retain, and develop the highly skilled employees we need to support our business. The loss of senior management or other key employees could harm our business.\n \"Problems with or price increases by third parties who provide services to us or to our sellers could harm our business.\n Problems with or price increases by third parties who provide services to us or to our sellers could harm our business.\n \"Our business is subject to extensive and increasing government regulation and oversight, which could adversely impact our business.\n Our business is subject to extensive and increasing government regulation and oversight, which could adversely impact our business.\n \"New laws and increasing levels of regulation in the areas of privacy and protection of user data could harm our business.\n New laws and increasing levels of regulation in the areas of privacy and protection of user data could harm our business.\n \"Other laws and regulations could harm our business.\n Other laws and regulations could harm our business.\n \"Our disclosures and stakeholder expectations related to environmental, social and governance matters may impose additional costs and expose us to new risks.\n Our disclosures and stakeholder expectations related to environmental, social and governance matters may impose additional costs and expose us to new risks.\n \"We are regularly subject to litigation and regulatory and government inquiries, investigations and disputes, as our business evolves and as governments and regulators seek to extend new and existing laws to reach our business model.\n We are regularly subject to litigation and regulatory and government inquiries, investigations and disputes, as our business evolves and as governments and regulators seek to extend new and existing laws to reach our business model.\n \"We could be subject to regulatory or agency investigations and/or court proceedings under unfair competition laws that could adversely impact our business.\n We could be subject to regulatory or agency investigations and/or court proceedings under unfair competition laws that could adversely impact our business.\n \"The listing or sale by our users of certain items, including items that allegedly infringe the intellectual property rights of rights owners, including pirated or counterfeit items, illegal items or items used in an illegal manner, may harm our business.\n The listing or sale by our users of certain items, including items that allegedly infringe the intellectual property rights of rights owners, including pirated or counterfeit items, illegal items or items used in an illegal manner, may harm our business.\n \"We are subject to risks associated with information disseminated through our services.\n We are subject to risks associated with information disseminated through our services.\n \"Fluctuations in interest rates, and changes in regulatory guidance related to such interest rates, cou",
    "item7": "ITEM 7:MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n ITEM 7:\n MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \n You should read the following Management's Discussion and Analysis of Financial Condition and Results of Operations in conjunction with the consolidated financial statements and the related notes included in this report. This section of this Form 10-K generally discusses 2023 and 2022 items and year-to-year comparisons between 2023 and 2022. Discussions of 2021 items and year-to-year comparisons between 2022 and 2021 are not included in this Form 10-K, and can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2022.\n OVERVIEW\n Business\n eBay Inc. is a global commerce leader that connects people and builds communities to create economic opportunity for all. Our technology empowers millions of buyers and sellers in more than 190 markets around the world, providing everyone the opportunity to grow and thrive. Our Marketplace platforms, including our online marketplace located at www.ebay.com and its localized counterparts, our off-platform businesses in Japan and the United States, and our suite of mobile apps, together, create one of the world's largest and most vibrant marketplaces for discovering great value and unique selection.\n Throughout most of 2023, we experienced reduced traffic in most markets resulting from geopolitical events, inflationary pressure, foreign exchange rate volatility, elevated interest rates and lower consumer confidence. These factors negatively impacted discretionary consumer spending, are uncertain in duration and we expect them to continue into 2024.\n Presentation\n In addition to the corresponding measures under generally accepted accounting principles (\"GAAP\"), management uses non-GAAP measures in reviewing our financial results. The foreign exchange neutral (\"FX-Neutral\"), or constant currency, net revenue amounts discussed below are non-GAAP financial measures and are not in accordance with, or an alternative to, measures prepared in accordance with GAAP. Accordingly, the FX-Neutral information appearing in the following discussion of our results of operations should be read in conjunction with the information provided below in \"Non-GAAP Measures of Financial Performance,\" which includes reconciliations of FX-Neutral financial measures to the most directly comparable GAAP measures. We calculate the year-over-year impact of foreign currency movements using prior period foreign currency rates, excluding hedging activity, applied to current year transactional currency amounts.\n In addition to the corresponding measures under generally accepted accounting principles (\"GAAP\"), management uses non-GAAP measures in reviewing our financial results. The foreign exchange neutral (\"FX-Neutral\"), or constant currency, net revenue amounts discussed below are non-GAAP financial measures and are not in accordance with, or an alternative to, measures prepared in accordance with GAAP. Accordingly, the FX-Neutral information appearing in the following discussion of our results of operations should be read in conjunction with the information provided below in \"\n Non-GAAP Measures of Financial Performance\n ,\" which includes reconciliations of FX-Neutral financial measures to the most directly comparable GAAP measures. We calculate the year-over-year impact of foreign currency movements using prior period foreign currency rates, excluding hedging activity, applied to current year transactional currency amounts.\n 38\n Tableof Contents\n Tabl\n e\n of Contents\n Fiscal Year Highlights\n Net revenues increased 3% to $10.1 billion during 2023 compared to $9.8 billion in 2022. FX-Neutral net revenues (as defined above) increased 4% compared to 2022. Operating margin decreased to 19.2% in 2023 compared to 24.0% in 2022.\n We generated cash flow from continuing operating activities of $2.4 billion in 2023 compared to $2.6 billion in 2022.\n We recorded $1.8 billion of aggregate gains on equity investments and warrant in our consolidated statement of income during 2023 compared to $3.8 billion of aggregate losses recorded during 2022.\n In 2023, we repurchased $1.4 billion of common stock and paid $528 million in cash dividends.\n In 2023, we repaid debt of $1.2 billion consisting of thefloating rate and 2.750% senior notes due 2023.\n In 2023, we repaid debt of $1.2 billion consisting of the\n floating rate and 2.750% senior notes due 2023.\n In 2023, we announced our support for the voluntary tender offer led by Permira and Blackstone to acquire all the publicly traded shares of Adevinta (the \"Adevinta Transaction\"). As part of the Adevinta Transaction, eBay agreed to sell 50% of its shares for an estimated $2.2 billion and to exchange the remaining shares for an equity stake of approximately 20% in the newly privatized company. The Adevinta Transaction remains subject to closing conditions and is expected to be completed in the second quarter of 2024.\n In February 2024, our Board authorized an additional $2.0 billion stock repurchase program with no expiration from the date of authorization.\n In February 2024, we declared a cash dividend for the first quarter of 2024 of $0.27 per share of common stock to be paid on March 25, 2024 to stockholders of record as of March 11, 2024.\n 39\n RESULTS OF OPERATIONS\n We have one reportable segment to reflect the way management and our chief operating decision maker (\"CODM\") review and assess performance of the business. Our reportable segment is Marketplace, which includes our online marketplace located at www.ebay.com, its localized counterparts and the eBay suite of mobile apps. The accounting policies of our segment are the same as those described in \"Note 1   The Company and Summary of Significant Accounting Policies\" in our consolidated financial statements included elsewhere in this report.\n Net Revenues\n Net revenues primarily include final value fees, feature fees, fees to promote listings, payment service fees, listing fees, and store subscription fees from sellers on our platforms. Our net revenues also include revenues from the sale of advertisements, revenue sharing arrangements and shipping fees. Our net revenues are reduced by incentives, including discounts, coupons and rewards, provided to our customers.\n The following table presents net revenues for the periods indicated (in millions, except percentages):\n Year Ended December 31,2023% Change2022% Change2021Net revenues$10,1123%$9,795(6)%$10,420\n Year Ended December 31,\n 2023% Change2022% Change2021\n 2023\n % Change\n 2022\n 2021\n Net revenues$10,1123%$9,795(6)%$10,420\n Net revenues\n $\n 10,112\n 3\n %\n 9,795\n (6)\n 10,420\n Seasonality\n We expect transaction activity patterns on our platforms to trend with general consumer buying patterns and expect that these trends will continue. Seasonal trends in net revenues may be influenced as we introduce and scale new products throughout the year. In addition, macroeconomic conditions, including the impact of COVID-19, have in the past disrupted seasonal patterns in net revenues, particularly in the first quarter of 2021. The following table presents our total net revenues and the sequential quarterly movements of these net revenues for the periods indicated (in millions, except percentages):\n Quarter EndedMarch 31June 30September 30December 312021Net revenues$2,638$2,668$2,501$2,613% change from prior quarter6%1%(6)%4%2022Net revenues$2,483$2,422$2,380$2,510% change from prior quarter(5)%(2)%(2)%5%2023Net revenues$2,510$2,540$2,500$2,562% change from prior quarter%1%(2)%2%\n Quarter Ended\n March 31June 30September 30December 31\n March 31\n June 30\n September 30\n December 31\n Net revenues$2,638$2,668$2,501$2,613\n 2,638\n 2,668\n 2,501\n 2,613\n % change from prior quarter6%1%(6)%4%\n % c",
    "item7a": "ITEM 7A:QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n ITEM 7A:\n QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n \n Interest Rate Risk\n We are exposed to interest rate risk relating to our investments and outstanding debt. In addition, adverse economic conditions and events (including volatility or distress in the equity and/or debt or credit markets) may impact regional and global financial markets. These events and conditions could cause us to write down our assets or investments. We seek to reduce earnings volatility that may result from adverse economic conditions and events or changes in interest rates.\n The primary objective of our investment activities is to preserve principal while at the same time improving yields without significantly increasing risk. To achieve this objective, we maintain our cash equivalents, customer accounts and short-term and long-term investments in a variety of asset types, including bank deposits, government bonds and corporate debt securities. As of December 31, 2023, approximately 23% of our total cash and investments was held in cash and cash equivalents and customer accounts. As such, changes in interest rates will impact interest income. As discussed below, the fair market values of our fixed rate securities may be adversely affected due to a rise in interest rates, and we may suffer losses in principal if we are forced to sell securities that have declined in market value due to changes in interest rates.\n As of December 31, 2023, the balance of our corporate debt and government bond securities was $3.1 billion, which represented approximately 29% of our total cash and investments. Investments in both fixed-rate and floating-rate interest-earning instruments carry varying degrees of interest rate risk. The fair market value of our fixed-rate investment securities may be adversely impacted due to a rise in interest rates. In general, fixed-rate securities with longer maturities are subject to greater interest rate risk than those with shorter maturities. While floating rate securities generally are subject to less interest rate risk than fixed-rate securities, floating-rate securities may produce less income than expected if interest rates decrease and may also suffer a decline in market value if interest rates increase. Due in part to these factors, our investment income may fall short of expectations or we may suffer losses in principal if we sell securities that have declined in market value due to changes in interest rates. A hypothetical 1% (100 basis point) increase in interest rates would have resulted in a decrease in the fair value of our investments of $20 million and $22 million as of December 31, 2023 and 2022, respectively.\n Further changes in interest rates will impact interest expense on any borrowings under our revolving credit facility, which bear interest at floating rates, and the interest rate on any commercial paper borrowings we make and any debt securities we may issue in the future and, accordingly, will impact interest expense. For additional details related to our debt, see \"Note 11   Debt\" to our consolidated financial statements included in this report.\n Equity Price Risk\n Equity Investments\n In 2021, we completed the transfer of our Classifieds business to Adevinta. Upon completion of the transfer we received an equity interest in Adevinta. The equity investment is accounted for under the fair value option and changes in Adevinta's stock price and equity volatility have had a significant impact on the value of our equity investment in Adevinta. As of December 31, 2023, a hypothetical one dollar change in the fair value of one share of Adevinta's common stock, holding other factors constant, would have increased or decreased the fair value of the investment by approximately $404 million.\n Our remaining equity investments are primarily investments in privately-held companies. Our consolidated results of operations include, as a component of gain (loss) on equity investments and warrant, net, our share of the net income or loss of the equity investments accounted for under the equity method of accounting, or the change in fair value of the equity method investments accounted for under the fair value option. Equity investments without readily determinable fair values are accounted for at cost, less impairment and adjusted for subsequent observable price changes obtained from orderly transactions for identical or similar investments issued by the same investee. Such changes in the basis of the equity investment are recognized in gain (loss) on equity investments and warrant, net.Equity investments under the fair value option are measured at fair value based on a quarterly valuation analysis andare classified within Level 3 in the fair value hierarchy as the valuation reflects management's estimate of assumptions that market participants would use in pricing the equity investment.Subsequent changes in fair value are recognized in gain (loss) on equity investments and warrant, net.\n Our remaining equity investments are primarily investments in privately-held companies. Our consolidated results of operations include, as a component of gain (loss) on equity investments and warrant, net, our share of the net income or loss of the equity investments accounted for under the equity method of accounting, or the change in fair value of the equity method investments accounted for under the fair value option. Equity investments without readily determinable fair values are accounted for at cost, less impairment and adjusted for subsequent observable price changes obtained from orderly transactions for identical or similar investments issued by the same investee. Such changes in the basis of the equity investment are recognized in gain (loss) on equity investments and warrant, net.\n Equity investments under the fair value option are measured at fair value based on a quarterly valuation analysis and\n are classified within Level 3 in the fair value hierarchy as the valuation reflects management's estimate of assumptions that market participants would use in pricing the equity investment.\n S\n ubsequent changes in fair value are recognized in gain (loss) on equity investments and warrant, net.\n 54\n Tableof Contents\n Tabl\n e\n of Contents\n As of December 31, 2023, our equity investments totaled $5.0 billion, which represented approximately 47% of our total cash and investments, and primarily related to our equity investment in Adevinta.\n For additional details related to our investments, please see \"Note 7   Investments\" to our consolidated financial statements included in this report.\n Warrant\n We entered into a warrant agreement in conjunction with a commercial agreement with Adyen that, subject to meeting certain conditions, entitles us to acquire a fixed number of shares up to 5% of Adyen's fully diluted issued and outstanding share capital at a specific date. As discussed in \"Note 8   Derivative Instruments\" to our consolidated financial statements included in this report, in 2021 we met the processing volume milestone target to vest the first tranche of the warrant, and we exercised the option to purchase shares of Adyen. The remaining tranches of the warrant are accounted for as a derivative instrument under ASC Topic 815,Derivatives and Hedging. Changes in Adyen's common stock price and equity volatility may have a significant impact on the value of the warrant. As of December 31, 2023, a hypothetical one dollar change in the fair value of one share of Adyen's common stock, holding other factors constant, would have increased or decreased the fair value of the warrant by approximately $0.4 million. For additional details related to the warrant, please see \"Note 8   Derivative Instruments\" to our consolidated financial statements included in this report.\n We entered into a warrant agreement in conjunction with a commercial agreement with Adyen that, subject to meeting certai"
}