{
    "cik": 200406,
    "cusip6": "478160",
    "cusip": [
        "478160104"
    ],
    "names": [
        "JOHNSON & JOHNSON",
        "JOHNSON & JOHNSON COM",
        "Johnson & Johnson",
        "JOHNSON &JOHNSON",
        "JOHNSON  JOHNSON",
        "JOHNSON JOHNSON",
        "JOHNSON & JOHNSON",
        "Johnson  Johnson",
        "JOHNSON & JOHNSON",
        "Johnson & Johnson - US",
        "JOHNSON & JOHNSON",
        "Johnson and Johnson",
        "JOHNSON &amp; JOHNSON",
        "JOHNSON AND JOHNSON",
        "JOHNSON &amp;amp; JOHNSON",
        "JOHNSON &amp;amp;amp; JOHNSON",
        "JOHNSON &amp;amp;amp;amp; JOHNSON",
        "JOHNSON &amp;amp;amp;amp;amp; JOHNSON",
        "JOHNSON &amp;amp;amp;amp;amp;amp; JOHNSON",
        "JOHN & JOHN COM",
        "JOHNSON & JOHNS STK",
        "JOHNSON    &   JOHNSON",
        "JOHNSON&JOHNSON",
        "JOHNSON & JOHNSON",
        "JOHNSON & JOHNSON CO",
        "Johnson &amp; Johnson",
        "JOHNSON & JOHNSON       EXCHANGE OFFER          EXP: 08/18/23",
        "JOHNSON  JOHNSON WD",
        "JOHNSON & JOHNSON",
        "JOHNSON & JOHNSON CMN",
        "Johnson   Johnson",
        "JOHNSON & JOHNSON",
        "JONES LANG LASALLE INC",
        "Johnson & Johnson Co.",
        "Johnson & Johnson",
        "JOHNSON AND JOHNSON",
        "JOHNSON  JOHNSON COM",
        "Johnson & Johnson (jnj)",
        "Johnson & Johnson",
        "JOHNSON and JOHNSON",
        "Johnson Johnson",
        "JOHNSON &JOHNSON COM USD1 00",
        "JOHNSON  JOHNSON",
        "JOHNSON  JOHNSON",
        "JOHNSON & JOHNSON ORD (NYS)",
        "JOHNSON &#38 JOHNSON",
        "JOHNSON & JOHNSON COMMON STOCK",
        "JOHNSON & JOHNSON USD1 Common Stock",
        "JOHNSON &JOHNSON COM USD1.00",
        "JOHNSON & JOHNSON COM USD1",
        "JOHNSON & JOHNSON",
        "Johnson & Johnson",
        "JOHNSON plus JOHNSON W/D",
        "JOHNSON &",
        "JOHNSON   JOHNSON",
        "JOHNSON & JOHNSON ORD",
        "JOHNSON & JOHNSON (JNJ)",
        "Matinas Biopharma Holdings Inc",
        "Johnson & Johnson Com",
        "JOHNSON  JOHNSON",
        "JOHNSON &amp JOHNSON",
        "JOHNSON & JOHNSON",
        "Johnson & Johnson",
        "Johnson And Johnson  Com",
        "JOHNSON & JOHNSON",
        "JOHNSON & JOHNSON",
        "JOHNSON & JOHNSON",
        "Johnson & Johnson Co",
        "Johnson & Johnson",
        "Johnson & Johnson",
        "JOHNSON  AND  JOHNSON COM",
        "JOHNSON JOHNSON COM",
        "JOHNSON & JOHNSON",
        "JOHNSON   JOHNSON W/D",
        "JOHNSON & JOHNSON           COM",
        "JNJ",
        "Johnson & Johnson",
        "Johnson&Johnson",
        "JOHNSON & JOHNSON COMMON STOCK",
        "JOHNSON AND JOHNSON  COM",
        "JOHNSON &JOHNSON COM USD1.00",
        "JOHNSON & JOHNSON",
        "JOHNSON JOHNSON W/D",
        "JOHNSON & JOHNSON INC.",
        "JOHNSON & JOHNSON (jnj)",
        "JOHNSON JOHNSON W D",
        "JOHNSON",
        "JOHNSON & JOHNSON              COM",
        "Johnson & CORP COMMON",
        "JOHNSON &amp; JOHNSON COM",
        "JOHNSON &amp;amp; JOHNSON COM",
        "JOHNSON & JOHNSON  COM",
        "Johnson & Johnson Inc.",
        "JOHNSON &amp;JOHNSON COM USD1.00",
        "Johnson & johnson",
        "Johnson & Johnson (JNJ)",
        "JOHNSON & JOHNSON            COM",
        "Johnson And Johnson",
        "JOHNSON & JOHNSON                   C",
        "JOHN. & JOHN.",
        "JOHNSON & JOHNSON COM USD1.00",
        "JOHNSON&JOHN",
        "JOHNSON & JOHNSON COMMON"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/200406/000020040624000013/jnj-20231231.htm",
    "item1": "Item 1. Business\n \n General\n Johnson & Johnson and its subsidiaries (the Company) have approximately 131,900 employees worldwide engaged in the research and development, manufacture and sale of a broad range of products in the healthcare field. Johnson & Johnson is a holding company, with operating companies conducting business in virtually all countries of the world. The Company's primary focus is products related to human health and well-being. Johnson & Johnson was incorporated in the State of New Jersey in 1887.\n The Executive Committee of Johnson & Johnson is the principal management group responsible for the strategic operations and allocation of the resources of the Company. This Committee oversees and coordinates the activities of the Company's two business segments: Innovative Medicine (previously referred to as Pharmaceutical) and MedTech. Within the strategic parameters provided by the Committee, senior management groups at U.S. and international operating companies are each responsible for their own strategic plans and the day-to-day operations of those companies. Each subsidiary within the business segments is, with limited exceptions, managed by residents of the country where located.\n Segments of business\n Following the completion of the separation of the Consumer Health business (Kenvue) in August 2023, the Company is now organized into two business segments: Innovative Medicine and MedTech. Additional information required by this item is incorporated herein by reference to the narrative and tabular descriptions of segments and operating results under: Item 7. Management's discussion and analysis of results of operations and financial condition of this Report; and Note 17 Segments of business and geographic areas of the notes to consolidated financial statements included in Item 8 of this Report.\n Innovative Medicine\n The Innovative Medicine segment is focused on the following therapeutic areas: Immunology (e.g., rheumatoid arthritis, psoriatic arthritis, inflammatory bowel disease and psoriasis), Infectious Diseases (e.g., HIV/AIDS), Neuroscience (e.g., mood disorders, neurodegenerative disorders and schizophrenia), Oncology (e.g., prostate cancer, hematologic malignancies, lung cancer and bladder cancer), Cardiovascular and Metabolism (e.g., thrombosis, diabetes and macular degeneration) and Pulmonary Hypertension (e.g., Pulmonary Arterial Hypertension). Medicines in this segment are distributed directly to retailers, wholesalers, distributors, hospitals and healthcare professionals for prescription use. Key products in the Innovative Medicine segment include: REMICADE (infliximab), a treatment for a number of immune-mediated inflammatory diseases; SIMPONI (golimumab), a subcutaneous treatment for adults with moderate to severe rheumatoid arthritis, active psoriatic arthritis, active ankylosing spondylitis and moderately active to severely active ulcerative colitis; SIMPONI ARIA (golimumab), an intravenous treatment for adults with moderate to severe rheumatoid arthritis, active psoriatic arthritis and active ankylosing spondylitis and active polyarticular juvenile idiopathic arthritis (pJIA) in people 2 years of age and older; STELARA (ustekinumab), a treatment for adults and children with moderate to severe plaque psoriasis, for adults with active psoriatic arthritis, for adults with moderately to severely active Crohn's disease and treatment of moderately to severely active ulcerative colitis; TREMFYA (guselkumab), a treatment for adults with moderate to severe plaque psoriasis and active psoriatic arthritis; EDURANT (rilpivirine), PREZISTA (darunavir) and PREZCOBIX/REZOLSTA (darunavir/cobicistat), antiretroviral medicines for the treatment of human immunodeficiency virus (HIV) in combination with other antiretroviral products and SYMTUZA (darunavir/cobicistat/emtricitabine/tenofovir alafenamide), a once-daily single tablet regimen for the treatment of HIV; CONCERTA (methylphenidate HCl) extended-release tablets CII, a treatment for attention deficit hyperactivity disorder; INVEGA SUSTENNA/XEPLION (paliperidone palmitate), for the treatment of schizophrenia and schizoaffective disorder in adults; INVEGA TRINZA/TREVICTA (paliperidone palmitate), for the treatment of schizophrenia in patients after they have been adequately treated with INVEGA SUSTENNA for at least four months; SPRAVATO (Esketamine), a nasal spray, used along with an oral antidepressant, to treat adults with treatment-resistant depression (TRD) and depressive symptoms in adults with major depressive disorder (MDD) with suicidal thoughts or actions; CARVYKTI (ciltacabtagene autoleucel), a chimeric antigen receptor (CAR)-T-cell therapy for the treatment of patients with relapsed/refractory multiple myeloma; ZYTIGA (abiraterone\n 2023 Annual Report1\n 2023 Annual Report\n 1\n acetate), a treatment for patients with prostate cancer; ERLEADA (apalutamide), a next-generation androgen receptor inhibitor for the treatment of patients with prostate cancer; IMBRUVICA (ibrutinib), a treatment for certain B-cell malignancies, or blood cancers and chronic graft versus host disease; DARZALEX (daratumumab), a treatment for multiple myeloma; DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), a treatment for multiple myeloma and light chain (AL) Amyloidosis; XARELTO (rivaroxaban), an oral anticoagulant for the prevention of deep vein thrombosis (DVT), which may lead to pulmonary embolism (PE) in patients undergoing hip or knee replacement surgery, to reduce the risk of stroke and systemic embolism in patients with nonvalvular atrial fibrillation, and for the treatment and reduction of risk of recurrence of DVT and PE to reduce the risk of major cardiovascular events in patients with coronary artery disease (CAD) and peripheral artery disease (PAD), for the treatment and secondary prevention of thromboembolism in pediatric patients, and for thromboprophylaxis in pediatric patients following the Fontan procedure; OPSUMIT (macitentan) as monotherapy or in combination, indicated for the long-term treatment of pulmonary arterial hypertension (PAH); UPTRAVI (selexipag), the only approved oral and intravenous, selective IP receptor agonist targeting a prostacyclin pathway in PAH. Many of these medicines were developed in collaboration with strategic partners or are licensed from other companies and maintain active lifecycle development programs.\n acetate), a treatment for patients with prostate cancer; ERLEADA (apalutamide), a next-\n generation androgen receptor inhibitor for the treatment of patients with prostate cancer; IMBRUVICA (ibrutinib), a treatment for certain B-cell malignancies, or blood cancers and chronic graft versus host disease; DARZALEX (daratumumab), a treatment for multiple myeloma; DARZALEX FASPRO (daratumumab and hyaluronidase-fihj), a treatment for multiple myeloma and light chain (AL) Amyloidosis; XARELTO (rivaroxaban), an oral anticoagulant for the prevention of deep vein thrombosis (DVT), which may lead to pulmonary embolism (PE) in patients undergoing hip or knee replacement surgery, to reduce the risk of stroke and systemic embolism in patients with nonvalvular atrial fibrillation, and for the treatment and reduction of risk of recurrence of DVT and PE to reduce the risk of major cardiovascular events in patients with coronary artery disease (CAD) and peripheral artery disease (PAD), for the treatment and secondary prevention of thromboembolism in pediatric patients, and for thromboprophylaxis in pediatric patients following the Fontan procedure; OPSUMIT (macitentan) as monotherapy or in combination, indicated for the long-term treatment of pulmonary arterial hypertension (PAH); UPTRAVI (selexipag), the only approved oral and intravenous, selective IP receptor agonist targeting a prostacyclin pathway in PAH. Many of these medicines were developed in collaboration with strategic partners or are licensed from other companies and maintain active lifecycle developm",
    "item1a": "Item 1A. Risk factors\n An investment in the Company's common stock or debt securities involves risks and uncertainties. The Company seeks to identify, manage and mitigate risks to our business, but uncertainties and risks are difficult to predict and many are outside of the Company's control and cannot therefore be eliminated. In addition to the other information in this report and the Company's other filings with the SEC, investors should consider carefully the factors set forth below. Investors should be aware that it is not possible to predict or identify all such factors and that the following is not meant to be a complete discussion of all potential risks or uncertainties. If known or unknown risks or uncertainties materialize, the Company's business, results of operations or financial condition could be adversely affected, potentially in a material way.\n Risks related to our business, industry and operations\n The Company's businesses operate in highly competitive product markets and competitive pressures could adversely affect the Company's earnings.\n The Company faces substantial competition in its two operating segments and in all geographic markets. The Company's businesses compete with companies of all sizes on the basis of cost-effectiveness, technological innovations, intellectual property rights, product performance, real or perceived product advantages, pricing and availability and rate of reimbursement. The Company also competes with other market participants in securing rights to acquisitions, collaborations and licensing agreements with third parties. Competition for rights to product candidates and technologies may result in significant investment and acquisition costs and onerous agreement terms for the Company. Competitors' development of more effective or less costly products, and/or their ability to secure patent and other intellectual property rights and successfully market products ahead of the Company, could negatively impact sales of the Company's existing products as well as its ability to bring new products to market despite significant prior investment in the related product development. The Company may also experience operational and financial risk in connection with acquisitions if we are unable to fully identify potential risks and liabilities associated with acquired businesses or products, successfully integrate operations and employees, and successfully identify and realize synergies with existing businesses while containing acquisition-related strain on our management, operations and financial resources.\n For the Company's Innovative Medicine businesses, loss of patent exclusivity for a product often is followed by a substantial reduction in sales as competitors gain regulatory approval for generic and other competing products and enter the market. Similar competition can be triggered by the loss of exclusivity for a biological product. For the Company's MedTech businesses, technological innovation, product quality, reputation and customer service are especially important to competitiveness. Development by other companies of new or improved products, processes and technologies could threaten to make the Company's products or technologies less desirable, less economical or obsolete. The Company's business and operations will be negatively impacted if we are unable to introduce new products or technological advances that are safe, more effective, more effectively marketed or otherwise outperform those of our competitors.\n Interruptions and delays in manufacturing operations could adversely affect the Company's business, sales and reputation.\n The Company's manufacturing of products requires the timely delivery of sufficient amounts of complex, high-quality components and materials. The Company's subsidiaries operate 61 manufacturing facilities as well as sourcing from thousands of suppliers around the world. The Company has in the past, and may in the future, face unanticipated interruptions and delays in manufacturing through its internal or external supply chain. Manufacturing disruptions can occur for many reasons including regulatory action, production quality deviations or safety issues, labor disputes, labor shortages, site-specific incidents (such as fires), natural disasters such as hurricanes and other severe weather events, raw material shortages, political unrest, terrorist attacks and epidemics or pandemics. Such delays and difficulties in manufacturing can result in product shortages, declines in sales and reputational impact as well as significant remediation and related costs associated with addressing the shortage.\n The Company relies on third parties to manufacture and supply certain of our products. Any failure by or loss of a third-party manufacturer or supplier could result in delays and increased costs, which may adversely affect our business.\n The Company relies on third parties to manufacture and supply certain of our raw materials, component parts and products. We depend on these third-party manufacturers to allocate to us a portion of their manufacturing capacity sufficient to meet our needs, to produce products of acceptable quality and at acceptable manufacturing yields and to deliver those products to us on a timely basis and at acceptable prices. However, we cannot guarantee that these third-party manufacturers will be able to meet our near-term or long-term manufacturing requirements, which could result in lost sales and have an adverse effect on our business.\n 2023 Annual Report9\n \n 2023 Annual Report\n 9\n Other risks associated with our reliance on third parties to manufacture these products include reliance on the third party for regulatory compliance and quality assurance, misappropriation of the Company's intellectual property, limited ability to manage our inventory, possible breach of the manufacturing agreement by the third party and the possible termination or nonrenewal of the manufacturing agreement by the third party at a time that is costly or inconvenient for us. Moreover, if any of our third-party manufacturers suffers any damage to facilities, loses benefits under material agreements, experiences power outages, encounters financial difficulties, is unable to secure necessary raw materials from its suppliers or suffers any other reduction in efficiency, the Company may experience significant business disruption. In the event of any such disruption, the Company would need to seek and source other qualified third-party manufacturers, likely resulting in further delays and increased costs which could affect our business adversely.\n Other risks associated with our reliance on third parties to manufacture these products include reliance on the third party for regulatory compliance and quality assurance, misappropriation of the Company's intellectual property, limited ability to manage our inventory, possible breach of the manufacturing agreement by the third party and the possible termination or nonrenewal of the manufacturing agreement by the third party at a time that is costly or inconvenient for us. Moreover, if any of our third-\n party manufacturers suffers any damage to facilities, loses benefits under material agreements, experiences power outages, encounters financial difficulties, is unable to secure necessary raw materials from its suppliers or suffers any other reduction in efficiency, the Company may experience significant business disruption. In the event of any such disruption, the Company would need to seek and source other qualified third-party manufacturers, likely resulting in further delays and increased costs which could affect our business adversely.\n Counterfeit versions of our products could harm our patients and have a negative impact on our revenues, earnings, reputation and business.\n Our industry continues to be challenged by the vulnerability of distribution channels to illegal counterfeiting and the presence of counterfeit products in a growing num",
    "item7": "Item 1B. Unresolved staff comments\n Not applicable.\n \n Item 1C. Cybersecurity\n Risk management and strategy\n The Company has documented cybersecurity policies and standards, assesses risks from cybersecurity threats, and monitors information systems for potential cybersecurity issues. To protect the Company's information systems from cybersecurity threats, the Company uses various security tools supporting protection, detection, and response capabilities. The Company maintains a cybersecurity incident response plan to help ensure a timely, consistent response to actual or attempted cybersecurity incidents impacting the Company.\n The Company also identifies and assesses third-party risks within the enterprise, and through the Company's use of third-party service providers, across a range of areas including data security and supply chain through a structured third-party risk management program.\n The Company maintains a formal information security training program for all employees that includes training on matters such as phishing and email security best practices. Employees are also required to complete mandatory training on data privacy.\n To evaluate and enhance its cybersecurity program, the Company periodically utilizes third-party experts to undertake maturity assessments of the Company's information security program.\n To date, the Company is not aware of any cybersecurity incident that has had or is reasonably likely to have a material impact on the Company's business or operations; however, because of the frequently changing attack techniques, along with the increased volume and sophistication of the attacks, there is the potential for the Company to be adversely impacted. This impact could result in reputational, competitive, operational or other business harm as well as financial costs and regulatory action. Refer to the risk factor captioned An information security incident, including a cybersecurity breach, could have a negative impact to the Company's business or reputation in Part I, Item 1A. Risk factors for additional description of cybersecurity risks and potential related impacts on the Company.\n Governance - management's responsibility\n The Company takes a risk-based approach to cybersecurity and has implemented cybersecurity controls designed to address cybersecurity threats and risks. The Chief Information Officer (CIO), who is a member of the Company's Executive Committee, and the Chief Information Security Officer (CISO) are responsible for assessing and managing cybersecurity risks, including the prevention, mitigation, detection, and remediation of cybersecurity incidents.\n The Company's CISO, in coordination with the CIO, is responsible for leading the Company's cybersecurity program and management of cybersecurity risk. The current CISO has over twenty-five years of experience in information security, and his background includes technical experience, strategy and architecture focused roles, cyber and threat experience, and various leadership roles.\n Governance - board oversight\n The Company's Board of Directors oversees the overall risk management process, including cybersecurity risks, directly and through its committees. The Regulatory Compliance & Sustainability Committee (RCSC) of the board is primarily responsible for oversight of risk from cybersecurity threats and oversees compliance with applicable laws, regulations and Company policies related to, among others, privacy and cybersecurity.\n RCSC meetings include discussions of specific risk areas throughout the year including, among others, those relating to cybersecurity. The CISO provides at least two updates each year to RCSC on cybersecurity matters. These reports include an overview of the cybersecurity threat landscape, key cybersecurity initiatives to improve the Company's risk posture, changes in the legal and regulatory landscape relative to cybersecurity, and overviews of certain cybersecurity incidents that have occurred within the Company and within the industry.\n 2023 Annual Report17\n 2023 Annual Report\n 17\n Item 2. Properties\n The Company's subsidiaries operate 61 manufacturing facilities occupying approximately 9.8 million square feet of floor space. The manufacturing facilities are used by the industry segments of the Company's business approximately as follows:SegmentSquare Feet(in thousands)Innovative Medicine5,026MedTech4,782Worldwide Total9,808\n The Company's subsidiaries operate 61 manufacturing facilities occupying approximately 9.8 million square feet of floor space. The manufacturing facilities are used by the industry segments of the Company's business approximately as follows:\n SegmentSquare Feet(in thousands)Innovative Medicine5,026MedTech4,782Worldwide Total9,808\n SegmentSquare Feet(in thousands)\n Segment\n Square Feet(in thousands)\n Innovative Medicine5,026\n Innovative Medicine\n 5,026\n MedTech4,782\n MedTech\n 4,782\n Worldwide Total9,808\n Worldwide Total\n 9,808\n Within the U.S., five facilities are used by the Innovative Medicine segment and 18 by the MedTech segment. Outside of the U.S., 13 facilities are used by the Innovative Medicine segment and 25 by the MedTech segment.\n The locations of the manufacturing facilities by major geographic areas of the world are as follows:\n Geographic AreaNumber ofFacilitiesSquare Feet(in thousands)United States232,973Europe204,900Western Hemisphere, excluding U.S.5692Africa, Asia and Pacific131,243Worldwide Total619,808\n Geographic AreaNumber ofFacilitiesSquare Feet(in thousands)\n Geographic Area\n Number ofFacilities\n United States232,973\n United States\n 23\n 2,973\n Europe204,900\n Europe\n 20\n 4,900\n Western Hemisphere, excluding U.S.5692\n Western Hemisphere, excluding U.S.\n 5\n 692\n Africa, Asia and Pacific131,243\n Africa, Asia and Pacific\n 13\n 1,243\n Worldwide Total619,808\n 61\n In addition to the manufacturing facilities discussed above, the Company maintains numerous office and warehouse facilities throughout the world.\n The Company's subsidiaries generally seek to own, rather than lease, their manufacturing facilities, although some, principally in non-U.S. locations, are leased. Office and warehouse facilities are often leased. The Company also engages contract manufacturers.\n The Company is committed to maintaining all of its properties in good operating condition.\n Segment information on additions to property, plant and equipment is contained in Note 17 Segments of business and geographic areas of the Notes to Consolidated Financial Statements included in Item 8 of this Report.\n Item 3. Legal proceedings\n The information called for by this item is incorporated herein by reference to the information set forth in Note 19 Legal proceedings of the Notes to Consolidated Financial Statements included in Item 8 of this Report.\n Item 4. Mine safety disclosures\n 18\n Executive officers of the registrant\n Listed below are the executive officers of the Company. There are no family relationships between any of the executive officers, and there is no arrangement or understanding between any executive officer and any other person pursuant to which the executive officer was selected. At the annual meeting of the Board of Directors, the executive officers are elected by the Board to hold office for one year and until their respective successors are elected and qualified, or until earlier resignation or removal.\n NameAgePositionVanessa Broadhurst55Member, Executive Committee; Executive Vice President, Global Corporate Affairs(a)Joaquin Duato61Chairman of the Board; Chief Executive Officer(b)Peter M. Fasolo, Ph.D.61Member, Executive Committee; Executive Vice President, Chief Human Resources Officer(c)Elizabeth Forminard53Member, Executive Committee; Executive Vice President, General Counsel(d)William N. Hait, M.D., Ph. D.74Member, Executive Committee; Executive Vice President, Chief External Innovation and Medical Officer(e)John C. Reed, M.D., Ph.D.65Member, Executive Committee; Executive Vice President, Innovative Medi",
    "item7a": "Item 7A. Quantitative and qualitative disclosures about market risk\n The information called for by this item is incorporated herein by reference to Item 7. Management's discussion and analysis of results of operations and financial condition - Liquidity and capital resources - Financing and market risk of this Report; and Note 1 Summary of significant accounting policies - Financial instruments of the Notes to Consolidated Financial Statements included in Item 8 of this Report.\n 42\n \n"
}