{
    "cik": 1326801,
    "cusip6": "30303M",
    "cusip": [
        "30303M102"
    ],
    "names": [
        "META PLATFORMS"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1326801/000132680124000012/meta-20231231.htm",
    "item1": "Item 1.Business\n Item 1.\n Business\n \n Overview\n Our mission is to give people the power to build community and bring the world closer together.\n All of our products, including our apps, share the vision of helping to bring the metaverse to life. We build technology that helps people connect and share, find communities, and grow businesses. Our products enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality (VR) and mixed reality (MR) headsets, and wearables. We also help people discover and learn about what is going on in the world around them, enable people to share their experiences, ideas, photos and videos, and other activities with audiences ranging from their closest family members and friends to the public at large, and stay connected everywhere by accessing our products. Meta is moving our offerings beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the metaverse, which we believe is the next evolution in social technology. Our vision for the metaverse does not center on any single product, but rather an entire ecosystem of experiences, devices, and new technologies. While the metaverse is in the very early stages of its development, we believe it will become the next computing platform and the future of social interaction. Across our work, we are innovating in artificial intelligence (AI) technologies to build new experiences that help make our platform more social, useful, and immersive.\n We report financial results for two segments: Family of Apps (FoA) and Reality Labs (RL). Currently, we generate substantially all of our revenue from selling advertising placements on our family of apps to marketers, which is reflected in FoA. Ads on our platform enable marketers to reach people across a range of marketing objectives, such as generating leads or driving awareness. Marketers purchase ads that can appear in multiple places including on Facebook, Instagram, Messenger, and third-party applications and websites. RL generates revenue from sales of consumer hardware products, software, and content.\n We invest in our business based on our company priorities. In 2024, we intend to focus on six key investment areas: AI, the metaverse, our discovery engine, monetization of our products and services, regulatory readiness, and enhancing developer efficiency to build, iterate, and optimize products quickly. Our AI investments support initiatives across our products and services, helping power the systems that rank content in our apps, our discovery engine that recommends relevant content, the tools advertisers use to reach customers, the development of new generative AI experiences, and the tools that make our product development more efficient and productive.\n The majority of our investments are directed toward developing our family of apps. In 2023, 80% of our total costs and expenses were recognized in FoA and 20% were recognized in RL. Our FoA investments were $70.13 billion in 2023 and include expenses relating to headcount, data centers and technical infrastructure as part of our efforts to develop our apps and our advertising services. We are also making significant investments in our metaverse efforts, including developing virtual and augmented reality devices, software for social platforms, neural interfaces, and other foundational technologies. Our total RL investments were $18.02 billion in 2023 and include expenses relating to headcount and technology development across these efforts. These are fundamentally new technologies that we expect will evolve as the metaverse ecosystem develops, and many products for the metaverse may only be fully realized in the next decade. Although it is inherently difficult to predict when and how the metaverse ecosystem will develop, we expect our RL segment to continue to operate at a loss for the foreseeable future, and our ability to support our metaverse efforts is dependent on generating sufficient profits from other areas of our business. We expect this will be a complex, evolving, and long-term initiative. We are investing now because we believe this is the next chapter of the internet and will unlock monetization opportunities for businesses, developers, and creators, including around advertising, hardware, and digital goods.\n Family of Apps Products\n \"Facebook.Facebook helps give people the power to build community and bring the world closer together. It's a place for people to share life's moments and discuss what's happening, nurture and build relationships, discover and connect to interests, and create economic opportunity. They can do this through Feed, Reels, Stories, Groups, Marketplace, and more.\n \"\n Facebook.\n Facebook helps give people the power to build community and bring the world closer together. It's a place for people to share life's moments and discuss what's happening, nurture and build relationships, discover and connect to interests, and create economic opportunity. They can do this through Feed, Reels, Stories, Groups, Marketplace, and more.\n 7\n Table ofContents\n Table of\n Contents\n \"Instagram.Instagram brings people closer to the people and things they love. Instagram Feed, Stories, Reels, Live, and messaging are places where people and creators can connect and express themselves through photos, video, and private messaging, and discover and shop from their favorite businesses.\n Instagram.\n Instagram brings people closer to the people and things they love. Instagram Feed, Stories, Reels, Live, and messaging are places where people and creators can connect and express themselves through photos, video, and private messaging, and discover and shop from their favorite businesses.\n \"Messenger.Messenger is a simple yet powerful messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls.\n Messenger.\n Messenger is a simple yet powerful messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls.\n \"Threads.Threads is an application for text-based updates and public conversations, where communities come together to discuss topics of interest. People can connect directly with their favorite creators and others who love the same things or build a loyal following of their own to share their ideas, opinions, and creativity with the world.\n Threads.\n Threads is an application for text-based updates and public conversations, where communities come together to discuss topics of interest. People can connect directly with their favorite creators and others who love the same things or build a loyal following of their own to share their ideas, opinions, and creativity with the world.\n \"WhatsApp.WhatsApp is a simple, reliable, and secure messaging application that is used by people and businesses around the world to communicate and transact in a private way. Within WhatsApp we launched WhatsApp Channels, a one-to-many broadcast service designed to help people follow information from people and organizations that are important to them.\n WhatsApp.\n WhatsApp is a simple, reliable, and secure messaging application that is used by people and businesses around the world to communicate and transact in a private way. Within WhatsApp we launched WhatsApp Channels, a one-to-many broadcast service designed to help people follow information from people and organizations that are important to them.\n Reality Labs Products\n Many of our metaverse investments are directed toward long-term, cutting-edge research and development for products that are not on the market today and may only be fully realized in the next decade. This includes exploring new technologies such as neural interfaces using electromyography, which lets people control their devices using neuromuscular signals, as well as innovations in AI and ",
    "item1a": "Item 1A.Risk Factors\n Item 1A.\n Risk Factors\n \n Certain factors may have a material adverse effect on our business, financial condition, and results of operations. You should consider carefully the risks and uncertainties described below, in addition to other information contained in this Annual Report on Form 10-K, including our consolidated financial statements and related notes. The risks and uncertainties described below are not the only ones we face. Additional risks and uncertainties that we are unaware of, or that we currently believe are not material, may also become important factors that adversely affect our business. If any of the following risks actually occurs, our business, financial condition, results of operations, and future prospects could be materially and adversely affected. In that event, the trading price of our Class A common stock could decline, and you could lose part or all of your investment.\n Summary Risk Factors\n Our business is subject to a number of risks, including risks that may prevent us from achieving our business objectives or may adversely affect our business, financial condition, results of operations, cash flows, and prospects. These risks are discussed more fully below and include, but are not limited to, risks related to:\n Risks Related to Our Product Offerings\n \"our ability to add and retain users and maintain levels of user engagement with our products;\n \"\n our ability to add and retain users and maintain levels of user engagement with our products;\n \"the loss of, or reduction in spending by, our marketers;\n the loss of, or reduction in spending by, our marketers;\n \"reduced availability of data signals used by our ad targeting and measurement tools;\n reduced availability of data signals used by our ad targeting and measurement tools;\n \"ineffective operation with mobile operating systems or changes in our relationships with mobile operating system partners;\n ineffective operation with mobile operating systems or changes in our relationships with mobile operating system partners;\n \"failure of our new products, or changes to our existing products, to attract or retain users or generate revenue;\n failure of our new products, or changes to our existing products, to attract or retain users or generate revenue;\n Risks Related to Our Business Operations and Financial Results\n \"our ability to compete effectively;\n our ability to compete effectively;\n \"fluctuations in our financial results;\n fluctuations in our financial results;\n \"unfavorable media coverage and other risks affecting our ability to maintain and enhance our brands;\n unfavorable media coverage and other risks affecting our ability to maintain and enhance our brands;\n \"our ability to build, maintain, and scale our technical infrastructure, and risks associated with disruptions in our service, catastrophic events, and crises;\n our ability to build, maintain, and scale our technical infrastructure, and risks associated with disruptions in our service, catastrophic events, and crises;\n \"operating our business in multiple countries around the world;\n operating our business in multiple countries around the world;\n \"acquisitions and our ability to successfully integrate our acquisitions;\n acquisitions and our ability to successfully integrate our acquisitions;\n \"litigation, including class action lawsuits;\n litigation, including class action lawsuits;\n Risks Related to Government Regulation and Enforcement\n \"government restrictions on access to Facebook or our other products, or other actions that impair our ability to sell advertising, in their countries;\n government restrictions on access to Facebook or our other products, or other actions that impair our ability to sell advertising, in their countries;\n \"complex and evolving U.S. and foreign privacy, data use and data protection, content, competition, consumer protection, and other laws and regulations, including the General Data Protection Regulation (GDPR), Digital Markets Act (DMA), and Digital Services Act (DSA);\n complex and evolving U.S. and foreign privacy, data use and data protection, content, competition, consumer protection, and other laws and regulations, including the General Data Protection Regulation (GDPR), Digital Markets Act (DMA), and Digital Services Act (DSA);\n 15\n Table ofContents\n Table of\n Contents\n \"the impact of government investigations, enforcement actions, and settlements, including litigation and investigations by privacy, consumer protection, and competition authorities;\n the impact of government investigations, enforcement actions, and settlements, including litigation and investigations by privacy, consumer protection, and competition authorities;\n \"our ability to comply with regulatory and legislative privacy requirements, including our consent order with the Federal Trade Commission (FTC);\n our ability to comply with regulatory and legislative privacy requirements, including our consent order with the Federal Trade Commission (FTC);\n Risks Related to Data, Security, Platform Integrity, and Intellectual Property\n \"the occurrence of security breaches, improper access to or disclosure of our data or user data, and other cyber incidents, as well as intentional misuse of our services and other undesirable activity on our platform;\n the occurrence of security breaches, improper access to or disclosure of our data or user data, and other cyber incidents, as well as intentional misuse of our services and other undesirable activity on our platform;\n \"our ability to obtain, maintain, protect, and enforce our intellectual property rights; and\n our ability to obtain, maintain, protect, and enforce our intellectual property rights; and\n Risks Related to Ownership of Our Class A Common Stock\n \"limitations on the ability of holders of our Class A Common Stock to influence corporate matters due to the dual class structure of our common stock and the control of a majority of the voting power of our outstanding capital stock by our founder, Board Chair, and Chief Executive Officer (CEO).\n limitations on the ability of holders of our Class A Common Stock to influence corporate matters due to the dual class structure of our common stock and the control of a majority of the voting power of our outstanding capital stock by our founder, Board Chair, and Chief Executive Officer (CEO).\n If we fail to retain existing users or add new users, or if our users decrease their level of engagement with our products, our revenue, financial results, and business may be significantly harmed.\n The size of our active user base and our users' level of engagement across our products are critical to our success. Our financial performance has been and will continue to be significantly determined by our success in adding, retaining, and engaging active users of our products that deliver ad impressions, particularly for Facebook and Instagram. We have experienced, and expect to continue to experience, fluctuations and declines in the size of our active user base in one or more markets from time to time, particularly in markets where we have achieved higher penetration rates. User growth and engagement are also impacted by a number of other factors, including competitive products and services, such as TikTok, that have reduced some users' engagement with our products and services, as well as global and regional business, macroeconomic, and geopolitical conditions. For example, the COVID-19 pandemic led to increases and decreases in the size and engagement of our active user base from period to period at different points during the pandemic. In addition, in connection with the war in Ukraine, access to Facebook and Instagram was restricted in Russia and these services were then prohibited by the Russian government, which contributed to slight decreases in the size of our active user base following the onset of the war. Any future declines in the size of our active user base may adversely impact our ability to deliv",
    "item7": "Item 7.Management's Discussion and Analysis of Financial Condition and Results of Operations\n Item 7.\n Management's Discussion and Analysis of Financial Condition and Results of Operations\n \n You should read the following discussion of our financial condition and results of operations in conjunction with our consolidated financial statements and the related notes included in Part II, Item 8, \"Financial Statements and Supplementary Data\" of this Annual Report on Form 10-K. In addition to our historical consolidated financial information, the following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to these differences include those discussed below and elsewhere in this Annual Report on Form 10-K, particularly in Part I, Item 1A, \"Risk Factors.\" For a discussion of limitations in the measurement of certain of our community metrics, see the section entitled \"Limitations of Key Metrics and Other Data\" in this Annual Report on Form 10-K.\n To supplement our consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (GAAP), we present revenue on a constant currency basis and free cash flow, which are non-GAAP financial measures. Revenue on a constant currency basis is presented in the section entitled \"RevenueForeign Exchange Impact on Revenue.\" To calculate revenue on a constant currency basis, we translated revenue for the full year 2023 using 2022 monthly exchange rates for our settlement or billing currencies other than the U.S. dollar. For a full description of our free cash flow non-GAAP measure, see the section entitled \"Liquidity and Capital Resources Free Cash Flow.\"\n To supplement our consolidated financial statements, which are prepared and presented in accordance with generally accepted accounting principles in the United States (GAAP), we present revenue on a constant currency basis and free cash flow, which are non-GAAP financial measures. Revenue on a constant currency basis is presented in the section entitled \"\n Revenue\n Foreign Exchange Impact on Revenue.\" To calculate revenue on a constant currency basis, we translated revenue for the full year 2023 using 2022 monthly exchange rates for our settlement or billing currencies other than the U.S. dollar. For a full description of our free cash flow non-GAAP measure, see the section entitled \"\n Liquidity and Capital Resources Free Cash Flow.\"\n These non-GAAP financial measures are not intended to be considered in isolation or as a substitute for, or superior to, financial information prepared and presented in accordance with GAAP. These measures may be different from non‑GAAP financial measures used by other companies, limiting their usefulness for comparison purposes. Moreover, presentation of revenue on a constant currency basis is provided for year-over-year comparison purposes, and investors should be cautioned that the effect of changing foreign currency exchange rates has an actual effect on our operating results. We believe these non-GAAP financial measures provide investors with useful supplemental information about the financial performance of our business, enable comparison of financial results between periods where certain items may vary independent of business performance, and allow for greater transparency with respect to key metrics used by management in operating our business.\n Executive Overview of Full Year 2023 Results\n Our mission is to give people the power to build community and bring the world closer together.\n Our financial results and key community metrics for 2023 are set forth below. Our total revenue for 2023 was $134.90 billion, an increase of 16% compared to 2022, due to an increase in advertising revenue. Revenue on a constant currency basis would have increased 15% compared to 2022. Ad impressions delivered across our Family of Apps increased 28% year-over-year in 2023, partially offset by a 9% year-over-year decrease in the average price per ad.\n Income from operations for 2023 was $46.75 billion, an increase of $17.81 billion, or 62%, compared to 2022, driven by an increase in advertising revenue.\n 59\n Table ofContents\n Table of\n Contents\n Consolidated and Segment Results\n We report our financial results for our two reportable segments: Family of Apps (FoA) and Reality Labs (RL). FoA includes Facebook, Instagram, Messenger, WhatsApp, and other services. RL includes our augmented, mixed and virtual reality related consumer hardware, software, and content.\n Family of AppsReality LabsTotalYear EndedDecember 31,Year EndedDecember 31,Year EndedDecember 31,20232022% change20232022% change20232022% change(in millions, except percentages)Revenue$133,006$114,45016%$1,896$2,159(12)%$134,902$116,60916%Costs and expenses$70,135$71,789(2)%$18,016$15,87613%$88,151$87,6651%Income (loss) from operations$62,871$42,66147%$(16,120)$(13,717)(18)%$46,751$28,94462%Operating margin47%37%(850)%(635)%35%25%\n Family of AppsReality LabsTotal\n Family of Apps\n Reality Labs\n Total\n Year EndedDecember 31,Year EndedDecember 31,Year EndedDecember 31,\n Year EndedDecember 31,\n 20232022% change20232022% change20232022% change\n 2023\n 2022\n % change\n (in millions, except percentages)\n Revenue$133,006$114,45016%$1,896$2,159(12)%$134,902$116,60916%\n $\n 133,006\n 114,450\n 16%\n 1,896\n 2,159\n (12)%\n 134,902\n 116,609\n Costs and expenses$70,135$71,789(2)%$18,016$15,87613%$88,151$87,6651%\n Costs and expenses\n 70,135\n 71,789\n (2)%\n 18,016\n 15,876\n 13%\n 88,151\n 87,665\n 1%\n Income (loss) from operations$62,871$42,66147%$(16,120)$(13,717)(18)%$46,751$28,94462%\n Income (loss) from operations\n 62,871\n 42,661\n 47%\n (16,120)\n (13,717)\n (18)%\n 46,751\n 28,944\n 62%\n Operating margin47%37%(850)%(635)%35%25%\n Operating margin\n 47\n %\n 37\n (850)\n (635)\n 35\n 25\n \"Net income was $39.10 billion, with diluted earnings per share (EPS) of $14.87 for the year ended December 31, 2023.\n \"\n Net income was $39.10 billion, with diluted earnings per share (EPS) of $14.87 for the year ended December 31, 2023.\n \"Capital expenditures, including principal payments on finance leases, were $28.10 billion for the year ended December 31, 2023.\n Capital expenditures, including principal payments on finance leases, were $28.10 billion for the year ended December 31, 2023.\n \"Effective tax rate was 17.6% for the year ended December 31, 2023.\n Effective tax rate was 17.6% for the year ended December 31, 2023.\n \"Cash, cash equivalents, and marketable securities were $65.40 billion as of December 31, 2023.\n Cash, cash equivalents, and marketable securities were $65.40 billion as of December 31, 2023.\n \"Long-term debt was $18.39 billion as of December 31, 2023.\n Long-term debt was $18.39 billion as of December 31, 2023.\n \"Headcount was 67,317 as of December 31, 2023, a decrease of 22% year-over-year.\n Headcount was 67,317 as of December 31, 2023, a decrease of 22% year-over-year.\n Dividend\n Prior to 2024, we had never declared or paid any cash dividend on our common stock. On February 1, 2024 we announced the initiation of our first ever cash dividend program. This cash dividend of $0.50 per share of Class A common stock and Class B common stock (together, the \"common stock\") is equivalent to $2.00 per share on an annual basis. The first cash dividend will be paid on March 26, 2024 to all holders of record of common stock at the close of business on February 22, 2024.\n 60\n Restructuring\n Beginning in 2022, we initiated several measures to pursue greater efficiency and to realign our business and strategic priorities. As of December 31, 2023, we have completed the data center initiatives and the employee layoffs, and substantially completed the facilities consolidation initiatives.\n A summary of our restructuring charges, including subsequent adjustments, for the year ended Dece",
    "item7a": "Item 7A.Quantitative and Qualitative Disclosures About Market Risk\n Item 7A.\n Quantitative and Qualitative Disclosures About Market Risk\n \n We are exposed to market risks, including changes to foreign currency exchange rates, interest rates, and equity price risk.\n Foreign Currency Exchange Risk\n We have foreign currency risks related to our revenue and operating expenses denominated in currencies other than the U.S. dollar, primarily the Euro. Accordingly, changes in exchange rates, and in particular a strengthening of the U.S. dollar, have in the past, and may in the future, negatively affect our revenue and other operating results as expressed in U.S. dollars. See Management's Discussion and Analysis of Financial Condition and Results of Operations   Foreign Exchange Impact on Revenue section included in Part II, Item 7 of this Annual Report on Form 10-K for additional information.\n We have experienced and will continue to experience fluctuations in our net income as a result of transaction gains or losses related to remeasuring monetary asset and liability balances that are denominated in currencies other than the functional currency of the entities in which they are recorded. At this time, we have not entered into, but in the future we may enter into, derivatives or other financial instruments in an attempt to hedge our foreign currency exchange risk. It is difficult to predict the effect hedging activities would have on our results of operations. Foreign currency exchange net losses of $366 million, $81 million, and $140 million were recognized in 2023, 2022, and 2021, respectively.\n Interest Rate Sensitivity\n Our exposure to changes in interest rates relates primarily to interest income and market value of our cash equivalents, marketable debt securities, and the fair value of our long-term debt.\n Our cash, cash equivalents, and marketable debt securities consist of cash, time deposits, money market funds, U.S. government securities, U.S. government agency securities, and investment grade corporate debt securities. Our investment policy and strategy are focused on preservation of capital and supporting our liquidity requirements. Changes in U.S. interest rates affect the interest earned on our cash, cash equivalents, and marketable securities, and the market value of those securities. A hypothetical 100 basis point increase in market interest rates would have resulted in a decrease of $355 million and $558 million in the market value of our available-for-sale debt securities and cash equivalents as of December 31, 2023 and 2022, respectively. Any realized gains or losses resulting from such interest rate changes and from the current unrealized gains or losseswould only occur if we sold the investments prior to maturity.\n Our cash, cash equivalents, and marketable debt securities consist of cash, time deposits, money market funds, U.S. government securities, U.S. government agency securities, and investment grade corporate debt securities. Our investment policy and strategy are focused on preservation of capital and supporting our liquidity requirements. Changes in U.S. interest rates affect the interest earned on our cash, cash equivalents, and marketable securities, and the market value of those securities. A hypothetical 100 basis point increase in market interest rates would have resulted in a decrease of $355 million and $558 million in the market value of our available-for-sale debt securities and cash equivalents as of December 31, 2023 and 2022, respectively. Any realized gains or losses resulting from such interest rate changes and from the current unrealized gains or losses\n would only occur if we sold the investments prior to maturity.\n As of December 31, 2023 and 2022, we also had aggregate principal amounts of fixed-rate senior notes (the Notes) outstanding of $18.50 billion and $10.00 billion, respectively. Since our Notes bear interest at fixed rates and are carried at amortized cost, fluctuations in interest rates do not have any impact on our consolidated financial statements. However, the fair value of the Notes will fluctuate with movements in market interest rates, increasing in periods of declining interest rates and declining in periods of increasing interest rates.\n 82\n Table ofContents\n Table of\n Contents\n Equity Price Risk\n Our equity investments are in non-marketable equity securities and are subject to equity price risks that could have a material impact on the carrying value of our holdings.\n Our non-marketable equity securities are investments in privately-held companies without readily determinable fair values. We elected to account for substantially all of our non-marketable equity securities using the measurement alternative, which is cost, less any impairment, adjusted for changes in fair value resulting from observable transactions for identical or similar investments of the same issuer. We perform a qualitative assessment at each reporting date to determine whether there are triggering events for impairment. The qualitative assessment considers factors such as, but not limited to, the investee's financial condition and business outlook; industry and sector performance; economic or technological environment; and other relevant events and factors affecting the investee. Valuations of our non-marketable equity securities are complex due to the lack of readily available market data and observable transactions. Uncertainties in the global economic climate and financial markets could adversely impact the valuation of these companies we invest in and, therefore, result in a material impairment or downward adjustment in our investments. Our total non-marketable equity securities, which mostly consists of our investment in Jio Platforms Limited, had a carrying value of $6.14 billion and $6.20 billion as of December 31, 2023 and 2022, respectively.\n For additional information, see Note 1   Summary of Significant Accounting Policies, Note 5   Financial Instruments, Note 6   Non-marketable Equity Securities, and Note 10   Long-term Debt in the notes to the consolidated financial statements included in Part II, Item 8, \"Financial Statements and Supplementary Data\" and Part II, Item 7, \"Management's Discussion and Analysis of Financial Conditions and Results of Operations   Critical Accounting Estimates\" contained in this Annual Report on Form 10-K.\n 83\n"
}