{
    "cik": 1065280,
    "cusip6": "64110L",
    "cusip": [
        "64110L106"
    ],
    "names": [
        "NETFLIX INC COM"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1065280/000106528024000030/nflx-20231231.htm",
    "item1": "Item 1.Business\n Item 1.\n Business\n ABOUT US\n Netflix, Inc. (\"Netflix\", \"the Company\", \"registrant\", \"we\", or \"us\") is one of the world's leading entertainment services with over 260 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n Our core strategy is to grow our business globally within the parameters of our operating margin target.  We strive to  continuously improve our members' experience by offering compelling content that delights them and attracts new members.  We seek to drive conversation around our content to further enhance member joy, and we are continuously enhancing our user interface to help our members more easily choose content that they will find enjoyable.\n \n BUSINESS SEGMENTS\n We operate as one operating segment.  Our revenues are primarily derived from monthly membership fees for services related to streaming content to our members.  See Note 12,Segment and Geographic Information, in the accompanying notes to our consolidated financial statements for further detail.\n We operate as one operating segment.  Our revenues are primarily derived from monthly membership fees for services related to streaming content to our members.  See Note 12,\n Segment and Geographic Information\n , in the accompanying notes to our consolidated financial statements for further detail.\n COMPETITION\n The market for entertainment video is intensely competitive and subject to rapid change.  We compete with a broad set of activities for consumers' leisure time, including other entertainment video providers, such as linear TV, streaming entertainment providers (including those that provide pirated content), video gaming providers and more broadly against other sources of entertainment, like social media, that our members could choose in their moments of free time.  We also compete against entertainment video providers and content producers in obtaining content for our service, both for licensed content and for original content projects.\n While consumers may maintain simultaneous relationships with multiple entertainment sources, we strive for consumers to choose us in their moments of free time.  We have often referred to this choice as our objective of \"winning moments of truth.\"  In attempting to win these moments of truth with our members, we seek to continually improve our service, including both our technology and our content offerings.\n SEASONALITY\n 1\n Table of Contents\n Our membership growth exhibits a seasonal pattern that reflects variations when consumers buy internet-connected screens and when they tend to increase their viewing.  Historically, the fourth quarter represents our greatest streaming membership growth.  In addition, our membership growth can be impacted by our content release schedule and changes to pricing and plans.\n INTELLECTUAL PROPERTY\n We regard our trademarks, service marks, copyrights, patents, domain names, trade dress, trade secrets, proprietary technologies and similar intellectual property as important to our success.  We use a combination of patent, trademark, copyright and trade secret laws and confidentiality agreements to protect our proprietary intellectual property.  Our intellectual property rights extend to our technology, business processes and the content we produce and distribute through our service.  We use the intellectual property of third parties in creating some of our content, merchandising our products and marketing our service. Our ability to provide our members with content they can watch depends on studios, content providers and other rights holders licensing rights, including distribution rights, to such content and certain related elements thereof, such as the public performance of music contained within the content we distribute.  The license periods and the terms and conditions of such licenses vary.  Our ability to protect and enforce our intellectual property rights is subject to certain risks and from time to time we encounter disputes over rights and obligations concerning intellectual property.  We cannot provide assurance that we will prevail in any intellectual property disputes.\n REGULATION\n The media landscape and the internet delivery of content have seen growing regulatory action.  Historically, media has been highly regulated in many countries.  We are seeing some of these legacy regulatory frameworks be updated and expanded to address services like ours.  In particular, we are seeing some countries update their cultural support legislation to include services like Netflix.  This includes content quotas, levies and investment obligations.  Some even restrict the extent of ownership rights we can have both in our service and in our content.  In certain countries, regulators are also looking at restrictions that could require formal reviews of and/or adjustments to content that appears on our service in their country. In general these regulations impact all services and may make operating in certain jurisdictions more expensive or restrictive as to the content offerings we may provide.\n HUMAN CAPITAL\n We view our employees and our culture as key to our success.  As of December 31, 2023, we had approximately 13,000 full-time employees.  Of these, approximately 9,000 (69%) were located in the United States and Canada, 2,000 (15%) in Europe, Middle East, and Africa, 500 (4%) in Latin America and 1,500 (12%) in Asia-Pacific.  We also have a number of employees engaged in content production, some of whom are part-time or temporary, and whose numbers fluctuate throughout the year.  We believe a critical component of our success is our company culture.  This culture, which is detailed in a \"Culture Memo\" located on our website, is often described as providing a unique environment for our associates to perform the best work of their lives in pursuit of excellence.  We aim to attract and retain great people - representing a diverse array of perspectives and skills - to work together as a dream team.  We empower all of our employees so that they can have significant impact and input into decision-making; each employee has a high degree of freedom and power to make the decisions and take actions in the best interest of the company in carrying out their role.  In return, our employees are responsible and accountable for those decisions and actions.  With this approach, we believe we are a more flexible, fun, stimulating, creative, collaborative and successful organization.\n As we have expanded our offices globally, our company culture remains an important aspect of our operations.  We are mindful of cultural differences across and within regions.  Fostering a work environment that is culturally diverse, inclusive and equitable is a major focus for us.  We work to build diversity, inclusion and equity into all aspects of our operations globally, with the goal of having diversity and inclusion function as a critical lens through which each Netflix employee carries out their role.  We want more people and cultures to see themselves reflected on screen - so it's important that our employee base is diverse and represents the communities we serve. We look to help increase representation by training our recruiters on how to hire more inclusively, and to help the company and senior leaders diversify their networks. We also support numerous employee resource groups (ERGs), representing employees and allies from a broad array of historically underrepresented and/or marginalized communities.  We publish annually an update on our inclusion initiatives and progress, which further highlights our approach to diversity and inclusion, and publish our EEO-1 reports on our website.\n We believe in fostering great leaders.  We offer programs, such as seminars and lectures, that are designed to equip our leaders (off",
    "item1a": "Item 1A.Risk Factors\n Item 1A.\n Risk Factors\n \n If any of the following risks actually occur, our business, financial condition and results of operations could be harmed.  In that case, the trading price of our common stock could decline, and you could lose all or part of your investment.\n Risks Related to Our Business\n If our efforts to attract and retain members are not successful, our business will be adversely affected.\n We must continually add new members both to replace canceled memberships and to grow our business beyond our current membership base. Our penetration and growth rates have fluctuated and vary across the jurisdictions where we provide our service.  In countries where we have been operating for many years or where we are highly penetrated, our membership growth is slower than in newer or less penetrated countries. Our ability to continue to attract and retain members will depend in part on our ability to consistently provide our members in countries around the globe with compelling content choices that keep our members engaged with our service, effectively drive conversation around our content and service, as well as provide a quality experience for choosing and enjoying TV series, films and games.  Furthermore, the relative service levels, content offerings, pricing and related features of competitors to our service may adversely impact our ability to attract and retain members.  Competitors include other entertainment video providers, such as linear television, and streaming entertainment providers (including those that provide pirated content), video gaming providers, as well as user-generated content, and more broadly other sources of entertainment that our members could choose in their moments of free time.\n Members cancel our service for many reasons, including a perception that they do not use the service sufficiently, that they need to cut household expenses, dissatisfaction with content, a preference for competitive services and customer service issues that they believe are not satisfactorily resolved.  Membership growth is also impacted by seasonality, with the fourth quarter historically representing our greatest growth, as well as the timing of our content release schedules.  Adverse macroeconomic conditions, including inflation, may also adversely impact our ability to attract and retain members. If we do not grow as expected, given, in particular, that our content costs are largely fixed in nature, we may not be able to adjust our expenditures or increase our (per membership) revenues, including by adjusting membership pricing, commensurate with the lowered growth rate such that our margins, liquidity and results of operations may be adversely impacted.  If we are unable to successfully compete with current and new competitors in providing compelling content, retaining our existing members and attracting new members, our business will be adversely affected.\n If we do not continuously provide value to our members, including making improvements to our service in a manner that is favorably received by them, our revenue, results of operations and business will be adversely affected.\n If consumers do not perceive our service offering to be of value, including if we introduce new or adjust existing features, adjust pricing or service offerings, or change the mix of content in a manner that is not favorably received by them, we may not be able to attract and retain members, and accordingly, our revenue, including revenue per paying membership, and results of operations may be adversely affected.  We have recently expanded our entertainment video offering to include games. If our efforts to develop and offer games are not valued by our current and future members, our ability to attract and retain members may be negatively impacted. We may also seek to extend our business into new products and services to help drive growth.  For example, we are expanding our offering of consumer products and live experiences. To the extent we cannot successfully find and develop new products and services to help drive growth, our future results of operations and growth may be adversely impacted.\n We have and may, from time to time, adjust our membership pricing, our membership plans, or our pricing model itself.  For example, we  introduced a new, lower-priced ad-supported subscription plan.  Similarly, we have increased enforcement of and will continue to enforce our terms of use to limit multi-household usage and shared viewing outside of a household. These and other adjustments we make may not be well-received by consumers, and could negatively impact our ability to attract and retain members, revenues per paying membership, revenue and our results of operations. In addition, many of our members rejoin our service or originate from word-of-mouth advertising from existing members.  If our efforts to satisfy our existing members or adjustments to our service are not successful, we may not be able to attract or retain members, and as a result, our ability to maintain and/or grow our business will be adversely affected.\n Changes in competitive offerings for entertainment video could adversely impact our business.\n The market for entertainment is intensely competitive and subject to rapid change.  Through new and existing distribution channels, consumers have increasing options to access entertainment video.  The various economic models underlying these channels include subscription, transactional, ad-supported and piracy-based models.  All of these have the potential to capture\n 4\n Table of Contents\n meaningful segments of the entertainment video market.  Traditional providers of entertainment video, including broadcasters and cable network operators, as well as internet based e-commerce or entertainment video providers are increasing their streaming video offerings.  Several of these competitors have long operating histories, large customer bases, strong brand recognition, exclusive rights to certain content, large content libraries, and significant financial, marketing and other resources.  They may offer more compelling content or secure better terms from suppliers, adopt more aggressive pricing and devote more resources to product development, technology, infrastructure, content acquisitions and marketing.  New entrants may enter the market or existing providers may adjust their services with unique offerings or approaches to providing entertainment video.  In addition, new technological developments, including the development and use of generative artificial intelligence, are rapidly evolving. If our competitors gain an advantage by using such technologies, our ability to compete effectively and our results of operations could be adversely impacted. Companies also may enter into business combinations or alliances that strengthen their competitive positions.  Piracy also threatens to damage our business, as its fundamental proposition to consumers is so compelling and difficult to compete against: virtually all content for free. In light of the compelling consumer proposition, piracy services are subject to rapid global growth, and our efforts to prevent that growth may be insufficient. If we are unable to successfully or profitably compete with current and new competitors, our business will be adversely affected, and we may not be able to increase or maintain market share, revenues or profitability.\n We face risks, such as unforeseen costs and potential liability in connection with content we acquire, produce, license and/or distribute through our service.\n As a producer and distributor of content, we face potential liability for negligence, copyright and trademark infringement, or other claims based on the nature and content of materials that we acquire, produce, license and/or distribute.  We also may face potential liability for content used in promoting our service, including marketing materials.  We devote significant resources towa",
    "item7": "Item 7.Management's Discussion and Analysis of Financial Condition and Results of Operations\n Item 7.\n Management's Discussion and Analysis of Financial Condition and Results of Operations\n This section of this Form 10-K generally discusses 2023 and 2022 items and year-to-year comparisons between 2023 and 2022.  Discussions of 2021 items and year-to-year comparisons between 2022 and 2021 that are not included in this Form 10-K can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of the Company's Annual Report on Form 10-K for the fiscal year ended December 31, 2022.\n Results of Operations\n The following represents our consolidated performance highlights:\n As of/Year Ended December 31,Change2023202220212023 vs. 2022(in thousands, except revenue per membership and percentages)Financial Results:Streaming revenues$33,640,458$31,469,852$29,515,4967%DVD revenues (1)82,839145,698182,348(43)%Total revenues$33,723,297$31,615,550$29,697,8447%Operating income$6,954,003$5,632,831$6,194,50923%Operating margin21%18%21%Global Streaming Memberships:Paid net membership additions29,5298,90318,181232%Paid memberships at end of period260,276230,747221,84413%Average paying memberships240,889222,924210,7848%Average monthly revenue per paying membership$11.64$11.76$11.67(1)%\n \n As of/Year Ended December 31,Change\n As of/Year Ended December 31,\n Change\n 2023202220212023 vs. 2022\n 2023\n 2022\n 2021\n 2023 vs. 2022\n (in thousands, except revenue per membership and percentages)\n Financial Results:\n Streaming revenues$33,640,458$31,469,852$29,515,4967%\n Streaming revenues\n $\n 33,640,458\n 31,469,852\n 29,515,496\n 7\n %\n DVD revenues (1)82,839145,698182,348(43)%\n DVD revenues (1)\n 82,839\n 145,698\n 182,348\n (43)\n Total revenues$33,723,297$31,615,550$29,697,8447%\n Total revenues\n 33,723,297\n 31,615,550\n 29,697,844\n Operating income$6,954,003$5,632,831$6,194,50923%\n Operating income\n 6,954,003\n 5,632,831\n 6,194,509\n 23\n Operating margin21%18%21%\n Operating margin\n 21\n 18\n Global Streaming Memberships:\n Paid net membership additions29,5298,90318,181232%\n Paid net membership additions\n 29,529\n 8,903\n 18,181\n 232\n Paid memberships at end of period260,276230,747221,84413%\n Paid memberships at end of period\n 260,276\n 230,747\n 221,844\n 13\n Average paying memberships240,889222,924210,7848%\n Average paying memberships\n 240,889\n 222,924\n 210,784\n 8\n Average monthly revenue per paying membership$11.64$11.76$11.67(1)%\n Average monthly revenue per paying membership\n 11.64\n 11.76\n 11.67\n (1)\n (1) In April 2023, we announced our plans to discontinue our DVD-by-mail service, and we ceased providing our mailing services to customers on September 29, 2023. The discontinuance of our DVD business had an immaterial impact on our operations and financial results.\n Consolidated revenues for the year ended December 31, 2023 increased 7% as compared to the year ended December 31, 2022.  Operating margin for the year ended December 31, 2023 increased three percentage points, primarily due to revenues growing at a faster rate as compared to the growth in cost of revenues and marketing and decreased technology and development expenses, partially offset by higher growth in general and administrative expenses as compared to the growth in revenues.\n Streaming Revenues\n We primarily derive revenues from monthly membership fees for services related to streaming content to our members.  We offer a variety of streaming membership plans, the price of which varies by country and the features of the plan.  As of December 31, 2023, pricing on our paid plans ranged from the U.S. dollar equivalent of $1 to $28 per month, and pricing on our extra member sub accounts ranged from the U.S. dollar equivalent of $2 to $8 per month.  We expect that from time to time the prices of our membership plans in each country may change and we may test other plan and price variations.\n We also earn revenue from advertisements presented on our streaming service, consumer products and various other sources.  Revenues earned from sources other than monthly membership fees were not material for the years ended December 31, 2023, 2022, and 2021.\n Year Ended December 31,Change2023202220212023 vs. 2022(in thousands, except percentages)Streaming revenues$33,640,458$31,469,852$29,515,496$2,170,6067%\n Year Ended December 31,Change\n Year Ended December 31,\n (in thousands, except percentages)\n Streaming revenues$33,640,458$31,469,852$29,515,496$2,170,6067%\n 2,170,606\n Table of Contents\n Streaming revenues for the year ended December 31, 2023 increased 7% as compared to the year ended December 31, 2022, primarily due to the 8% growth in average paying memberships, partially offset by a 1% decrease in average monthly revenue per paying membership.  The decrease in average monthly revenue per paying membership was primarily due to changes in plan mix, higher membership growth in regions with lower average monthly revenue per paying membership, partially offset by limited price increases.  Additionally, streaming revenues for the year ended December 31, 2023 were further impacted by unfavorable fluctuations in foreign exchange rates.\n The following tables summarize streaming revenue and other streaming membership information by region for the years ended December 31, 2023, 2022 and 2021.\n United States and Canada (UCAN)\n As of/Year Ended December 31,Change2023202220212023 vs. 2022(in thousands, except revenue per membership and percentages)Revenues$14,873,783$14,084,643$12,972,100$789,1406%Paid net membership additions (losses)5,832(919)1,2796,751735%Paid memberships at end of period (1)80,12874,29675,2155,8328%Average paying memberships76,12674,00174,2342,1253%Average monthly revenue per paying membership$16.28$15.86$14.56$0.423%Constant currency change (2)3%\n Revenues$14,873,783$14,084,643$12,972,100$789,1406%\n Revenues\n 14,873,783\n 14,084,643\n 12,972,100\n 789,140\n 6\n Paid net membership additions (losses)5,832(919)1,2796,751735%\n Paid net membership additions (losses)\n 5,832\n (919)\n 1,279\n 6,751\n 735\n Paid memberships at end of period (1)80,12874,29675,2155,8328%\n Paid memberships at end of period (1)\n 80,128\n 74,296\n 75,215\n Average paying memberships76,12674,00174,2342,1253%\n 76,126\n 74,001\n 74,234\n 2,125\n 3\n Average monthly revenue per paying membership$16.28$15.86$14.56$0.423%\n 16.28\n 15.86\n 14.56\n 0.42\n Constant currency change (2)3%\n Constant currency change (2)\n Europe, Middle East, and Africa (EMEA)\n As of/Year Ended December 31,Change2023202220212023 vs. 2022(in thousands, except revenue per membership and percentages)Revenues$10,556,487$9,745,015$9,699,819$811,4728%Paid net membership additions12,0842,6937,3389,391349%Paid memberships at end of period (1)88,81376,72974,03612,08416%Average paying memberships80,92873,90469,5187,02410%Average monthly revenue per paying membership$10.87$10.99$11.63$(0.12)(1)%Constant currency change (2)(1)%\n Revenues$10,556,487$9,745,015$9,699,819$811,4728%\n 10,556,487\n 9,745,015\n 9,699,819\n 811,472\n Paid net membership additions12,0842,6937,3389,391349%\n 12,084\n 2,693\n 7,338\n 9,391\n 349\n Paid memberships at end of period (1)88,81376,72974,03612,08416%\n 88,813\n 76,729\n 74,036\n 16\n Average paying memberships80,92873,90469,5187,02410%\n 80,928\n 73,904\n 69,518\n 7,024\n 10\n Average monthly revenue per paying membership$10.87$10.99$11.63$(0.12)(1)%\n 10.87\n 10.99\n 11.63\n (0.12)\n Constant currency change (2)(1)%\n Latin America (LATAM)\n As of/Year Ended December 31,Change2023202220212023 vs. 2022(in thousands, except revenue per membership and percentages)Revenues$4,446,461$4,069,973$3,576,976$376,4889%Paid net membership additions4,2981,7382,4242,560147%Paid memberships at end of period (1)45,99741,69939,9614,29810%Average paying memberships42,80240,00038,5732,8027%Average monthly revenue per paying membership$8.66$8.48$7.73$0.182%Constant currency change (2)10%\n Revenues$4,446,461$4,069,973$3,576,976$376,4889%\n 4,446,461\n 4,069,973\n 3,576,976\n 376,488\n ",
    "item7a": "Item 7A.Quantitative and Qualitative Disclosures about Market Risk\n Item 7A.\n Quantitative and Qualitative Disclosures about Market Risk\n We are exposed to market risks related to interest rate changes and the corresponding changes in the market values of our debt and foreign currency fluctuations.\n \n Interest Rate Risk\n At December 31, 2023, our cash equivalents and short-term investments were generally invested in money market funds and time deposits. Interest paid on such funds fluctuates with the prevailing interest rate.\n As of December 31, 2023, we had $14.6 billion of debt, consisting of fixed rate unsecured debt in fourteen tranches due between 2024 and 2030. Refer to Note 6 to the consolidated financial statements for details about all issuances. The fair value\n 29\n Table of Contents\n of our debt will fluctuate with movements of interest rates, increasing in periods of declining rates of interest and declining in periods of increasing rates of interest.  The fair value of our debt will also fluctuate based on changes in foreign currency rates, as discussed below.\n Foreign Currency Risk\n We operate our business globally and transact in multiple currencies. Currencies denominated in other than the U.S. dollar accounted for 57% of revenue and 28% of operating expenses for the year ended December 31, 2023. We therefore have foreign currency risk related to these currencies, with our largest exposures being the euro, the British pound, the Brazilian real, the Canadian dollar, and the Mexican peso.\n Accordingly, volatility in exchange rates, and in particular a weakening of foreign currencies relative to the U.S. dollar may negatively affect our revenue and operating income as expressed in U.S. dollars. For the year ended December 31, 2023, our revenues would have been approximately $597 million higher had foreign currency exchange rates remained constant with those in the same period of 2022. See Part II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" for further information regarding our non-GAAP financial measure of constant currency.\n In the year ended December 31, 2023, we entered into foreign exchange forward contracts to mitigate fluctuations in forecasted U.S. dollar-equivalent revenues occurring in January 2024 and beyond from changes in foreign currency exchange rates. These contracts may reduce, but do not entirely eliminate, the effect of foreign currency exchange fluctuations, and we may choose not to hedge certain exposures. We designate these contracts as cash flow hedges of forecasted foreign currency revenue and initially record the gains or losses on these derivative instruments as a component of accumulated other comprehensive income (\"AOCI\") and reclassify the amounts into \"Revenues\" on the Consolidated Statements of Operations in the same period the forecasted transaction affects earnings. If the U.S dollar weakened by 10% as of December 31, 2023, the amount recorded in AOCI related to our foreign exchange contracts, before taxes, would have been approximately $958 million lower. This adverse change in AOCI would be expected to offset a corresponding favorable foreign currency change in the underlying forecasted revenues when recognized in earnings.\n In the year ended December 31, 2023, we also entered into foreign exchange forward contracts to mitigate fluctuations in forecasted and firmly committed U.S. dollar-equivalent transactions related to the licensing and production of content assets occurring in January 2024 and beyond from changes in foreign currency exchange rates. These contracts may reduce, but do not entirely eliminate, the effect of foreign currency exchange fluctuations, and we may choose not to hedge certain exposures. We designate these contracts as cash flow hedges and initially record the gains or losses on these derivative instruments as a component of AOCI and reclassify the amounts into \"Cost of Revenues\" to offset the hedged exposures as they affect earnings, which occurs as the underlying hedged content assets are amortized. If the U.S dollar strengthened by 10% as of December 31, 2023, the amount recorded in AOCI related to our foreign exchange contracts, before taxes, would have been approximately $71 million lower. This adverse change in AOCI would be expected to offset a corresponding favorable foreign currency change in the underlying exposures when recognized in earnings.\n We have also experienced and will continue to experience fluctuations in our net income as a result of gains (losses) on the settlement and the remeasurement of monetary assets and liabilities denominated in currencies that are not the functional currency. In the year ended December 31, 2023, we recognized a $293 million foreign exchange loss primarily due to the non-cash remeasurement of our Senior Notes denominated in euros and the remeasurement of cash and content liabilities denominated in currencies other than the functional currencies.\n In addition, the effect of exchange rate changes on cash, cash equivalents and restricted cash as disclosed on the Consolidated Statements of Cash Flows in the year ended December 31, 2023 was an increase of $83 million.\n"
}