{
    "cik": 77476,
    "cusip6": "713448",
    "cusip": [
        "713448108"
    ],
    "names": [
        "PEPSICO INCORPORATED",
        "PEPSICO INC COM",
        "PEPSICO INC",
        "Pepsico Inc",
        "PepsiCo Inc",
        "PEPSICO",
        "Pepsico Inc.",
        "Pepsico, Inc.",
        "PEPSICO INC",
        "Pepsico Incorporated",
        "Pepsico",
        "Pepsico Inc - US",
        "PEPSI CO",
        "PepsiCo",
        "PepsiCo Inc.",
        "PEPSICO INC",
        "PEPSICO   INC",
        "Pepsico Incorporated",
        "PEPSICO INC",
        "PEPSICO INC NC",
        "PepsiCo, Inc.",
        "1PEPSICO INC",
        "PEPSICO INC",
        "PEPSICO, INC. CMN",
        "PEPSICO INC",
        "PERRIGO CO PLC",
        "Pepsico Inc.",
        "Pepsico Inc",
        "PEPSICO INC.",
        "PEPSICO INC USD0.017",
        "PEPSICO INC",
        "PEPSICO INC",
        "PEPSICO ORD (NMS)",
        "PEPSICO INC COMMON STOCK",
        "PEPSICO INC USD0.016666 Cap",
        "Pepsico",
        "Pepsi Co Inc",
        "Pepsico",
        "PEPSICO INC",
        "PEPSICO IN",
        "Pepsico  Inc",
        "PEPSICO ORD",
        "PepsiCo Inc/NC",
        "PEPSICO INC",
        "PEPSICO INC.",
        "PepsiCo, Inc.",
        "PEPSICO INC",
        "Permian Resources Corp Class A",
        "PEPSICO INCORPORATED",
        "PepsiCo Inc",
        "Pepsico Inc Cap Stock US$0.0166",
        "Pepsico Inc",
        "Pepsico Inc Com",
        "Pepsi",
        "PepsiCo Inc /NC",
        "Pepsico, Inc",
        "PepsiCo Inc.",
        "PEPSICO, INC.",
        "PEPSICO INC",
        "PEPSICO INC",
        "PEPSICO INC                 COM",
        "PEP",
        "Pepsico, Inc",
        "Pepsi Co",
        "PEPSICO INC COMMON STOCK",
        "PepsiCo Inc Com",
        "PEPSICO, INC",
        "Pepsico INC",
        "PEPSICO INCORPORATED",
        "PEPSICO",
        "PEPSICO  INC.",
        "Pepsi Co",
        "PEPSICO, INC                COM",
        "PEPSICO INC  COM",
        "PepsiCo Incorporated",
        "Pepsico inc",
        "Pepsico Inc",
        "PEPSICO INCORPORATED",
        "PEPSICO INC                  COM",
        "PEPSICO INC                         C",
        "PepsicoInc",
        "PEPSICO INC            COM",
        "PEPSICO INC CAP USD0.01666",
        "PEPSICOINC",
        "PepsiCo Inc. (PEP)",
        "PEPSICO, INC. COMMON"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/77476/000007747624000008/pep-20231230.htm",
    "item1": "Item 1.  Business.\n When used in this report, the terms \"we,\" \"us,\" \"our,\" \"PepsiCo\" and the \"Company\" mean PepsiCo, Inc. and its consolidated subsidiaries, collectively. Certain terms used in this Annual Report on Form 10-K are defined in the Glossary included in Item 7. of this report.\n Company Overview\n We were incorporated in Delaware in 1919 and reincorporated in North Carolina in 1986. We are a leading global beverage and convenient food company with a complementary portfolio of brands, including Lay's, Doritos, Cheetos, Gatorade, Pepsi-Cola, Mountain Dew, Quaker and SodaStream. Through our operations, authorized bottlers, contract manufacturers and other third parties, we make, market, distribute and sell a wide variety of beverages and convenient foods, serving customers and consumers in more than 200 countries and territories.\n \n Our Operations\n We are organized into seven reportable segments (also referred to as divisions), as follows:\n 1)Frito-Lay North America (FLNA), which includes our branded convenient food businesses in the United States and Canada;\n 1)\n Frito-Lay North America (FLNA), which includes our branded convenient food businesses in the United States and Canada;\n 2)Quaker Foods North America (QFNA), which includes our branded convenient food businesses, such as cereal, rice, pasta and other branded food, in the United States and Canada;\n 2)\n Quaker Foods North America (QFNA), which includes our branded convenient food businesses, such as cereal, rice, pasta and other branded food, in the United States and Canada;\n 3)PepsiCo Beverages North America (PBNA), which includes our beverage businesses in the United States and Canada;\n 3)\n PepsiCo Beverages North America (PBNA), which includes our beverage businesses in the United States and Canada;\n 4)Latin America (LatAm), which includes all of our beverage and convenient food businesses in Latin America;\n 4)\n Latin America (LatAm), which includes all of our beverage and convenient food businesses in Latin America;\n 5)Europe, which includes all of our beverage and convenient food businesses in Europe;\n 5)\n Europe, which includes all of our beverage and convenient food businesses in Europe;\n 2\n Table ofContents\n Table of\n Contents\n 6)Africa, Middle East and South Asia (AMESA), which includes all of our beverage and convenient food businesses in Africa, the Middle East and South Asia; and\n 6)\n Africa, Middle East and South Asia (AMESA), which includes all of our beverage and convenient food businesses in Africa, the Middle East and South Asia; and\n 7)Asia Pacific, Australia and New Zealand and China Region (APAC), which includes all of our beverage and convenient food businesses in Asia Pacific, Australia and New Zealand, and China region.\n 7)\n Asia Pacific, Australia and New Zealand and China Region (APAC), which includes all of our beverage and convenient food businesses in Asia Pacific, Australia and New Zealand, and China region.\n Frito-Lay North America\n Either independently or in conjunction with third parties, FLNA makes, markets, distributes and sells branded convenient foods. These foods include branded dips, Cheetos cheese-flavored snacks, Doritos tortilla chips, Fritos corn chips, Lay's potato chips, Ruffles potato chips and Tostitos tortilla chips. FLNA's branded products are sold to independent distributors and retailers. In addition, FLNA's joint venture with Strauss Group makes, markets, distributes and sells Sabra refrigerated dips and spreads.\n Quaker Foods North America\n Either independently or in conjunction with third parties, QFNA makes, markets, distributes and sells branded convenient foods, which include cereals, rice, pasta and other branded products. QFNA's products include Cap'n Crunch cereal, Life cereal, Pearl Milling Company syrups and mixes, Quaker Chewy granola bars, Quaker grits, Quaker oatmeal, Quaker rice cakes, Quaker Simply Granola and Rice-A-Roni side dishes. QFNA's branded products are sold to independent distributors and retailers.\n PepsiCo Beverages North America\n Either independently or in conjunction with third parties, PBNA makes, markets and sells beverage concentrates, fountain syrups and finished goods under various beverage brands including Aquafina, Bubly, Diet Mountain Dew, Diet Pepsi, Gatorade, Gatorade Zero, Mountain Dew, Pepsi and Propel. PBNA operates its own bottling plants and distribution facilities and sells branded finished goods directly to independent distributors and retailers. PBNA also sells concentrate and finished goods for our brands to authorized and independent bottlers, who in turn sell our branded finished goods to independent distributors and retailers in certain markets. PBNA also, either independently or in conjunction with third parties, makes, markets, distributes and sells ready-to-drink tea and coffee products through joint ventures with Unilever (under the Lipton brand name) and Starbucks, respectively. Further, PBNA manufactures and distributes certain brands licensed from Keurig Dr Pepper Inc., including Crush, Dr Pepper and Schweppes, and certain juice brands licensed from Dole Food Company, Inc. and Ocean Spray Cranberries, Inc. In 2022, PBNA began to distribute Hard MTN Dew, an alcoholic beverage manufactured and owned by the Boston Beer Company. In the first quarter of 2022, we sold our Tropicana, Naked and other select juice brands to PAI Partners, while retaining a 39% noncontrolling interest in a newly formed joint venture, Tropicana Brands Group (TBG), operating across North America and Europe (Juice Transaction). In the United States, PepsiCo acts as the exclusive distributor for TBG's portfolio of brands for small-format and foodservice customers with chilled direct-store-delivery (DSD). See Note 13 to our consolidated financial statements for further information.\n Latin America\n Either independently or in conjunction with third parties, LatAm makes, markets, distributes and sells a number of convenient food brands including Cheetos, Doritos, Emperador, Lay's, Marias Gamesa, Ruffles, Sabritas, Saladitas and Tostitos, as well as many Quaker-branded convenient foods. LatAm also, either independently or in conjunction with third parties, makes, markets, distributes and sells beverage concentrates, fountain syrups and finished goods under various beverage brands including 7UP, Diet 7UP, Gatorade, H2oh!, Manzanita Sol, Mirinda, Pepsi, Pepsi Black, San Carlos and Toddy. These branded products are sold to authorized and independent bottlers, independent distributors and retailers. LatAm\n 3\n also, either independently or in conjunction with third parties, makes, markets, distributes and sells ready-to-drink tea products through an international joint venture with Unilever (under the Lipton brand name).\n Europe\n Either independently or in conjunction with third parties, Europe makes, markets, distributes and sells a number of convenient food brands including Cheetos, Doritos, Lay's, Ruffles and Walkers, as well as many Quaker-branded convenient foods, through consolidated businesses, as well as through noncontrolled affiliates. Europe also, either independently or in conjunction with third parties, makes, markets, distributes and sells beverage concentrates, fountain syrups and finished goods under various beverage brands including 7UP, Diet Pepsi, Lubimyj Sad, Mirinda, Pepsi and Pepsi Max. These branded products are sold to authorized and independent bottlers, independent distributors and retailers. In certain markets, however, Europe operates its own bottling plants and distribution facilities. Europe also, as part of its beverage business, manufactures and distributes SodaStream sparkling water makers and related products. Further, Europe makes, markets, distributes and sells a number of dairy products including Agusha, Chudo and Domik v Derevne. Europe also, either independently or in conjunction with third parties, makes, markets, distributes and sells ready-to-drink tea products through an intern",
    "item1a": "Item 1A.  Risk Factors.\n The following risks, some of which have occurred and any of which may occur in the future, can have a material adverse effect on our business or financial performance, which in turn can affect the price of our publicly traded securities. These are not the only risks we face. There may be other risks we are not currently aware of or that we currently deem not to be material but that may become material in the future.\n Business Risks\n Risks associated with the deadly conflict in Ukraine\n The deadly conflict in Ukraine and related sanctions have continued to result in worldwide geopolitical and macroeconomic uncertainty. The conflict has resulted and could continue to result in volatile commodity markets, supply chain disruptions, increased risk of cyber incidents or other disruptions to our\n 11\n \n Table ofContents\n Table of\n Contents\n information systems, reputational risk, heightened risks to employee safety, business disruptions (including labor shortages), significant volatility of the Russian ruble, limitations on access to credit markets and other corporate banking services, including working capital facilities, reduced availability and increased costs for transportation, energy, packaging and raw materials and other input costs, environmental, health and safety risks related to securing and maintaining facilities, additional sanctions, export controls and other legislation or regulations (including restrictions on the transfer of funds to and from Russia). The ongoing conflict could result in the temporary or permanent loss of assets, including the nationalization or expropriation of assets, result in additional impairment charges or significantly affect our ability to manage our operations in these markets which could result in the deconsolidation of such businesses. We cannot predict how and the extent to which the conflict will continue to affect our employees, operations, customers, consumers or business partners or our ability to achieve certain of our sustainability goals. The conflict has adversely affected and could continue to adversely affect demand for our products and our global business.\n Reduction in future demand for our products would adversely affect our business.\n Demand for our products depends in part on our ability to innovate and anticipate and effectively respond to shifts in consumer trends and preferences, including the types of products our consumers want and how they browse for, purchase and consume them. Consumer preferences continuously evolve due to a variety of factors, including: changes in consumer demographics, consumption patterns, diet (whether due to changes in consumer behavior and eating habits, the use of weight-loss drugs or other factors) and channel preferences (including continued increases in the e-commerce and online-to-offline channels); pricing; product quality; concerns or perceptions regarding packaging and its environmental impact (such as single-use and other plastic packaging); and concerns or perceptions regarding the nutrition profile and health effects of, or location of origin of, ingredients or substances in our products or packaging, including due to the results of third-party studies (whether or not scientifically valid). Concerns with any of the foregoing could lead consumers to reduce or publicly boycott the purchase or consumption of our products. Pandemics, epidemics or other disease outbreaks, such as COVID-19, and geopolitical events, wars and other military conflicts have also impacted and could continue to impact consumer preferences and demand for our products. Consumer preferences are also influenced by perception of our brand image or the brand images of our products, the success of our advertising and marketing campaigns, our ability to engage with our consumers in the manner they prefer, including through the use of digital media or assets, and the perception of our use of social media and our response to political and social issues, geopolitical events, wars and other military conflicts or catastrophic events. These and other factors have reduced and could continue to reduce consumers' willingness to purchase certain of our products, including as a result of public boycotts. Any inability on our part to anticipate or react to changes in consumer preferences and trends, or make the right strategic investments to do so, including investments in data analytics to understand consumer trends, can lead to reduced demand for our products, lead to inventory write-offs or erode our competitive and financial position, thereby adversely affecting our business. In addition, our business operations, including our supply chain, are subject to disruption by geopolitical events, wars and other military conflicts, natural disasters, pandemics, epidemics or other events beyond our control that could negatively impact product availability and decrease demand for our products if our crisis management plans do not effectively mitigate these issues.\n Damage to our reputation or brand image can adversely affect our business.\n Maintaining a positive reputation globally is critical to selling our products. Our reputation or brand image has in the past been, and could in the future be, adversely impacted by a variety of factors, including: any failure by us, our business partners, or other actors in the supply chain to maintain high ethical, business and environmental, social and governance practices, including with respect to human rights, child labor, diversity, equity and inclusion, workplace conditions and employee health and safety; any failure, or\n 12\n perception of a failure, to achieve our environmental, social and governance goals, or any negative perception toward such goals, including with respect to the nutrition profile of our products, diversity, equity and inclusion initiatives, packaging, water use and our impact on the environment; any failure to address health or other concerns about our products, products we distribute (including alcoholic beverages), or particular ingredients in our products, including concerns regarding whether certain of our products contribute to obesity and other health conditions or an increase in public health costs; our research and development efforts; any product quality or safety issues, including the recall of any of our products; any failure to comply with laws and regulations; consumer perception of our advertising campaigns, sponsorship arrangements, marketing programs, use of social media and our response to political and social issues, geopolitical events, wars and other military conflicts or catastrophic events; or any failure to effectively respond to negative or inaccurate comments about us on social media or otherwise regarding any of the foregoing. Damage to our reputation or brand image has in the past and could in the future decrease demand for our products, thereby adversely affecting our business.\n Product recalls or other issues or concerns with respect to product quality and safety can adversely affect our business.\n We have recalled, and could in the future recall, products due to product quality or safety issues, including actual or alleged mislabeling, misbranding, spoilage, undeclared allergens, adulteration or contamination. Joint ventures in which we have an interest have also recalled, and could in the future recall, products for the same or other reasons. Product recalls, including the voluntary recall of certain bars and cereals in our QFNA division (Quaker Recall), have in the past and could in the future adversely affect our business by resulting in losses due to their cost, the destruction of product inventory, customer fines and returns or lost sales due to any unavailability of the product for a period of time. In addition, product quality or safety issues have in the past and could in the future also reduce consumer confidence and demand for our products, cause production and delivery disruption",
    "item7": "Item 7.  Management's Discussion and Analysis of Financial Condition and Results of Operations.\n \n OUR BUSINESSExecutive Overview32Our Operations33Other Relationships33Our Business Risks34OUR FINANCIAL RESULTSResults of Operations – Consolidated Review40Results of Operations – Division Review41FLNA43QFNA44PBNA44LatAm44Europe45AMESA45APAC46Non-GAAP Measures46Items Affecting Comparability48Our Liquidity and Capital Resources51Changes in Line Items in Our Consolidated Financial Statements54Return on Invested Capital54OUR CRITICAL ACCOUNTING POLICIES AND ESTIMATESRevenue Recognition55Goodwill and Other Intangible Assets56Income Tax Expense and Accruals58Pension and Retiree Medical Plans58CONSOLIDATED STATEMENT OF INCOME61CONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME62CONSOLIDATED STATEMENT OF CASH FLOWS63CONSOLIDATED BALANCE SHEET65CONSOLIDATED STATEMENT OF EQUITY66NOTES TO THE CONSOLIDATED FINANCIAL STATEMENTSNote 1 – Basis of Presentation and Our Divisions67Note 2 – Our Significant Accounting Policies74Note 3 – Restructuring and Impairment Charges78Note 4 – Intangible Assets80Note 5 – Income Taxes84Note 6 – Share-Based Compensation88Note 7 – Pension, Retiree Medical and Savings Plans92Note 8 – Debt Obligations98Note 9 – Financial Instruments100Note 10 – Net Income Attributable to PepsiCo per Common Share105Note 11 – Accumulated Other Comprehensive Loss Attributable to PepsiCo106Note 12 – Leases107Note 13 – Acquisitions and Divestitures109Note 14 – Supply Chain Financing Arrangements110Note 15 – Supplemental Financial Information111REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM113GLOSSARY117\n OUR BUSINESS\n Executive Overview32\n Executive Overview\n 32\n Our Operations33\n Our Operations\n 33\n Other Relationships33\n Other Relationships\n Our Business Risks34\n Our Business Risks\n 34\n OUR FINANCIAL RESULTS\n Results of Operations – Consolidated Review40\n Results of Operations – Consolidated Review\n 40\n Results of Operations – Division Review41\n Results of Operations – Division Review\n 41\n FLNA43\n FLNA\n 43\n QFNA44\n QFNA\n 44\n PBNA44\n PBNA\n LatAm44\n LatAm\n Europe45\n Europe\n 45\n AMESA45\n AMESA\n APAC46\n APAC\n 46\n Non-GAAP Measures46\n Non-GAAP Measures\n Items Affecting Comparability48\n Items Affecting Comparability\n 48\n Our Liquidity and Capital Resources51\n Our Liquidity and Capital Resources\n 51\n Changes in Line Items in Our Consolidated Financial Statements54\n Changes in Line Items in Our Consolidated Financial Statements\n 54\n Return on Invested Capital54\n Return on Invested Capital\n OUR CRITICAL ACCOUNTING POLICIES AND ESTIMATES\n Revenue Recognition55\n Revenue Recognition\n 55\n Goodwill and Other Intangible Assets56\n Goodwill and Other Intangible Assets\n 56\n Income Tax Expense and Accruals58\n Income Tax Expense and Accruals\n 58\n Pension and Retiree Medical Plans58\n Pension and Retiree Medical Plans\n CONSOLIDATED STATEMENT OF INCOME61\n CONSOLIDATED STATEMENT OF INCOME\n 61\n CONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME62\n CONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\n 62\n CONSOLIDATED STATEMENT OF CASH FLOWS63\n CONSOLIDATED STATEMENT OF CASH FLOWS\n 63\n CONSOLIDATED BALANCE SHEET65\n CONSOLIDATED BALANCE SHEET\n 65\n CONSOLIDATED STATEMENT OF EQUITY66\n CONSOLIDATED STATEMENT OF EQUITY\n 66\n NOTES TO THE CONSOLIDATED FINANCIAL STATEMENTS\n Note 1 – Basis of Presentation and Our Divisions67\n Note 1 – Basis of Presentation and Our Divisions\n 67\n Note 2 – Our Significant Accounting Policies74\n Note 2 – Our Significant Accounting Policies\n 74\n Note 3 – Restructuring and Impairment Charges78\n Note 3 – Restructuring and Impairment Charges\n 78\n Note 4 – Intangible Assets80\n Note 4 – Intangible Assets\n 80\n Note 5 – Income Taxes84\n Note 5 – Income Taxes\n 84\n Note 6 – Share-Based Compensation88\n Note 6 – Share-Based Compensation\n 88\n Note 7 – Pension, Retiree Medical and Savings Plans92\n Note 7 – Pension, Retiree Medical and Savings Plans\n 92\n Note 8 – Debt Obligations98\n Note 8 – Debt Obligations\n 98\n Note 9 – Financial Instruments100\n Note 9 – Financial Instruments\n 100\n Note 10 – Net Income Attributable to PepsiCo per Common Share105\n Note 10 – Net Income Attributable to PepsiCo per Common Share\n 105\n Note 11 – Accumulated Other Comprehensive Loss Attributable to PepsiCo106\n Note 11 – Accumulated Other Comprehensive Loss Attributable to PepsiCo\n 106\n Note 12 – Leases107\n Note 12 – Leases\n 107\n Note 13 – Acquisitions and Divestitures109\n Note 13 – Acquisitions and Divestitures\n 109\n Note 14 – Supply Chain Financing Arrangements110\n Note 14 – Supply Chain Financing Arrangements\n 110\n Note 15 – Supplemental Financial Information111\n Note 15 – Supplemental Financial Information\n 111\n REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM113\n REPORT OF INDEPENDENT REGISTERED PUBLIC ACCOUNTING FIRM\n 113\n GLOSSARY117\n GLOSSARY\n 117\n 31\n Table of Contents\n Our discussion and analysis is intended to help the reader understand our results of operations and financial condition and is provided as an addition to, and should be read in connection with, our consolidated financial statements and the accompanying notes. Definitions of key terms can be found in the glossary. Unless otherwise noted, tabular dollars are presented in millions, except per share amounts. All per share amounts reflect common stock per share amounts, assume dilution unless otherwise noted, and are based on unrounded amounts. Percentage changes are based on unrounded amounts.\n Discussion in this Form 10-K includes results of operations and financial condition for 2023 and 2022 and year-over-year comparisons between 2023 and 2022. For discussion on results of operations and financial condition pertaining to 2021 and year-over-year comparisons between 2022 and 2021, please refer to \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2022.\n PepsiCo is a leading global convenient food and beverage company with a complementary portfolio of brands, including Lay's, Doritos, Cheetos, Gatorade, Pepsi-Cola, Mountain Dew, Quaker and SodaStream. Through our operations, authorized bottlers, contract manufacturers and other third parties, we make, market, distribute and sell a wide variety of beverages and convenient foods, serving customers and consumers in more than 200 countries and territories.\n As a global company with deep local ties, we faced many of the same challenges in 2023 as our consumers, customers, and competitors across the world, including supply chain disruptions; inflationary pressures; shifting consumer preferences and behaviors; ongoing climate issues; a highly competitive operating environment; a rapidly changing retail landscape, including growth in e-commerce; continued macroeconomic and political volatility, including the deadly conflicts in Ukraine and the Middle East; and an evolving regulatory landscape.\n To meet the challenges of today – and those of tomorrow – we are driven by an approach called pep+ (PepsiCo Positive). pep+ is a strategic end-to-end transformation of our business, with sustainability at the center of how the company will strive to create growth and value, while inspiring positive change for the planet and people. pep+ guides how we are working to transform our business operations, and can be seen in such efforts as sourcing ingredients and making and selling products in a more sustainable way, to leveraging our more than one billion connections with consumers each day, to driving positive change across our value chain and inspiring people to make choices that are better for themselves and the planet.\n pep+ drives action and progress across three key pillars:\n Positive Agriculture: We are working to expand and share regenerative practices across seven million acres (approximately equal to the company's agricultural footprint, sustainably source key crops and ingredients, and improve the livelihoods of more people in our agricultural supply chain. Understan",
    "item7a": "Item 7A.  Quantitative and Qualitative Disclosures About Market Risk.\n Included in \"Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Our Business Risks.\"\n \n"
}