{
    "cik": 78003,
    "cusip6": "717081",
    "cusip": [
        "717081103"
    ],
    "names": [
        "PFIZER INC",
        "PFIZER INC COM",
        "Pfizer Inc",
        "Pfizer Inc.",
        "Pfizer",
        "PFIZER, INC.",
        "PFIZER",
        "PFIZER INC",
        "Pfizer Incorporated",
        "PFIZER INC",
        "Pfizer Inc - US",
        "PFIZER INC",
        "PFIZER INC",
        "PFIZER STK",
        "PFIZER   INC",
        "Pfizer",
        "Pfizer, Inc.",
        "PFIZER INC",
        "PFIZER INC. CMN",
        "PFIZER INC.",
        "PHOTRONICS INC",
        "Pfizer",
        "Pfizer Inc",
        "PFIZER INCORPORATED",
        "Pfizer Inc",
        "PFE US",
        "PFIZER INC.",
        "PFIZER INC",
        "PFIZER INC",
        "PFIZER ORD (NYS)",
        "PFIZER INC USD0.05 Common Stock",
        "Pfizer Incorporated",
        "PFIZER ORD",
        "PFIZER, INC",
        "PFIZER INC",
        "PFIZER INC COM",
        "Pfizer, Inc",
        "PFIZER INC",
        "PFIZER INCORPORATED",
        "Pfizer Inc.",
        "Pfizer Inc",
        "QURATE RETAIL-A",
        "Pfizer Inc Com US$0.05",
        "Pfizer Inc",
        "Pifzer Inc",
        "Pfizer Inc",
        "PFIZER INC",
        "PFIZER INC",
        "PFIZER INC                  COM",
        "PFE",
        "Pfizer Incorporated",
        "Pfizer Inc Com",
        "Pfizer INC",
        "PFIZER INCORPORATED",
        "PFIZER INC",
        "Pfizer inc",
        "PFIZER INC",
        "PFIZER INC                   COM",
        "PFIZER INC                          C",
        "PfizerInc",
        "PFIZER INC COMMON STOCK",
        "PFIZER COMPANY INC",
        "1PFIZER INC",
        "PFIZER INC COM USD0.05",
        "PFIZERINC",
        "Pfizer Inc (PFE)",
        "PFIZER, INC. COMMON"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/78003/000007800324000039/pfe-20231231.htm",
    "item1": "ITEM 1.BUSINESS\n \n ITEM 1.\n BUSINESS\n ABOUT PFIZER\n Pfizer Inc. is a research-based, global biopharmaceutical company. We apply science and our global resources to bring therapies to people that extend and significantly improve their lives through the discovery, development, manufacture, marketing, sale and distribution of biopharmaceutical products worldwide. We work across developed and emerging markets to advance wellness, prevention, treatments and cures that challenge the most feared diseases of our time. We collaborate with healthcare providers, governments and local communities to support and expand access to reliable, affordable healthcare around the world. The Company was incorporated under the laws of the State of Delaware on June 2, 1942.\n Most of our revenues come from the manufacture and sale of biopharmaceutical products. We also sell products for the detection of certain illnesses and provide end-to-end R&D services to select innovative biotech companies. We believe that our medicines and vaccines provide significant value for healthcare providers and patients through improved treatment of diseases and improvements in health, wellness and productivity as well as by reducing other healthcare costs, such as emergency room visits or hospitalizations. We seek to enhance the value of our medicines and vaccines and actively engage in dialogues about how we can best work with patients, physicians and payors to prevent and treat disease and improve outcomes. We seek to maximize patient access and evaluate our pricing arrangements and contracting methods with payors to minimize adverse impact on our revenues within the current legal and pricing structures.\n We are committed to fulfilling our purpose:Breakthroughs that change patients' lives. Our purpose fuels everything we do and reflects both our passion for science and our commitment to patients. Our core business principles are:\n We are committed to fulfilling our purpose:\n Breakthroughs that change patients' lives\n . Our purpose fuels everything we do and reflects both our passion for science and our commitment to patients. Our core business principles are:\n 1.Trust is Everything\n 1.\n Trust is Everything\n 2.Science Will Win\n 2.\n Science Will Win\n 3.Disruption Calls for Innovation\n 3.\n Disruption Calls for Innovation\n 4.Time is Life\n 4.\n Time is Life\n 5.Execution Makes the Difference.\n 5.\n Execution Makes the Difference.\n In addition, Pfizer's ESG strategy, which is integrated into our corporate strategy, focuses on six areas where we see opportunities to create a meaningful impact: product innovation; equitable access and pricing; product quality and safety; diversity, equity and inclusion; climate change; and business ethics.\n We are committed to strategically capitalizing on growth opportunities, primarily by advancing our own product pipeline and maximizing the value of our existing products, but also through various business development activities. We view our business development activity as an enabler of our strategies and seek to generate growth by pursuing opportunities and transactions that have the potential to strengthen our business and our\n Pfizer Inc.2023 Form 10-K3\n Pfizer Inc.\n 2023 Form 10-K\n 3\n capabilities. We assess our business, assets and scientific capabilities/portfolio as part of our regular, ongoing portfolio review process and also continue to consider business development activities that will help advance our business strategy.\n On December 14, 2023, we completed our acquisition of Seagen, a global biotechnology company that discovers, develops and commercializes transformative cancer medicines. With the addition of Seagen's pipeline and its four in-line medicines (Padcev, Adcetris, Tukysa and Tivdak), Pfizer's oncology portfolio spans multiple modalities, including ADCs, small molecules, bispecifics and other immunotherapies. In addition to the acquisition of Seagen, our significant recent business development activities in 2023 include, among others, the September 2023 divestiture of our early-stage rare disease gene therapy portfolio to Alexion. For a further discussion of our strategy and our business development initiatives, see theOverview of Our Performance, Operating Environment, Strategy and Outlooksection within MD&A andNote 2.\n On December 14, 2023, we completed our acquisition of Seagen, a global biotechnology company that discovers, develops and commercializes transformative cancer medicines. With the addition of Seagen's pipeline and its four in-line medicines (Padcev, Adcetris, Tukysa and Tivdak), Pfizer's oncology portfolio spans multiple modalities, including ADCs, small molecules, bispecifics and other immunotherapies. In addition to the acquisition of Seagen, our significant recent business development activities in 2023 include, among others, the September 2023 divestiture of our early-stage rare disease gene therapy portfolio to Alexion. For a further discussion of our strategy and our business development initiatives, see the\n Overview of Our Performance, Operating Environment, Strategy and Outlook\n section within MD&A and\n Note 2\n .\n COMMERCIAL OPERATIONS\n In 2023, we managed our commercial operations through a global structure consisting of two operating segments, each led by a single manager: Biopharma, our innovative science-based biopharmaceutical business, and Business Innovation, an operating segment established in the first quarter of 2023 that includes PC1, our contract development and manufacturing organization and a leading supplier of specialty active pharmaceutical ingredients, and Pfizer Ignite, an offering that provides strategic guidance and end-to-end R&D services to select innovative biotech companies that align with our R&D focus areas. In 2023, Biopharma was the only reportable segment. The commercial structure within Biopharma included three broad customer groups in 2023: Primary Care, Specialty Care and Oncology.\n At the beginning of 2024, we made changes in our commercial organization to incorporate Seagen and improve focus, speed and execution. Specifically, within our Biopharma reportable segment we created the Pfizer Oncology Division, the Pfizer U.S. Commercial Division, and the Pfizer International Commercial Division:\n DivisionDescriptionPfizer Oncology DivisionCombines the U.S. Oncology commercial organizations, global Oncology marketing organizations and global and U.S. Oncology medical affairs from both Pfizer and Seagen. Includes innovative oncology product portfolio of ADCs, small molecules, bispecifics and other immunotherapies that treat a wide range of cancers including certain types of breast cancer, genitourinary cancer and hematologic malignancies, as well as certain types of melanoma, gastrointestinal, gynecological and thoracic cancers, which includes lung cancer.Pfizer U.S. Commercial DivisionIncludes the U.S. Primary Care and U.S. Specialty Care customer groups, the Chief Marketing Office, the Global Chief Medical Affairs Office and Global Access & Value.U.S. Primary Care includes:\"Internal medicine product portfolio of brands in cardiovascular metabolic, bone graft for spinal fusion and women's health, as well as post-LOE brands.\"Migraine product portfolio.\"Vaccines product portfolio across all ages with a pipeline focus on infectious diseases with significant unmet medical need, including COVID-19.\"Treatment for COVID-19.\"Products for detection of COVID-19 and influenza.U.S. Specialty Care includes:\"Inflammation & immunology product portfolio of brands and biosimilars for chronic immune and inflammatory diseases.\"Rare disease product portfolio of brands for a number of therapeutic areas with rare diseases, including amyloidosis, hemophilia, endocrine diseases and sickle cell disease.\"Hospital product portfolio of sterile injectable and immunoglobulin medicines.Pfizer International Commercial DivisionIncludes the ex-U.S. commercial and medical affairs organizations covering Pfizer's entire produ",
    "item1a": "ITEM 1A.RISK FACTORS\n \n ITEM 1A.\n RISK FACTORS\n This section describes the material risks to our business, which should be considered carefully in addition to the other information in this report and our other filings with the SEC. Investors should be aware that it is not possible to predict or identify all such factors and that the following is not meant to be a complete discussion of all potential risks or uncertainties. Additionally, our business is subject to general risks applicable to any company, such as economic conditions, geopolitical events, extreme weather and natural disasters. If known or unknown risks or uncertainties materialize, our business operations, financial condition, operating results (including components of our financial results), cash flows, prospects, reputation or credit ratings could be adversely affected now and in the future, potentially in a material way. The following discussion of risk factors contains forward-looking statements, as discussed in theForward-Looking Information and Factors that May Affect Future Resultssection.\n This section describes the material risks to our business, which should be considered carefully in addition to the other information in this report and our other filings with the SEC. Investors should be aware that it is not possible to predict or identify all such factors and that the following is not meant to be a complete discussion of all potential risks or uncertainties. Additionally, our business is subject to general risks applicable to any company, such as economic conditions, geopolitical events, extreme weather and natural disasters. If known or unknown risks or uncertainties materialize, our business operations, financial condition, operating results (including components of our financial results), cash flows, prospects, reputation or credit ratings could be adversely affected now and in the future, potentially in a material way. The following discussion of risk factors contains forward-looking statements, as discussed in the\n Forward-Looking Information and Factors that May Affect Future Results\n section.\n RISKS RELATED TO OUR BUSINESS, INDUSTRY AND OPERATIONS:\n MANAGED CARE TRENDS\n Private payors, such as health plans, and other managed care entities, such as PBMs, continue to take action to manage the utilization and costs of drugs in the U.S., the single largest market for biopharmaceutical products. The negotiating power of MCOs and other private third-party payors has increased due to consolidation, and they, along with state and federal governments, increasingly employ formularies to control costs and encourage utilization of certain drugs, including through the use of deductibles, utilization management tools, cost sharing or formulary placement. They may demand rebates from biopharmaceutical manufacturers for preferred placement on a drug formulary. The growing availability and use of innovative specialty pharmaceutical medicines that treat rare or life threatening conditions, typically with a relatively higher cost as compared to other types of pharmaceutical products, also has generated increased payor interest in development of cost-containment strategies. These initiatives have increased consumers' interest in drug prices and input in medication choices, as they pay for a larger portion of their prescription costs and may cause them to favor lower-cost generic alternatives. We may fail to obtain or maintain timely or adequate pricing or formulary placement of our products, or fail to obtain such formulary placement at favorable pricing net of rebates.\n Third-party payors also use additional measures such as new-to-market blocks, exclusion lists, indication-based pricing and value-based pricing/contracting to improve their cost containment efforts and cost efficiency. Such payors are also increasingly imposing utilization management tools requiring prior authorization for a branded product or requiring the patient to first fail on one or more other products before permitting access to a particular branded medicine. As the U.S. private third-party payor market consolidates further, and as the IRA prices become publicly available, we may face greater pricing pressure from private third-party payors as they continue to drive more of their patients to use lower cost alternatives\n Pfizer Inc.2023 Form 10-K16\n Pfizer Inc.\n 2023 Form 10-K\n 16\n or seek even larger rebates to control costs or offset losses from the IRA. For additional information on the IRA, see theItem 1. BusinessGovernment Regulation and Price Constraintssection.\n or seek even larger rebates to control costs or offset losses from the IRA. For additional information on the IRA, see the\n Item 1. Business\n Government Regulation and Price Constraints\n Also, business arrangements in this area are subject to a high degree of government scrutiny, and available safe harbors under applicable federal and state fraud and abuse laws are subject to change through legislative and regulatory action, as well as evolving judicial interpretations. Our approach to these arrangements may also be informed by such government and industry guidance.\n COMPETITIVE PRODUCTS\n Competitive product launches have and may erode future sales of our products, including our existing products and those currently under development, or result in product obsolescence. Such launches continue to occur, and potentially competitive products are in various stages of development. We cannot predict with accuracy the timing or impact of the introduction of competitive products that treat or prevent diseases and conditions like those treated or prevented by our in-line products and product candidates.\n Some of our competitors may have competitive, technical or other advantages over us for the development of technologies and processes or greater experience in particular therapeutic areas, and consolidation among certain pharmaceutical and biotechnology companies can enhance such advantages. These advantages may make it difficult for us to compete with them successfully to discover, develop and market new products and for our current products to compete with new products or indications they may bring to market. Our products have been competing and may continue to compete, and our product candidates may compete, against products or product candidates that offer higher rebates or discounts, exclusionary contracting, lower prices, equivalent or superior efficacy, better safety profiles, easier administration, earlier market availability or other competitive features. If we are unable to compete effectively, this could reduce sales, which could negatively impact our results of operations.\n In addition, competition from manufacturers of generic drugs, including from generic versions of competitors' branded products that lose their market exclusivity, is a major challenge for our branded products. Certain of our products have experienced significant generic competition over the last few years. We anticipate a more significant impact of reduced revenues from patent expiries in 2026 through 2030 as several of our in-line products experience patent-based expirations. See theItem 1. Business Patents and Other Intellectual Property Rightssection. In China, we expect to continue to face intense competition by certain generic manufacturers, which has resulted, and may result in the future, in price cuts and volume loss of some of our products.\n In addition, competition from manufacturers of generic drugs, including from generic versions of competitors' branded products that lose their market exclusivity, is a major challenge for our branded products. Certain of our products have experienced significant generic competition over the last few years. We anticipate a more significant impact of reduced revenues from patent expiries in 2026 through 2030 as several of our in-line products experience patent-based expirations. See the\n Item 1. Business Patents and Other Intellectua",
    "item7": "ITEM 7.MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \n ITEM 7.\n MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n GENERAL\n The following MD&A is intended to assist the reader in understanding our financial condition and results of operations, including an evaluation of the amounts and certainty of cash flows from operations and from outside sources, and is provided as a supplement to and should be read in conjunction with the consolidated financial statements and related notes inItem 8. Financial Statements and Supplementary Datain this Form 10-K. Discussions of 2021 items and year-to-year comparisons between 2022 and 2021 that are not included in this Form 10-K can be found within MD&A in our 2022 Form 10-K.\n The following MD&A is intended to assist the reader in understanding our financial condition and results of operations, including an evaluation of the amounts and certainty of cash flows from operations and from outside sources, and is provided as a supplement to and should be read in conjunction with the consolidated financial statements and related notes in\n Item 8. Financial Statements and Supplementary Data\n in this Form 10-K. Discussions of 2021 items and year-to-year comparisons between 2022 and 2021 that are not included in this Form 10-K can be found within MD&A in our 2022 Form 10-K.\n OVERVIEW OF OUR PERFORMANCE, OPERATING ENVIRONMENT, STRATEGY AND OUTLOOK\n Financial Highlights––The following is a summary of certain financial performance metrics (in billions, except per share data):\n Financial Highlights\n ––\n The following is a summary of certain financial performance metrics (in billions, except per share data):\n 2023 Total Revenues––$58.5 billion2023 Net Cash Flow from Operations––$8.7 billionA decrease of 42% compared to 2022A decrease of 70% compared to 2022\n 2023 Total Revenues––$58.5 billion2023 Net Cash Flow from Operations––$8.7 billion\n 2023 Total Revenues––$58.5 billion\n 2023 Net Cash Flow from Operations––$8.7 billion\n A decrease of 42% compared to 2022A decrease of 70% compared to 2022\n A decrease of 42% compared to 2022\n A decrease of 70% compared to 2022\n 2023 Reported Diluted EPS––$0.372023 Adjusted Diluted EPS (Non-GAAP)––$1.84*A decrease of 93% compared to 2022A decrease of 72% compared to 2022\n 2023 Reported Diluted EPS––$0.372023 Adjusted Diluted EPS (Non-GAAP)––$1.84*\n 2023 Reported Diluted EPS––$0.37\n 2023 Adjusted Diluted EPS (Non-GAAP)––$1.84*\n A decrease of 93% compared to 2022A decrease of 72% compared to 2022\n A decrease of 93% compared to 2022\n A decrease of 72% compared to 2022\n *For additional information regarding Adjusted diluted EPS (which is a non-GAAP financial measure), including reconciliations of certain GAAP Reported to non-GAAP Adjusted information, see theNon-GAAP Financial Measure: Adjusted Incomesection within MD&A.\n *\n For additional information regarding Adjusted diluted EPS (which is a non-GAAP financial measure), including reconciliations of certain GAAP Reported to non-GAAP Adjusted information, see the\n Non-GAAP Financial Measure: Adjusted Income\n section within MD&A.\n References to operational variances pertain to period-over-period changes that exclude the impact of foreign exchange rates. Although foreign exchange rate changes are part of our business, they are not within our control and since they can mask positive or negative trends in the business, we believe presenting operational variances excluding these foreign exchange changes provides useful information to evaluate our results.\n Our Business and Strategy––Pfizer Inc. is a research-based, global biopharmaceutical company. We apply science and our global resources to bring therapies to people that extend and significantly improve their lives. See theItem 1. Business––About Pfizersection. As a science-driven global biopharmaceutical company, we remain focused on advancing our pipeline, supporting our marketed brands and deploying capital responsibly, with a focus on initiatives that can help contribute to our long-term revenue and future growth. Most of our revenues come from the manufacture and sale of biopharmaceutical products. We believe that our medicines and vaccines provide significant value for healthcare providers and patients and continuously evaluate how we can best collaborate with patients, physicians and payors to support and expand patient access to reliable, affordable healthcare around the world. In addition, we continually seek to expand and broaden our product portfolio offerings through prioritized development of our pipeline and business development opportunities targeted at critical unmet patient needs. As a result, our commercial organizational structure and R&D operations are critical to the successful execution of our business strategy. Our ability to fulfill our purpose,Breakthroughs that change patients' lives, remains a core focus and underscores our commitment to addressing the needs of society to help sustain long-term value creation for all stakeholders. Our 2024 key priorities are:\n Our Business and Strategy\n Pfizer Inc. is a research-based, global biopharmaceutical company. We apply science and our global resources to bring therapies to people that extend and significantly improve their lives. See the\n Item 1. Business––About Pfizer\n Item 1. Business\n ––About Pfizer\n section. As a science-driven global biopharmaceutical company, we remain focused on advancing our pipeline, supporting our marketed brands and deploying capital responsibly, with a focus on initiatives that can help contribute to our long-term revenue and future growth. Most of our revenues come from the manufacture and sale of biopharmaceutical products. We believe that our medicines and vaccines provide significant value for healthcare providers and patients and continuously evaluate how we can best collaborate with patients, physicians and payors to support and expand patient access to reliable, affordable healthcare around the world. In addition, we continually seek to expand and broaden our product portfolio offerings through prioritized development of our pipeline and business development opportunities targeted at critical unmet patient needs. As a result, our commercial organizational structure and R&D operations are critical to the successful execution of our business strategy. Our ability to fulfill our purpose,\n Breakthroughs that change patients' lives\n , remains a core focus and underscores our commitment to addressing the needs of society to help sustain long-term value creation for all stakeholders. Our 2024 key priorities are:\n \"Achieve world-class oncology leadership\n \"\n Achieve world-class oncology leadership\n \"Deliver next wave of pipeline innovation\n Deliver next wave of pipeline innovation\n \"Maximize performance of our new products\n Maximize performance of our new products\n \"Expand margins by realigning our cost base\n Expand margins by realigning our cost base\n \"Allocate capital to enhance shareholder value\n Allocate capital to enhance shareholder value\n Pfizer Inc.2023 Form 10-K30\n Pfizer Inc.\n 2023 Form 10-K\n 30\n In 2023, we managed our commercial operations through a global structure consisting of two operating segments: Biopharma and Business Innovation. Biopharma was the only reportable segment. SeeNote 1Aand theItem 1. Business––Commercial Operationssection.\n In 2023, we managed our commercial operations through a global structure consisting of two operating segments: Biopharma and Business Innovation. Biopharma was the only reportable segment. See\n Note 1A\n and the\n Item 1. Business––Commercial Operations\n section.\n In December 2023, we completed our acquisition of Seagen. At the beginning of 2024, we made changes in our commercial organization that went into effect on January 1, 2024 to incorporate Seagen and improve focus, speed and execution. Specifically, within our Biopharma reportable segment we created:\n \"the Pfizer Oncolo",
    "item7a": "ITEM 7A.QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n \n ITEM 7A.\n QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n The information required by this Item is incorporated by reference to the discussion in theAnalysis of Financial Condition, Liquidity, Capital Resources and Market Risksection within MD&A.\n The information required by this Item is incorporated by reference to the discussion in the\n Analysis of Financial Condition, Liquidity, Capital Resources and Market Risk\n section within MD&A.\n Pfizer Inc.2023 Form 10-K49\n Pfizer Inc.\n 2023 Form 10-K\n 49\n"
}