{
    "cik": 1543151,
    "cusip6": "90353T",
    "cusip": [
        "90353T100"
    ],
    "names": [
        "UBER TECHNOLOGIES INC",
        "Uber Technologies Inc",
        "UBER TECHNOLOGIES INC COM",
        "UBER TECHNOLOGIES",
        "UBER TECHNOLOGIES INC",
        "Uber Technologies Inc - US",
        "Uber Inc",
        "UBER TECHNOLOGI",
        "UBER    TECHNOLOGIES       INC",
        "UBER TECHNOLOGIES INC",
        "UBER Technologies Inc.",
        "UBER TECHNOLOGIES, INC. CMN",
        "UBER",
        "UBER TECHNOLOGIES INC",
        "UMB FINANCIAL CORP",
        "Uber Technologies Inc.",
        "UBER TECHN",
        "Uber Technologies Inc",
        "Uber Tech",
        "UBER TECHNOLOGIES ORD SHS",
        "UBER TECH.",
        "UBER TECHNOLOGIES INC COM USD0.00001",
        "Uber Technologies, Inc.",
        "UBER TECHNOLOGIES INC COM",
        "UBER TECHNOLOGIES INC (NYS)",
        "UBER TECHNOLOGIES USD0.00001 Common Stock",
        "Uber Technologies Incorporated",
        "UBER TECHNOLOGIES INC.",
        "UBER TECHNOLOGIES  INC",
        "UBER TECHNOLOGIES ORD",
        "UBER TECHNOLOGIE",
        "UBER TECHNOLOGIES IN",
        "UBER TECHNOLOGIES INC",
        "Uber Technologies, Inc.",
        "UBER TECHNOLOGIES INC COM",
        "UBER TECHNOLOGIES INC",
        "BRISTOW GROUP IN",
        "UBER TECHNOLOGIES INC",
        "Uber Technologies Inc",
        "Uber",
        "UBER TECHNOLOGIES INC",
        "UBER TECHNOLOGIES INC",
        "UBER TECHNOLOGIES INC COM",
        "Uber Technologies INC CORP COMMON",
        "UBER, TECHNOLOGIES INC.",
        "Uber technologies inc",
        "UBER TECHNOLOGIES INC",
        "UBER TECHNOLOGIES INC        COM",
        "UBER TECHNOLOGIES INC       COM",
        "UBER TECHNOLOGIES INC UBER US",
        "Uber Technologies",
        "Uber Technologies INC",
        "UBERTECHNOLOGIES"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1543151/000154315124000012/uber-20231231.htm",
    "item1": "ITEM 1. BUSINESS\n Overview\n Uber Technologies, Inc. (\"Uber,\" \"we,\" \"our,\" or \"us\") is a technology platform that uses a massive network, leading technology, operational excellence and product expertise to power movement from point A to point B. We develop and operate proprietary technology applications supporting a variety of offerings on our platform (\"platform(s)\" or \"Platform(s)\"). We connect consumers (\"Rider(s)\") with independent providers of ride services (\"Mobility Driver(s)\") for ridesharing services, and connect Riders and other consumers (\"Eater(s)\") with restaurants, grocers and other stores (collectively, \"Merchants\") with delivery service providers (\"Couriers\") for meal preparation, grocery and other delivery services. Riders and Eaters are collectively referred to as \"end-user(s)\" or \"consumer(s).\" Mobility Drivers and Couriers are collectively referred to as \"Driver(s).\" We also connect consumers with public transportation networks. We use this same network, technology, operational excellence and product expertise to connect shippers (\"Shipper(s)\") with carriers (\"Carrier(s)\") in the freight industry by providing Carriers with the ability to book a shipment, transportation management and other logistics services. Uber is also developing technologies designed to provide new solutions to solve everyday problems.\n Our technology is available in approximately 70 countries around the world, principally in the United States (\"U.S.\") and Canada, Latin America, Europe (excluding Russia), the Middle East, Africa, and Asia (excluding China and Southeast Asia).\n Our Segments\n As of December 31, 2023, we had three operating and reportable segments: Mobility, Delivery and Freight. Mobility, Delivery and Freight platform offerings each address large, fragmented markets.\n Mobility\n Our Mobility offering connects consumers with a wide range of transportation modalities, such as ridesharing, carsharing, micromobility, rentals, public transit, taxis, and more helping customers go almost anywhere they need. We believe our global leadership position and the vast amount of marketplace data that comes along with it means that we have the best technical and data platform to innovate faster than other companies with similar products.\n We believe our scale and global availability allows our Mobility segment to offer better consumer experiences to riders in a variety of vehicle types, providing consumers with higher reliability and Drivers with better earnings opportunities. Mobility also includes activity related to our financial partnerships products and advertising. We also participate in certain regions through our minority-owned entities.\n Delivery\n Our Delivery offering allows consumers to search for and discover the best of local commerce from restaurants to grocery, alcohol, convenience and other retailers order a meal or other items, and either pick-up at the restaurant or have it delivered. We refer to the grocery, alcohol, convenience, and retail categories collectively as Grocery & Retail. After launching our Delivery app, Uber Eats, over eight years ago, we believe our Delivery offering increases consumer engagement with the Uber platform overall, which in turn results in broader reach for our Merchants who can attract Uber Eats consumers from Uber without increasing their own costs. For Drivers, we believe the Delivery offering leverages, and has expanded, our earner base by increasing utilization and earnings across the network. We also believe it also attracts new Drivers to the platform who do not have access to Mobility-qualified vehicles. Over the last several years, our Delivery business has expanded to include Uber Direct, our white-label Delivery-as-a-Service offering to retailers and restaurants around the world, as well as advertising opportunities.\n Freight\n We believe that Freight is revolutionizing the logistics industry. Freight powers a managed transportation and logistics network and connects Shippers and Carriers in a digital marketplace to move shipments while leveraging our proprietary technology, brand awareness, and experience revolutionizing industries. Freight provides an on-demand platform to automate and accelerate logistics transactions end-to-end while providing visibility and control of logistics networks. Freight connects Carriers with Shippers' shipments available on our platform, and gives Carriers upfront, transparent pricing and the ability to book a shipment with the touch of a button. Freight serves Shippers ranging from small- and medium-sized businesses to global enterprises. By leveraging logistics solutions expertise and value-add solutions, Freight enables Shippers to create and tender shipments, secure capacity on demand with real-time pricing, and track those shipments from pickup to delivery. Freight operations are principally based in North America and Europe. We believe that all of these factors represent significant efficiency improvements over traditional transportation management and freight brokerage providers.\n Platform Synergies\n Our Platform\n The foundation of our platform is our massive network, leading technology, operational excellence, and product expertise.\n 4\n \n Together, these elements power movement from point A to point B.Massive NetworkOur massive, efficient, and intelligent network consists of tens of millions of Drivers, consumers, Merchants, Shippers and Carriers, as well as underlying data, technology, and shared infrastructure. Our network becomes smarter with every trip. In more than 10,000 cities around the world (as of December 31, 2023), our network powers movement at the touch of a button for millions, and we hope eventually billions, of people.Leading TechnologyWe have built proprietary marketplace, routing, and payments technologies. Marketplace technologies are the core of our deep technology advantage and include demand prediction, matching and dispatching, and pricing technologies. Our technologies make it extremely efficient to launch new businesses and operationalize existing ones.Operational ExcellenceOur regional on-the-ground operations teams use their extensive market-specific knowledge to rapidly launch and scale products in cities, support Drivers, consumers, Merchants, Shippers, and Carriers, and build and enhance relationships with cities and regulators.Product ExpertiseOur products are built with the expertise that allows us to set the standard for powering movement on-demand, provide platform users with a contextual, intuitive interface, continually evolve features and functionality, and deliver safety and trust.\n Together, these elements power movement from point A to point B.\n Massive NetworkOur massive, efficient, and intelligent network consists of tens of millions of Drivers, consumers, Merchants, Shippers and Carriers, as well as underlying data, technology, and shared infrastructure. Our network becomes smarter with every trip. In more than 10,000 cities around the world (as of December 31, 2023), our network powers movement at the touch of a button for millions, and we hope eventually billions, of people.Leading TechnologyWe have built proprietary marketplace, routing, and payments technologies. Marketplace technologies are the core of our deep technology advantage and include demand prediction, matching and dispatching, and pricing technologies. Our technologies make it extremely efficient to launch new businesses and operationalize existing ones.Operational ExcellenceOur regional on-the-ground operations teams use their extensive market-specific knowledge to rapidly launch and scale products in cities, support Drivers, consumers, Merchants, Shippers, and Carriers, and build and enhance relationships with cities and regulators.Product ExpertiseOur products are built with the expertise that allows us to set the standard for powering movement on-demand, provide platform users with a contextual, intuitive interface, continually evolve features and func",
    "item1a": "ITEM 1A. RISK FACTORS\n Certain factors may have a material adverse effect on our business, financial condition, and results of operations. You should carefully consider the following risks, together with all of the other information contained in this Annual Report on Form 10-K, including the sections titled \"Special Note Regarding Forward-Looking Statements\" and \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and our financial statements and the related notes included elsewhere in this Annual Report on Form 10-K. Any of the following risks could have an adverse effect on our business, financial condition, operating results, or prospects and could cause the trading price of our common stock to decline, which would cause you to lose all or part of your investment. Our business, financial condition, operating results, or prospects could also be harmed by risks and uncertainties not currently known to us or that we currently do not believe are material.\n Risk Factor Summary\n The following are some of these risks, any of which could have an adverse effect on our business financial condition, operating results, or prospects.\n \"Our business would be adversely affected if Drivers were classified as employees, workers or quasi-employees instead of independent contractors.\n \"\n Our business would be adversely affected if Drivers were classified as employees, workers or quasi-employees instead of independent contractors.\n \"The mobility, delivery, and logistics industries are highly competitive, with well-established and low-cost alternatives that have been available for decades, low barriers to entry, low switching costs, and well-capitalized competitors in nearly every major geographic region.\n The mobility, delivery, and logistics industries are highly competitive, with well-established and low-cost alternatives that have been available for decades, low barriers to entry, low switching costs, and well-capitalized competitors in nearly every major geographic region.\n \"To remain competitive in certain markets, we have in the past lowered, and may continue to lower, fares or service fees, and we have in the past offered, and may continue to offer, significant Driver incentives and consumer discounts and promotions.\n To remain competitive in certain markets, we have in the past lowered, and may continue to lower, fares or service fees, and we have in the past offered, and may continue to offer, significant Driver incentives and consumer discounts and promotions.\n \"We have incurred significant losses since inception, including in the United States and other major markets. We expect our operating expenses to increase in the foreseeable future, and we may not achieve or maintain profitability.\n We have incurred significant losses since inception, including in the United States and other major markets. We expect our operating expenses to increase in the foreseeable future, and we may not achieve or maintain profitability.\n \"If we are unable to attract or maintain a critical mass of Drivers, consumers, merchants, Shippers, and Carriers, whether as a result of competition or other factors, our platform will become less appealing to platform users.\n If we are unable to attract or maintain a critical mass of Drivers, consumers, merchants, Shippers, and Carriers, whether as a result of competition or other factors, our platform will become less appealing to platform users.\n \"Our business depends on retaining and attracting high-quality personnel, and continued attrition, future attrition, or unsuccessful succession planning could adversely affect our business.\n Our business depends on retaining and attracting high-quality personnel, and continued attrition, future attrition, or unsuccessful succession planning could adversely affect our business.\n \"Maintaining and enhancing our brand and reputation is critical to our business prospects. We receive significant media coverage, including negative publicity regarding our brand and reputation, and while we have taken significant steps to rehabilitate our brand and reputation, failure to maintain and enhance our brand and reputation will cause our business to suffer.\n Maintaining and enhancing our brand and reputation is critical to our business prospects. We receive significant media coverage, including negative publicity regarding our brand and reputation, and while we have taken significant steps to rehabilitate our brand and reputation, failure to maintain and enhance our brand and reputation will cause our business to suffer.\n \"Our historical workplace culture and forward-leaning approach created operational, compliance, and cultural challenges and our efforts to address these challenges may not be successful.\n Our historical workplace culture and forward-leaning approach created operational, compliance, and cultural challenges and our efforts to address these challenges may not be successful.\n \"If we are unable to optimize our organizational structure or effectively manage our growth, our financial performance and future prospects will be adversely affected.\n If we are unable to optimize our organizational structure or effectively manage our growth, our financial performance and future prospects will be adversely affected.\n \"Platform users may engage in, or be subject to, criminal, violent, inappropriate, or dangerous activity that results in major safety incidents, which may harm our ability to attract and retain Drivers, consumers, merchants, Shippers, and Carriers.\n Platform users may engage in, or be subject to, criminal, violent, inappropriate, or dangerous activity that results in major safety incidents, which may harm our ability to attract and retain Drivers, consumers, merchants, Shippers, and Carriers.\n \"We are making substantial investments in new offerings and technologies, and may increase such investments in the future. These new ventures are inherently risky, and we may never realize any expected benefits from them.\n We are making substantial investments in new offerings and technologies, and may increase such investments in the future. These new ventures are inherently risky, and we may never realize any expected benefits from them.\n \"We generate a significant percentage of our Gross Bookings from trips in large metropolitan areas, and these operations may be negatively affected by economic, social, weather, and regulatory conditions, public health concerns or other circumstances.\n We generate a significant percentage of our Gross Bookings from trips in large metropolitan areas, and these operations may be negatively affected by economic, social, weather, and regulatory conditions, public health concerns or other circumstances.\n \"We may fail to offer autonomous vehicle technologies on our platform, fail to offer such technologies on our platform before our competitors, or such technologies may fail to perform as expected, may be inferior to those offered by our competitors, or may be perceived as less safe than those offered by competitors or non-autonomous vehicles.\n We may fail to offer autonomous vehicle technologies on our platform, fail to offer such technologies on our platform before our competitors, or such technologies may fail to perform as expected, may be inferior to those offered by our competitors, or may be perceived as less safe than those offered by competitors or non-autonomous vehicles.\n \"We have experienced and may experience security or data privacy breaches or other unauthorized or improper access to, use of, alteration of or destruction of our proprietary or confidential data, employee data, or platform user data.\n We have experienced and may experience security or data privacy breaches or other unauthorized or improper access to, use of, alteration of or destruction of our proprietary or confidential data, employee data, or platform user data.\n \"Cyberattacks, including computer malware, ransomware, viruses, denial of service attacks, spamming",
    "item7": "ITEM 1B. UNRESOLVED STAFF COMMENTS\n Not applicable.\n \n ITEM 1C. CYBERSECURITY\n Safeguarding our critical networks and the information that platform users share with us is vital to our business. One key way that Uber addresses this need is through its cybersecurity risk management program (\"Cybersecurity Program\").\n Uber's Chief Information Security Officer (\"CISO\") is responsible for the Cybersecurity Program, which is coordinated and primarily executed by the global organization of engineers focused on risk management using the NIST Framework (Identify, Protect, Detect, Respond, and Recover) and activities such as automation, secure development, and advanced analytics and monitoring. The CISO has served in such role since February 2021 and has more than 20+ years of engineering and/or cybersecurity experience, including previously as CISO and Deputy Chief Technology Officer at a Fortune 500 company.\n The Cybersecurity Program is also supported by Uber's Chief Privacy Officer and Associate General Counsel, Privacy & Cybersecurity (\"CPO\"), who has served in that role since August 2018. The CPO has three decades of experience as a legal advisor to\n 45\n multinational corporations, including serving as Chief Privacy & Security Counsel for a Fortune 100 technology company prior to her role at Uber.\n The Cybersecurity Program is supported by other members of Uber's senior management team as well, including the Chief Legal Officer, Head of Platform Engineering, and EU Data Protection Officer. Uber's Board of Directors oversees the Cybersecurity Program through regular updates.\n This Cybersecurity Program is a critical component of Uber's enterprise risk management program, through which Uber reviews business, cybersecurity, information technology, privacy, legal, and geopolitical risks, among others. The Cybersecurity Program is designed to assess, identify, and manage risks from cybersecurity threats.\n Key elements of this program include:\n \"Oversight and Governance. Uber's Board oversees the Cybersecurity Program, and Uber's risk profile with respect to cybersecurity matters, through regular reports and reviews. These include presentations by the CISO to the Board and Audit Committee on an alternating quarterly basis, quarterly reports of certain cybersecurity incidents to the Board, and annual reports by the CPO to the Board.\n \"\n Oversight and Governance\n . Uber's Board oversees the Cybersecurity Program, and Uber's risk profile with respect to cybersecurity matters, through regular reports and reviews. These include presentations by the CISO to the Board and Audit Committee on an alternating quarterly basis, quarterly reports of certain cybersecurity incidents to the Board, and annual reports by the CPO to the Board.\n The CISO also provides quarterly updates to Uber's senior management regarding cybersecurity risks, as well as interim updates during regular meetings with Uber's engineering, product and internal audit leadership. The CISO and CPO also jointly chair Uber's Privacy and Cybersecurity Council, which provides a venue for cross-functional insight and input into the Cybersecurity Program and our privacy program as they relate to Uber's business operations.\n \"Internally conducted environment and vulnerability assessments.These include semi-annual assessments performed by Uber's security engineering teams. The findings from these assessments are reported to Uber's senior management, including the CISO, and the Board or Audit Committee. In addition, our internal audit function periodically conducts additional reviews and assessments, which are reported to the Audit Committee.\n Internally conducted environment and vulnerability assessments.\n These include semi-annual assessments performed by Uber's security engineering teams. The findings from these assessments are reported to Uber's senior management, including the CISO, and the Board or Audit Committee. In addition, our internal audit function periodically conducts additional reviews and assessments, which are reported to the Audit Committee.\n \"Independent third-party audits and assessments by industry-leading firms. These include regular assessments of Uber's information systems, business systems and cybersecurity infrastructure; reviews to identify opportunities to strengthen Uber's cybersecurity posture; and cybersecurity audits for purposes of maintaining Uber's Payment Cards Industry (PCI), ISO 27001 and 27002, and SOC1 and SOC2 certifications.\n Independent third-party audits and assessments by industry-leading firms\n . These include regular assessments of Uber's information systems, business systems and cybersecurity infrastructure; reviews to identify opportunities to strengthen Uber's cybersecurity posture; and cybersecurity audits for purposes of maintaining Uber's Payment Cards Industry (PCI), ISO 27001 and 27002, and SOC1 and SOC2 certifications.\n \"Cyber incident management. This includes efforts by Uber's security engineering team, at the direction of the CISO, to review potential incidents identified by Uber's internal teams, Uber's third-party service providers or external researchers through Uber's Bug Bounty program; identify those which represent potential or actual threats to Uber's systems, data or users; investigate and mitigate the cause and impact of such incidents; and implement safeguards to help prevent recurrence. Uber's CPO and legal team support such efforts, including in connection with legal or disclosure obligations triggered in connection with any such incidents.\n Cyber incident management\n . This includes efforts by Uber's security engineering team, at the direction of the CISO, to review potential incidents identified by Uber's internal teams, Uber's third-party service providers or external researchers through Uber's Bug Bounty program; identify those which represent potential or actual threats to Uber's systems, data or users; investigate and mitigate the cause and impact of such incidents; and implement safeguards to help prevent recurrence. Uber's CPO and legal team support such efforts, including in connection with legal or disclosure obligations triggered in connection with any such incidents.\n \"Third Party Risk Management. Uber performs due diligence regarding its third-party suppliers, service providers and business partners. This includes requiring submission of evidence demonstrating third parties' ability to meet Uber's cybersecurity and data handling requirements. In addition, Uber's third-party suppliers and service providers who process Uber personal data are contractually obligated to notify Uber if they experience certain incidents impacting Uber personal data.\n Third Party Risk Management\n . Uber performs due diligence regarding its third-party suppliers, service providers and business partners. This includes requiring submission of evidence demonstrating third parties' ability to meet Uber's cybersecurity and data handling requirements. In addition, Uber's third-party suppliers and service providers who process Uber personal data are contractually obligated to notify Uber if they experience certain incidents impacting Uber personal data.\n For a discussion regarding risks from cybersecurity threats, see our risk factors, including the risk factors titled \" We have experienced, and may experience security or privacy breaches or other unauthorized or improper access to, use of, disclosure of, alteration of or destruction of our proprietary or confidential data, employee data, or platform user data, which could cause loss of revenue, harm to our brand, business disruption, and significant liabilities\", \" Cyberattacks, including computer malware, ransomware, viruses, denial of service attacks, spamming, phishing and social engineering attacks could harm our reputation, business, and operating results\", \" We currently are subject to a number of inquiries, investigations, and requests for information from the DOJ, other federal, state and local gover",
    "item7a": "ITEM 7A. QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n We are exposed to market risks in the ordinary course of our business. These risks primarily include interest rate risk, investment risk, and foreign currency risk as follows:\n Interest Rate Risk\n Our exposures to market risk for changes in interest rates relate primarily to our 2030 Refinanced Term Loans. The 2030 Refinanced Term Loans represent floating rate notes and are carried at amortized cost. Therefore, fluctuations in interest rates will impact our consolidated financial statements. The interest rate for the 2030 Refinanced Term Loans is SOFR plus 2.75% per annum, subject to a floor of 0.00%. There is no cap on the interest rate associated with the 2030 Refinanced Term Loans. A rising interest rate environment will increase the amount of interest paid on the 2030 Refinanced Term Loans. A hypothetical 100 basis point increase or decrease in interest rates would not have a material effect on our financial results.\n The fair value of our fixed rate notes will generally fluctuate with movements of interest rates, increasing in periods of declining rates of interest and declining in periods of increasing rates of interest. A hypothetical 100 basis point increase in interest rates would have decreased the fair value of our notes by $231 million as of December 31, 2023.\n Investment Risk\n Our investment policy limits the amount of credit exposure with any one financial institution or commercial issuer. Cash deposits typically exceed insured limits and are placed with financial institutions around the world that we believe are of high credit quality. These deposits are in excess of the Federal Deposit Insurance Corporation (\"FDIC\") insurance limits. There can be no assurance that our deposits in excess of the FDIC limits will be backstopped by the U.S., or that any bank or financial institution with which we do business will be able to obtain needed liquidity from other banks, government institutions or by acquisition in the event of a failure or liquidity crisis.\n Our investment policy objective aims to preserve capital and meet liquidity requirements without significantly increasing risk. We had cash and cash equivalents including restricted cash and cash equivalents totaling $6.7 billion and $7.0 billion as of December 31, 2022 and December 31, 2023, respectively. Marketable debt securities classified as restricted investments and short-term investments totaled $5.5 billion as of December 31, 2023. As of December 31, 2023, our cash, cash equivalents, and marketable debt securities primarily consist of money market funds, cash deposits, U.S. government securities, U.S. government agency securities, and investment-grade corporate debt securities. We do not enter into investments for trading or speculative purposes. Investments in fixed rate securities carry a degree of interest rate risk. Changes in rates would primarily impact interest income due to the relatively short-term nature of our investments. A hypothetical 100 basis point change in interest rates would not have a material effect on our financial results.\n We are exposed to certain risks related to the carrying amounts of investments in other companies, including our minority-owned, privately-held entities and public companies, compared to their fair value. We hold privately held investments in illiquid private company stock which are inherently difficult to value given the lack of publicly available information. We also hold equity securities with readily determinable fair values which are subject to equity price risk. These investments in privately-held entities and public companies may increase the volatility in our net income/(loss) in future periods due to changes in the fair value of these investments. In certain cases, our ability to sell these investments may be impacted by contractual obligations to hold the securities for a set period of time after a public offering. As of December 31, 2023, the carrying value of these investments was $6.5 billion, including equity method investments.\n Foreign Currency Risk\n We transact business globally in multiple currencies. Our international revenue, as well as costs and expenses denominated in foreign currencies, expose us to the risk of fluctuations in foreign currency exchange rates against the U.S. dollar. We are exposed to foreign currency risks related to our revenue and operating expenses denominated in currencies other than the U.S. dollar. Accordingly, changes in exchange rates may negatively affect our future revenue and other operating results as expressed in U.S. dollars. Our foreign currency risk is partially mitigated as our revenue recognized in currencies other than the U.S. dollar is diversified across geographic regions and we incur expenses in the same currencies in such regions.\n 68\n \n We have experienced and will continue to experience fluctuations in our net income/(loss) as a result of transaction gains or (losses) related to remeasurement of our asset and liability balances that are denominated in currencies other than the functional currency of the entities in which they are recorded. At this time, we do not, but we may in the future, enter into derivatives or other financial instruments in an attempt to hedge our foreign currency exchange risk.\n 69\n"
}