{
    "cik": 104169,
    "cusip6": "931142",
    "cusip": [
        "931142103"
    ],
    "names": [
        "WAL-MART INC",
        "WALMART INC COM",
        "WALMART INC",
        "Walmart Inc",
        "Walmart Stores Inc",
        "WAL MART STORES INC",
        "WAL-MART STORES INC",
        "Wal Mart Stores",
        "Wal-Mart Stores Inc",
        "WAL MART STORES, INC.",
        "Wal Mart Stores Inc",
        "WAL MART STORES",
        "WALMART, INC.",
        "WALMART INC.",
        "WALMART INC",
        "Walmart",
        "WAL-MART STORES INC",
        "Walmart Inc - US",
        "Wal-Mart Stores",
        "Wal-Mart Stores Inc.",
        "WalMart Inc",
        "Wal-Mart Inc",
        "WAL-MART STORES",
        "WALMART",
        "WALMART INC CMN",
        "WALMART STORES INC",
        "WALMART      INC",
        "Wal-Mart Stores",
        "Walmart, Inc.",
        "WALMART INC",
        "Wal Mart Stores Incorporated",
        "WALMART INC",
        "Walmart Inc.",
        "WALMART",
        "WAL-MART",
        "WAYFAIR INC",
        "Wal-Mart Stores",
        "Wal Mart Stores Inc.",
        "Wal-Mart Stores Inc (wmt)",
        "WAL-MART STORES INC COM",
        "WAL MART INC.",
        "Walmart Inc",
        "WALMART INC",
        "WALMART INCORPORATED",
        "WAL MART STORES INC COM",
        "Wal-Mart",
        "WALMART INC",
        "WAL MART STORES INC",
        "WALMART ORD (NYS)",
        "WALMART INC COMMON STOCK",
        "Wal-Mart Stores, Inc.",
        "WAL-MART STORES INC USD0.1 Common Stock",
        "WALMART INC",
        "WAL-MART S",
        "WALMART ORD",
        "WALMART  INC",
        "Wal Mart Stores, Inc.",
        "WALMART STORES INC COM",
        "Wal-Mart, Inc.",
        "WALMART INC.",
        "WALMART",
        "WAL-MART, INC.",
        "WALMART INC",
        "VICI Properties Inc Ordinary Shares",
        "WALMART INC",
        "WalMart Inc.",
        "WalMart St",
        "Wal-Mart Stores Inc.",
        "WALMART INC",
        "WALMART INC                 COM",
        "WMT",
        "Wal-Mart Stores Inc",
        "WALMART STORES INC.",
        "Wal-Mart Stores Inc.",
        "WALMART INC COMMON STOCK",
        "WAL MART STORES, INC",
        "Walmart Inc Com",
        "WALMART INC COM",
        "WAL MART",
        "WAL-MART STORES, INC",
        "WAL-MART STORES INC",
        "Wal Mart Inc",
        "WAL-MART STORES INC.",
        "WAL MART STORES INC         COM",
        "Walmart, Inc",
        "WALMART INC",
        "WalMart, Inc.",
        "Wal Mart Inc.",
        "WAL MART STORES INC",
        "Walmart inc",
        "Wal-Mart Inc.",
        "Wal Mart Stores Inc Com",
        "Walmart Inc",
        "WAL MART INC                COM",
        "WALMART INC                  COM",
        "Wal-Mart Stores, Inc",
        "Wal Mart  Inc",
        "WAL-MART STORES COMMON",
        "WALMART INC                         C",
        "Wal-MartStoresInc",
        "WAL-MART STORES INC         COM",
        "WALMARTSTORE",
        "Wal-Mart Stores Inc Com",
        "WalMart Inc. (WMT)"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/104169/000010416924000056/wmt-20240131.htm",
    "item1": "ITEM 1.BUSINESS\n \n ITEM 1.\n BUSINESS\n General\n Walmart Inc. (\"Walmart,\" the \"Company\" or \"we\") is a people-led, technology-powered omni-channel retailer dedicated to helping people around the world save money and live better – anytime and anywhere – by providing the opportunity to shop in both retail stores and through eCommerce, and to access our other service offerings.  Through innovation, we strive to continuously improve a customer-centric experience that seamlessly integrates our eCommerce and retail stores in an omni-channel offering that saves time for our customers.  Each week, we serve approximately 255 million customers who visit more than 10,500 stores and numerous eCommerce websites in 19 countries.\n Our strategy is to make every day easier for busy families, operate with discipline, sharpen our culture and become more digital, and make trust a competitive advantage.  Making life easier for busy families includes our commitment to price leadership, which has been and will remain a cornerstone of our business, as well as increasing convenience to save our customers time.  By leading on price, we earn the trust of our customers every day by providing a broad assortment of quality merchandise and services at everyday low prices (\"EDLP\").  EDLP is our pricing philosophy under which we price items at a low price every day so our customers trust that our prices will not change under frequent promotional activity.  Everyday low cost (\"EDLC\") is our commitment to control expenses so our cost savings can be passed along to our customers.\n Our operations comprise three reportable segments: Walmart U.S., Walmart International and Sam's Club.  Our fiscal year ends on January 31 for our United States (\"U.S.\") and Canadian operations.  We consolidate all other operations generally using a one-month lag and on a calendar year basis.  Our discussion is as of, and for the fiscal years ended, January 31, 2024 (\"fiscal 2024\"), January 31, 2023 (\"fiscal 2023\") and January 31, 2022 (\"fiscal 2022\").  During fiscal 2024, we generated total revenues of $648.1 billion, which was comprised primarily of net sales of $642.6 billion.\n We maintain our principal offices in Bentonville, Arkansas.  Our common stock trades on the New York Stock Exchange under the symbol \"WMT.\"\n The Development of Our Company\n The businesses conducted by our founders began in 1945 when Sam M. Walton opened a franchise Ben Franklin variety store in Newport, Arkansas.  In 1946, his brother, James L. Walton, opened a similar store in Versailles, Missouri.  Until 1962, our founders' business was devoted entirely to the operation of variety stores, at which time we began to open discount stores. We completed our initial public offering in 1970.  In 1983, we opened our first Sam's Club, and in 1988, we opened our first supercenter.  In 1998, we opened our first Walmart Neighborhood Market.  In 1991, we began our first international initiative when we entered into a joint venture in Mexico and, as of January 31, 2024, our Walmart International segment conducted business in 18 countries.\n In 2000, we began our first eCommerce initiative by creating both walmart.com and samsclub.com.  Since then, our eCommerce presence has continued to grow.  In 2007, leveraging our physical stores, walmart.com launched its Site-to-Store service, enabling customers to make a purchase online and pick up merchandise in stores.  To date, we now have over 8,000 pickup and over 7,800 delivery locations globally.  In recent years, we expanded our eCommerce and digital presence through acquisitions with our majority stakes in Flipkart and PhonePe in India.  We continue to heavily invest in omni-channel and eCommerce innovation, which enables us to leverage technology, talent and expertise, and expand our assortment and service offerings.\n We are enhancing our omni-channel capabilities through a combination of stores, eCommerce websites and service offerings, as well as our supply chain, combined with approximately 2.1 million associates as of January 31, 2024, to better serve our customers.  Together, these elements produce a global retail ecosystem that we believe allows customers to view Walmart as their primary retail destination.  In the U.S., our Walmart+ membership incorporates several service offerings which provide enhanced omni-channel shopping experiences and benefits for members.  As we execute on our strategy globally, our business is expanding through offerings such as advertising, marketplace and fulfillment services, healthcare and financial services.  These offerings represent mutually reinforcing pieces of our omni-channel model centered on our customers around the world who are increasingly seeking convenience.\n 6\n Information About Our Segments\n We are engaged in global operations of retail, wholesale and other units, as well as eCommerce, located throughout the U.S., Africa, Canada, Central America, Chile, China, India and Mexico.  We also previously operated in the United Kingdom and Japan prior to the sale of those operations in the first quarter of fiscal 2022.  Refer toNote 12to our Consolidated Financial Statements for information on these divestitures.  Our operations are conducted in three reportable segments: Walmart U.S., Walmart International and Sam's Club, which are further described below.  Each segment contributes to the Company's operating results differently.  However, each has generally maintained a consistent contribution rate to the Company's net sales in recent years other than minor changes to the contribution rate for the Walmart International segment due to the exit of certain markets and fluctuations in currency exchange rates.  Additional information on our operating segments and geographic information is contained inNote 13to our Consolidated Financial Statements.\n We are engaged in global operations of retail, wholesale and other units, as well as eCommerce, located throughout the U.S., Africa, Canada, Central America, Chile, China, India and Mexico.  We also previously operated in the United Kingdom and Japan prior to the sale of those operations in the first quarter of fiscal 2022.  Refer to\n Note 12\n to our Consolidated Financial Statements for information on these divestitures.  Our operations are conducted in three reportable segments: Walmart U.S., Walmart International and Sam's Club, which are further described below.  Each segment contributes to the Company's operating results differently.  However, each has generally maintained a consistent contribution rate to the Company's net sales in recent years other than minor changes to the contribution rate for the Walmart International segment due to the exit of certain markets and fluctuations in currency exchange rates.  Additional information on our operating segments and geographic information is contained in\n Note 13\n to our Consolidated Financial Statements.\n Walmart U.S. Segment\n Walmart U.S. is our largest segment and operates in the U.S., including in all 50 states, Washington D.C. and Puerto Rico. Walmart U.S. is a mass merchandiser of consumer products, operating under the \"Walmart\" and \"Walmart Neighborhood Market\" brands, including walmart.com.  Walmart U.S. had net sales of $441.8 billion for fiscal 2024, representing 69% of our fiscal 2024 consolidated net sales, and had net sales of $420.6 billion and $393.2 billion for fiscal 2023 and 2022, respectively.  Of our three segments, Walmart U.S. has historically had the highest gross profit as a percentage of net sales (\"gross profit rate\").  In addition, Walmart U.S. has historically contributed the greatest amount to the Company's net sales and operating income.\n Omni-channel.Walmart U.S. provides an omni-channel experience to customers, integrating retail stores and eCommerce, through services such as pickup and delivery, in-home delivery, ship-from-store and digital pharmacy fulfillment options.  As of January 31, 2024, the vast majority of our stores ha",
    "item1a": "ITEM 1A.RISK FACTORS\n \n ITEM 1A.\n RISK FACTORS\n The risks described below could, in ways we may or may not be able to accurately predict, materially and adversely affect our business, results of operations, financial position and liquidity.  Our business operations could also be affected by additional factors that apply to all companies operating in the U.S. and globally. The following risk factors do not identify all risks that we may face.\n Strategic Risks\n Failure to successfully execute our omni-channel strategy and the cost of our investments in eCommerce and technology may materially adversely affect our market position, net sales and financial performance.\n The retail business continues to rapidly evolve and consumers increasingly embrace digital shopping.  As a result, the portion of total consumer expenditures with retailers and wholesale clubs occurring through digital platforms is increasing and the pace of this increase could continue to accelerate.\n Our strategy, which includes investments in eCommerce, technology, including the use of artificial intelligence technology, talent, supply chain automation, acquisitions, joint ventures, store remodels and other customer initiatives may not adequately or effectively allow us to continue to grow our eCommerce business, increase comparable sales, maintain or grow our overall market position or otherwise offset the impact on the growth of our business of a moderated pace of new store and club openings and sustain the current pace of remodels.  The success of this strategy will depend in large measure on our ability to continue building and delivering a seamless omni-channel shopping experience and interconnected ecosystem for our customers that deepens and maintains our relationships with our customers across our various businesses and partnerships and reinforces our overall enterprise strategy. The success of this strategy is further subject to the related risks discussed in thisItem 1A.  With the interconnected components of this enterprise strategy and an increasing allocation of capital expenditures focused on these initiatives, changes in customer or member perceptions about our reputation or our failure to successfully execute on individual components of this strategy may adversely affect our market position, net sales and financial performance, which could also result in impairment charges to intangible assets or other long-lived assets.  In addition, a greater concentration of eCommerce sales, including increasing online grocery sales, could result in a reduction in the amount of traffic in our stores and clubs, which would, in turn, reduce the opportunities for cross-store or cross-club sales of merchandise that such traffic creates and could reduce our sales within our stores and clubs and materially adversely affect our financial performance.\n Our strategy, which includes investments in eCommerce, technology, including the use of artificial intelligence technology, talent, supply chain automation, acquisitions, joint ventures, store remodels and other customer initiatives may not adequately or effectively allow us to continue to grow our eCommerce business, increase comparable sales, maintain or grow our overall market position or otherwise offset the impact on the growth of our business of a moderated pace of new store and club openings and sustain the current pace of remodels.  The success of this strategy will depend in large measure on our ability to continue building and delivering a seamless omni-channel shopping experience and interconnected ecosystem for our customers that deepens and maintains our relationships with our customers across our various businesses and partnerships and reinforces our overall enterprise strategy. The success of this strategy is further subject to the related risks discussed in this\n Item 1A\n .  With the interconnected components of this enterprise strategy and an increasing allocation of capital expenditures focused on these initiatives, changes in customer or member perceptions about our reputation or our failure to successfully execute on individual components of this strategy may adversely affect our market position, net sales and financial performance, which could also result in impairment charges to intangible assets or other long-lived assets.  In addition, a greater concentration of eCommerce sales, including increasing online grocery sales, could result in a reduction in the amount of traffic in our stores and clubs, which would, in turn, reduce the opportunities for cross-store or cross-club sales of merchandise that such traffic creates and could reduce our sales within our stores and clubs and materially adversely affect our financial performance.\n Furthermore, the cost of certain investments in eCommerce, technology, talent and automation, including any operating losses incurred for those initiatives, will adversely impact our financial performance in the short-term and failure to realize the benefits of these investments may adversely impact our financial performance over the longer term.\n If we do not timely identify or effectively respond to consumer trends or preferences, it could negatively affect our relationship with our customers, demand for the products and services we sell, our market share and the growth of our business.\n It is difficult to predict consistently and successfully the products and services our customers will demand and changes in their shopping patterns, tastes and preferences.  The success of our business depends in part on how accurately we predict consumer demand, availability of merchandise, the related impact on the demand for existing products and services and the competitive environment. Our business is dependent on our ability to make critical decisions and predictions with respect to merchandise categories that quickly respond to changing consumer spending patterns, tastes and preferences, any incorrect calculations by us may result in lower sales, spoilage and inventory markdowns, which could adversely impact our results of operations. Our ability to predict and adapt to changing tastes and preferences depends on many factors, including obtaining accurate and\n 15\n relevant data on customer preferences, emphasizing relevant merchandise categories, effectively managing our inventory levels, and implementing competitive and effective pricing and promotion strategies.  Price transparency, assortment of products, customer experience, convenience, ease and the speed and cost of shipping are of primary importance to customers and continue to increase in importance, particularly as a result of digital tools and social media available to consumers and the choices available to consumers for purchasing products.  We must continue to preserve our reputation, which is impacted based on public perceptions. It may be difficult to address negative publicity across media channels, regardless of whether it is accurate.  Negative incidents involving us, our workforce (including the loss of merchandise as a result of shrink or theft) or others with whom we do business could quickly erode trust and confidence in our business and could result in consumer boycotts, workforce unrest and government investigations. Negative reputational incidents or negative perceptions of us could adversely impact our business and results of operations, including through lower sales, the termination of business relationships and associate retention and recruiting efforts. Moreover, failure to adequately predict customer demand and consumer spending patterns or otherwise optimize and operate our distribution and fulfillment centers could result in excess or insufficient inventory, service interruptions and increased costs, any of which could significantly harm our business. As we continue to add new fulfillment centers, our fulfillment and technology networks become increasingly complex and operating them becomes more challenging. There can be",
    "item7": "ITEM 7.MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n \n ITEM 7.\n MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n Overview\n This discussion, which presents our results for the fiscal years ended January 31, 2024 (\"fiscal 2024\"), January 31, 2023 (\"fiscal 2023\") and January 31, 2022 (\"fiscal 2022\"), should be read in conjunction with our Consolidated Financial Statements and the accompanying notes.  We intend for this discussion to provide the reader with information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from period to period and the primary factors that accounted for those changes.  We also discuss certain performance metrics that management uses to assess the Company's performance.  Additionally, the discussion provides information about the financial results of each of the three segments to provide a better understanding of how each of those segments and its results of operations affect the financial position and results of operations of the Company as a whole.\n Throughout this Item 7, we discuss segment operating income, comparable store and club sales and other measures.  Management measures the results of the Company's segments using each segment's operating income, including certain corporate overhead allocations, as well as other measures.  From time to time, we revise the measurement of each segment's operating income and other measures as determined by the information regularly reviewed by our chief operating decision maker.\n Management also measures the results of comparable store and club sales, or comparable sales, a metric that indicates the performance of our existing stores and clubs by measuring the change in sales for such stores and clubs, for a particular period from the corresponding period in the previous year.  Walmart's definition of comparable sales includes sales from stores and clubs open for the previous 12 months, including remodels, relocations, expansions and conversions, as well as eCommerce sales.  We measure the eCommerce sales impact by including all sales initiated digitally, including omni-channel transactions which are fulfilled through our stores and clubs as well as certain other business offerings that are part of our ecosystem, such as our Walmart Connect advertising business.  Sales at a store that has changed in format are excluded from comparable sales when the conversion of that store is accompanied by a relocation or expansion that results in a change in the store's retail square feet of more than five percent.  Sales related to divested businesses are excluded from comparable sales, and sales related to acquisitions are excluded until such acquisitions have been owned for 12 months.  Comparable sales are also referred to as \"same-store\" sales by others within the retail industry.  The method of calculating comparable sales varies across the retail industry.  As a result, our calculation of comparable sales is not necessarily comparable to similarly titled measures reported by other companies.\n In discussing our operating results, the term currency exchange rates refers to the currency exchange rates we use to convert the operating results for countries where the functional currency is not the U.S. dollar into U.S. dollars.  We calculate the effect of changes in currency exchange rates as the difference between current period activity translated using the current period's currency exchange rates and the comparable prior year period's currency exchange rates. Additionally, no currency exchange rate fluctuations are calculated for non-USD acquisitions until owned for 12 months.  Throughout our discussion, we refer to the results of this calculation as the impact of currency exchange rate fluctuations.  Volatility in currency exchange rates may impact the results, including net sales and operating income, of the Company and the Walmart International segment in the future.\n On February 23, 2024, the Company effected a 3-for-1 forward split of its common stock and a proportionate increase in the number of authorized shares. All share and per share information, including share based compensation, throughout this Annual Report on Form 10-K has been retroactively adjusted to reflect the stock split.\n We have taken certain strategic actions across our segments, including an increased emphasis on investments in automation and supply chain as well as diversifying our earnings streams through category and business mix.  Additionally, in the Walmart International segment, we have taken strategic actions to reshape our portfolio including the following highlights over the last three years:\n \"In February 2021, we completed the sale of Asda for net consideration of $9.6 billion. Refer toNote 12.\n \"\n In February 2021, we completed the sale of Asda for net consideration of $9.6 billion. Refer to\n Note 12\n .\n \"In March 2021, we completed the sale of Seiyu for net consideration of $1.2 billion.  Refer toNote 12.\n In March 2021, we completed the sale of Seiyu for net consideration of $1.2 billion.  Refer to\n \"In November 2022, we completed the buyout of the noncontrolling interest shareholders of our Massmart subsidiary (Refer toNote 3) and in December 2022, we exited operations in certain countries in Africa.\n In November 2022, we completed the buyout of the noncontrolling interest shareholders of our Massmart subsidiary (Refer to\n Note 3\n ) and in December 2022, we exited operations in certain countries in Africa.\n \"In December 2022, we increased our ownership in PhonePe as part of the separation from our majority-owned Flipkart subsidiary.  Refer toNote 3.\n In December 2022, we increased our ownership in PhonePe as part of the separation from our majority-owned Flipkart subsidiary.  Refer to\n We operate in a highly competitive omni-channel retail industry in all of the markets we serve.  We face strong sales competition from other discount, department, drug, dollar, variety and specialty stores, warehouse clubs and supermarkets, as well as eCommerce, health and wellness, financial services, advertising and data service businesses.  Many of these competitors are national, regional or international chains or have a national or international omni-channel or eCommerce presence.  We compete with a number of companies for attracting and retaining quality associates.  We, along with other retail companies, are\n 36\n influenced by a number of factors including, but not limited to: catastrophic events, weather and other risks related to climate change, global health epidemics and pandemics, competitive pressures, consumer disposable income, consumer debt levels and buying patterns, consumer credit availability, disruptions in supply chain, inventory management, cost and availability of goods, currency exchange rate fluctuations, customer preferences, inflation, deflation, fuel and energy prices, general economic conditions, insurance costs, interest rates, labor availability and costs, tax rates, the imposition of tariffs, cybersecurity attacks and unemployment.  Further information on the factors that can affect our operating results and on certain risks to our Company and an investment in its securities can be found herein under \"Item 1A. Risk Factors.\"\n influenced by a number of factors including, but not limited to: catastrophic events, weather and other risks related to climate change, global health epidemics and pandemics, competitive pressures, consumer disposable income, consumer debt levels and buying patterns, consumer credit availability, disruptions in supply chain, inventory management, cost and availability of goods, currency exchange rate fluctuations, customer preferences, inflation, deflation, fuel and energy prices, general economic conditions, insurance costs, interest rates, labor availability and costs, tax rates, the imposition of tariffs, cybersecu",
    "item7a": "ITEM 7A.QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n \n ITEM 7A.\n QUANTITATIVE AND QUALITATIVE DISCLOSURES ABOUT MARKET RISK\n Market Risk\n In addition to the risks inherent in our operations, we are exposed to certain market risks, including changes in interest rates, currency exchange rates and the fair values of certain equity and equity method investments measured on a recurring basis.\n The analysis presented below for each of our market risk sensitive instruments is based on a hypothetical scenario used to calibrate potential risk and does not represent our view of future market changes.  The effect of a change in a particular assumption is calculated without adjusting any other assumption.  In reality, however, a change in one factor could cause a change in another, which may magnify or negate other sensitivities.\n Interest Rate Risk\n We are exposed to changes in interest rates as a result of our short-term borrowings and long-term debt.  We hedge a portion of our interest rate risk by managing the mix of fixed and variable rate debt and by entering into interest rate swaps.  For fiscal 2024, the net fair value of our interest rate swaps increased $35 million primarily due to fluctuations in market interest rates.\n 48\n The table below provides information about our financial instruments that are sensitive to changes in interest rates.  For long-term debt, the table represents the principal cash flows and related weighted-average interest rates by expected maturity dates.  For interest rate swaps, the table represents the contractual cash flows and weighted-average interest rates by the contractual maturity date, unless otherwise noted.  The notional amounts are used to calculate contractual cash flows to be exchanged under the contracts.  The weighted-average variable rates are based upon prevailing market rates as of January 31, 2024.\n Expected Maturity Date(Amounts in millions)Fiscal 2025Fiscal 2026Fiscal 2027Fiscal 2028Fiscal 2029ThereafterTotalLiabilitiesShort-term borrowings:Variable rate$878$$$$$$878Weighted-average interest rate7.7%%%%%%7.7%Long-term debt(1):Fixed rate$3,447$2,600$3,483$1,760$3,458$24,831$39,579Weighted-average interest rate3.0%3.8%2.5%3.6%3.0%4.5%3.9%Interest rate derivativesInterest rate swaps:Fixed to variable$1,500$$$$1,250$3,521$6,271Weighted-average pay rate6.7%%%%5.7%6.9%6.6%Weighted-average receive rate3.3%%%%1.5%2.9%2.7%\n Expected Maturity Date\n (Amounts in millions)Fiscal 2025Fiscal 2026Fiscal 2027Fiscal 2028Fiscal 2029ThereafterTotal\n (Amounts in millions)\n Fiscal 2025\n Fiscal 2026\n Fiscal 2027\n Fiscal 2028\n Fiscal 2029\n Thereafter\n Total\n Liabilities\n Short-term borrowings:\n Variable rate$878$$$$$$878\n Variable rate\n $\n 878\n Weighted-average interest rate7.7%%%%%%7.7%\n Weighted-average interest rate\n 7.7\n %\n Long-term debt(1):\n Long-term debt\n (1)\n :\n Fixed rate$3,447$2,600$3,483$1,760$3,458$24,831$39,579\n Fixed rate\n 3,447\n 2,600\n 3,483\n 1,760\n 3,458\n 24,831\n 39,579\n Weighted-average interest rate3.0%3.8%2.5%3.6%3.0%4.5%3.9%\n 3.0\n 3.8\n 2.5\n 3.6\n 4.5\n 3.9\n Interest rate derivatives\n Interest rate swaps:\n Fixed to variable$1,500$$$$1,250$3,521$6,271\n Fixed to variable\n 1,500\n 1,250\n 3,521\n 6,271\n Weighted-average pay rate6.7%%%%5.7%6.9%6.6%\n Weighted-average pay rate\n 6.7\n 5.7\n 6.9\n 6.6\n Weighted-average receive rate3.3%%%%1.5%2.9%2.7%\n Weighted-average receive rate\n 3.3\n 1.5\n 2.9\n 2.7\n (1)Includes deferred loan costs, discounts, fair value hedges, foreign-held debt and secured debt.\n Includes deferred loan costs, discounts, fair value hedges, foreign-held debt and secured debt.\n As of January 31, 2024, our variable rate borrowings, including the effect of our commercial paper and interest rate swaps, represented 18% of our total short-term and long-term debt.  Based on January 31, 2024 debt levels, a 100 basis point change in prevailing market rates would cause our annual interest costs to change by approximately $0.1 billion.\n Foreign Currency Risk\n We are exposed to fluctuations in currency exchange rates as a result of our investments and operations in countries other than the U.S., as well as our foreign-currency-denominated long-term debt.  For fiscal 2024, movements in currency exchange rates and the related impact on the translation of the balance sheets resulted in the $0.3 billion net gain in the currency translation and other category of accumulated other comprehensive loss.\n We hedge a portion of our foreign currency risk by entering into currency swaps.  The aggregate fair value of these swaps was in a liability position of $1.3 billion and $1.4 billion as of January 31, 2024 and January 31, 2023, respectively.  The change in the fair value of these swaps was due to fluctuations in currency exchange rates, primarily due to the strengthening of certain currencies relative to the U.S. dollar in fiscal 2024.  The hypothetical result of a uniform 10% weakening in the value of the U.S. dollar relative to other currencies underlying these swaps would have resulted in a change in the value of the swaps of $0.7 billion.  A hypothetical 10% change in interest rates underlying these swaps from the market rates in effect as of January 31, 2024 would have resulted in a change in the value of the swaps of $0.1 billion.\n In certain countries, we also enter into immaterial foreign currency forward contracts to hedge the purchase and payment of purchase commitments denominated in non-functional currencies.\n Investment Risk\n We are exposed to investment risk primarily related to changes in the fair value of certain equity investments, including certain immaterial equity method investments where we have elected the fair value option, measured on a recurring basis.  The amounts of gains and losses included in earnings from fair value changes for these investments are recorded within other gains and losses and resulted in a net loss of $3.8 billion in fiscal 2024 primarily due to net decreases in the underlying stock prices of these investments. As of January 31, 2024, the fair value of our equity investments, including certain equity method investments, measured on a recurring basis was $7.2 billion.  As of January 31, 2024, a hypothetical 10% change in the stock price of such investments would have changed the fair value of such investments by approximately $0.7 billion.\n 49\n"
}