{
    "cik": 1437107,
    "cusip6": "934423",
    "cusip": [
        "934423104"
    ],
    "names": [
        "WARNER BROS DISCOVERY INC"
    ],
    "source": "https://www.sec.gov/Archives/edgar/data/1437107/000143710724000017/wbd-20231231.htm",
    "item1": "ITEM 1. Business.\n For convenience, the terms \"Warner Bros. Discovery\", \"WBD\", the \"Company,\" \"we,\" \"us\" or \"our\" are used in this Annual Report on Form 10-K to refer to both Warner Bros. Discovery, Inc. and collectively to Warner Bros. Discovery, Inc. and one or more of its consolidated subsidiaries, unless the context otherwise requires.\n Merger with the WarnerMedia Business of AT&T\n On April 8, 2022 (the \"Closing Date\"), Discovery, Inc. (\"Discovery\") completed its merger (the \"Merger\") with the WarnerMedia business (the \"WarnerMedia Business\", \"WM Business\" or \"WM\") of AT&T Inc. (\"AT&T\") and changed its name to Warner Bros. Discovery, Inc. On April 11, 2022, the Company's shares started trading on the Nasdaq Global Select Market (\"Nasdaq\") under the trading symbol WBD.\n The Merger was executed through a Reverse Morris Trust type transaction, under which WM was distributed to AT&T's shareholders via a pro rata distribution, and immediately thereafter, combined with Discovery. (See Note 3 and Note 4 to the accompanying consolidated financial statements). Prior to the Merger, WarnerMedia Holdings, Inc. (\"WMH\") distributed $40.5 billion to AT&T (subject to working capital and other adjustments) in a combination of cash, debt securities, and WM's retention of certain debt. Discovery transferred purchase consideration of $42.4 billion in equity to AT&T shareholders in the Merger. In August 2022, the Company and AT&T finalized the post-closing working capital settlement process, which resulted in the Company receiving a $1.2 billion payment from AT&T in the third quarter of 2022 in lieu of adjusting the equity issued as consideration in the Merger. AT&T shareholders received shares of WBD Series A common stock (\"WBD common stock\") in the Merger representing 71% of the combined Company and the Company's pre-Merger shareholders continued to own 29% of the combined Company, in each case on a fully diluted basis.\n Discovery was deemed to be the accounting acquirer of the WM Business for accounting purposes under U.S. generally accepted accounting principles (\"U.S. GAAP\"); therefore, Discovery is considered the Company's predecessor and the historical financial statements of Discovery prior to April 8, 2022, are reflected in this Annual Report on Form 10-K as the Company's historical financial statements. Accordingly, the financial results of the Company as of and for any periods prior to April 8, 2022 do not include the financial results of the WM Business and current and future results will not be comparable to results prior to the Merger.\n Industry Trends\n The WGA and SAG-AFTRA went on strike in May and July 2023, respectively, following the expiration of their respective collective bargaining agreements with the Alliance of Motion Picture and Television Producers (\"AMPTP\"). The WGA strike ended on September 27, 2023, and a new collective bargaining agreement was ratified on October 9, 2023. The SAG-AFTRA strike ended on November 9, 2023, and a new collective bargaining agreement was ratified on December 5, 2023.\n The strikes had a material impact on the operations and results of the Company, including a pause on certain theatrical and television productions. Effects included a positive impact on cash flow from operations attributed to delayed production spend, and a negative impact on the results of operations attributed to timing and performance of the 2023 film slate, as well as the Company's ability to produce, license, and deliver content.\n Other headwinds in the industry, such as continued pressures on linear distribution and soft advertising markets in the U.S., have had, and are expected to continue to have, a material impact on the operations and results of the Company, including a negative impact on the results of operations attributed to declines in linear advertising revenue.\n We continue to closely monitor the ongoing impact of industry trends to our business; however, the full effects on our operations and results will depend on future developments, which are highly uncertain and cannot be predicted.\n 5\n \n Description of Business\n Warner Bros. Discovery is a premier global media and entertainment company that provides audiences with a differentiated portfolio of content, brands and franchises across television, film, streaming, and gaming. Some of our iconic brands and franchises include Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, discovery+, CNN, Discovery Channel, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings.\n We are home to powerful creative engines and one of the largest collections of owned content in the world. WBD has one of the strongest hands in the industry in terms of the completeness and quality of assets and intellectual property across sports, news, lifestyle, and entertainment in virtually every region of the globe and in most languages. We serve audiences and consumers around the world with content that informs, entertains, and, when at its best, inspires.\n Our asset mix positions us to drive a balanced approach to creating long-term value for shareholders. It represents the full entertainment ecosystem, and the ability to serve consumers across the entire spectrum of offerings from domestic and international networks, premium pay-TV, streaming, production and release of feature films and original series, related consumer products and themed experience licensing, and interactive gaming.\n We generate revenue from the sale of advertising on our networks and digital platforms (advertising revenue); fees charged to distributors that carry our network brands and programming, including cable, direct-to-home (\"DTH\") satellite, telecommunication and digital service providers, as well as through direct-to-consumer (\"DTC\") subscription services (distribution revenue); the release of feature films for initial exhibition in theaters, the licensing of feature films and television programs to various television, subscription video on demand (\"SVOD\") and other digital markets, distribution of feature films and television programs in the physical and digital home entertainment markets, sales of console games and mobile in-game content, sublicensing of sports rights, and licensing of intellectual property such as characters and brands (content revenue); and other sources such as studio tours and production services (other revenue).\n Segments\n As of December 31, 2023, we classified our operations in three reportable segments:\n \"Studios- Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n \"\n Studios\n - Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n \"Networks- Our Networks segment primarily consists of our domestic and international television networks.\n Networks\n - Our Networks segment primarily consists of our domestic and international television networks.\n \"DTC- Our DTC segment primarily consists of our premium pay-TV and streaming services.\n DTC\n - ",
    "item1a": "ITEM 1A. Risk Factors.\n Investing in our securities involves risk. In addition to the other information contained in this Annual Report on Form 10-K, you should consider the following risk factors before investing in our securities. Additional risks and uncertainties not presently known to us or that we currently believe not to be material may also adversely impact our business, results of operations, financial position and cash flows.\n Risks Related to Our Business and Industry\n Our businesses operate in highly competitive industries and if we are unable to compete effectively, our business, financial condition and results of operations could suffer.\n The media and entertainment industries in which we compete for viewers, distribution and advertising are highly competitive. We face increased competitive pressure for talent, content, audiences, subscribers, service providers, advertising spending and production infrastructure. We compete with a broad range of companies engaged in media, entertainment and communications services, some of whom have interests in multiple media and entertainment businesses that are often vertically integrated, all vying for consumer time, attention and discretionary spending. In addition, the composition of our competitors has evolved with the entrance of new market participants, including companies in adjacent sectors with significant financial, marketing and other resources, greater efficiencies of scale, fewer regulatory burdens and more competitive pricing. Such competitors could also have preferential access to important technologies, customer data or other competitive information. Our competitors may also consolidate or enter into business combinations or alliances that strengthen their competitive positions. Our ability to compete successfully depends on a number of factors, including our ability to consistently acquire and produce high quality content amidst a rapidly evolving competitive landscape. In addition, new technology, including generative artificial intelligence (\"AI\"), is evolving rapidly and our ability to compete could be adversely affected if our competitors gain an advantage by using such technologies. There can be no assurance that we will be able to compete successfully in the future against existing or new competitors, or that competition in the marketplace will not have an adverse effect on our business, financial condition or results of operations.\n Our advertising revenues have been, and may continue to be, adversely impacted by several factors, including the changing landscape of television advertising spending and advertising market conditions.\n We derive substantial revenues from the sale of advertising, and a continuing decline in advertising revenues could have a material adverse effect on our business, financial condition or results of operations.\n Shifting consumer preferences toward streaming services and other digital products and the increasing number of entertainment choices has intensified audience fragmentation and reduced content viewership through traditional linear distribution models. This has changed the landscape of traditional television advertising spending, prompting advertisers to shift their strategies, and ultimately advertising spend, toward streaming services and other digital products to reach target audiences. In addition, a number of other streaming services with larger subscriber bases and greater household penetration have recently introduced ad-supported tiers.The increase of digital advertising available in the marketplace, due to both the introduction of ad-supported tiers in competing streaming services and the expansion of free ad-supported television (\"FAST\") products, has increased the competition we face for advertising expenditures for both our traditional linear networks and the ad-supported tiers in our streaming services, and also limited our ability to demand higher rates for our linear and digital advertising inventory or even the same rates that we previously charged for our advertising inventory prior to the surge in digital advertising. There can be no assurance that we can successfully navigate the evolving streaming and digital advertising market or that the advertising revenues we generate in that market will replace the declines in advertising revenues generated from our traditional linear business.\n Shifting consumer preferences toward streaming services and other digital products and the increasing number of entertainment choices has intensified audience fragmentation and reduced content viewership through traditional linear distribution models. This has changed the landscape of traditional television advertising spending, prompting advertisers to shift their strategies, and ultimately advertising spend, toward streaming services and other digital products to reach target audiences. In addition, a number of other streaming services with larger subscriber bases and greater household penetration have recently introduced ad-supported tiers.\n \n The increase of digital advertising available in the marketplace, due to both the introduction of ad-supported tiers in competing streaming services and the expansion of free ad-supported television (\"FAST\") products, has increased the competition we face for advertising expenditures for both our traditional linear networks and the ad-supported tiers in our streaming services, and also limited our ability to demand higher rates for our linear and digital advertising inventory or even the same rates that we previously charged for our advertising inventory prior to the surge in digital advertising. There can be no assurance that we can successfully navigate the evolving streaming and digital advertising market or that the advertising revenues we generate in that market will replace the declines in advertising revenues generated from our traditional linear business.\n The advertising market is also sensitive to general economic conditions and consumer buying patterns. Financial instability or a general decline in economic conditions in the U.S. and other countries where our content is distributed could adversely affect the spending priorities of our advertising partners who might reduce their spending, which could result in a decrease in advertising rates and volume and in our overall advertising revenues. Natural and other disasters, pandemics, acts of terrorism, political uncertainty or hostilities could also lead to a reduction in domestic and international advertising expenditures, which could also have an adverse effect on our advertising revenues.\n Our advertising revenues are also dependent on our ability to measure viewership and audience engagement across all platforms and in all geographic regions. Although audience measurement systems have evolved and improved to capture the viewership of programming across multiple platforms, they still do not fully capture all viewership across streaming and other digital platforms and advertisers may not be willing to pay advertising rates based on the viewership that is not being measured. In certain geographic regions, our ability to fully capture viewership information may be limited by local laws and regulations.\n As further discussed in other parts of this Item 1a. Risk Factors, our ability to generate advertising revenue is also dependent on our ability to compete in highly competitive, rapidly evolving industries, our ability to respond to changes in consumer behavior and our ability to consistently achieve audience acceptance of our content and brands.\n 13\n Changes in consumer behavior, as well as evolving technologies and distribution models, may negatively affect our business, financial condition or results of operations.\n Our success depends on our ability to anticipate and adapt to changes in consumer behavior and shifting content consumption patterns. The ways in which viewers consume content, and technology and distribution models in the media",
    "item7": "ITEM 7. Management's Discussion and Analysis of Financial Condition and Results of Operations.\n Management's discussion and analysis of financial condition and results of operations is a supplement to and should be read in conjunction with the accompanying consolidated financial statements and related notes. This section provides additional information regarding our businesses, current developments, results of operations, cash flows, financial condition, contractual commitments, critical accounting policies, and estimates that require significant judgment and thus have the most significant potential impact on our consolidated financial statements. This discussion and analysis is intended to better allow investors to view the company from management's perspective.\n 32\n \n This section provides an analysis of our financial results for the fiscal year ended December 31, 2023 compared to the fiscal year ended December 31, 2022. A discussion of our results of operations and liquidity for the fiscal year ended December 31, 2022 compared to the fiscal year ended December 31, 2021 can be found under Item 7 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2022, filed on February 24, 2022, which is available free of charge on the SEC's website at www.sec.gov and our Investor Relations website at ir.wbd.com. The information contained on our website is not part of this Annual Report on Form 10-K and is not incorporated by reference herein.\n BUSINESS OVERVIEW\n On April 8, 2022, Discovery, a global media company that provides content across multiple distribution platforms, including linear, free-to-air, and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing arrangements, and DTC subscription products, completed its Merger with the WM Business of AT&T and changed its name from \"Discovery, Inc.\" to \"Warner Bros. Discovery, Inc.\" On April 11, 2022, our shares started trading on Nasdaq under the trading symbol WBD. (See Note 3 and Note 4 to the accompanying consolidated financial statements.)\n Warner Bros. Discovery is a premier global media and entertainment company that provides audiences with a differentiated portfolio of content, brands and franchises across television, film, streaming, and gaming. Some of our iconic brands and franchises include Warner Bros. Motion Picture Group, Warner Bros. Television Group, DC, HBO, HBO Max, Max, discovery+, CNN, Discovery Channel, HGTV, Food Network, TNT Sports, TBS, TLC, OWN, Warner Bros. Games, Batman, Superman, Wonder Woman, Harry Potter, Looney Tunes, Hanna-Barbera, Game of Thrones, and The Lord of the Rings. For a discussion of our global portfolio see our business overview set forth in Item 1, \"Business\" in this Annual Report on Form 10-K.\n In connection with the Merger, we have announced and taken actions to implement projects to achieve cost synergies for the Company. We finalized the framework supporting our ongoing restructuring and transformation initiatives during the year ended December 31, 2022, which includes, among other things, strategic content programming assessments, organization restructuring, facility consolidation activities, and other contract termination costs. We expect that we will incur approximately $4.1 - $5.3 billion in pre-tax restructuring charges, of which we have incurred $4.2 billion as of December 31, 2023. Of the total expected pre-tax restructuring charges, we expect total cash expenditures to be $1.0 - $1.5 billion. We incurred $0.5 billion of pre-tax restructuring charges during the year ended December 31, 2023 related to this plan. While our restructuring efforts are ongoing, the restructuring program is expected to be substantially completed by the end of 2024.\n As of December 31, 2023, we classified our operations in three reportable segments:\n \"Studios- Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n \"\n Studios\n - Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n \"Networks- Our Networks segment primarily consists of our domestic and international television networks.\n Networks\n - Our Networks segment primarily consists of our domestic and international television networks.\n \"DTC- Our DTC segment primarily consists of our premium pay-TV and streaming services.\n DTC\n - Our DTC segment primarily consists of our premium pay-TV and streaming services.\n Our segment presentation was aligned with our management structure and the financial information management uses to make decisions about operating matters, such as the allocation of resources and business performance assessments.\n For further discussion of financial information for our segments and the geographical areas in which we do business, our content development activities, and revenues, see our business overview set forth in Item 1, \"Business\" and Note 23 to the consolidated financial statements included in Item 8, \"Financial Statements and Supplementary Data\" in this Annual Report on Form 10-K.\n 33\n RESULTS OF OPERATIONS\n The discussion below compares our actual results for the year ended December 31, 2023 to our pro forma combined results for the year ended December 31, 2022, as if the Merger occurred on January 1, 2021. Management believes reviewing our pro forma combined operating results in addition to actual operating results is useful in identifying trends in, or reaching conclusions regarding, the overall operating performance of our businesses. Our Studios, Networks, DTC, Corporate, and inter-segment eliminations information is based on the historical operating results of the respective segments and include, where applicable, adjustments for (i) additional costs of revenues from the fair value step-up of film and television library, (ii) additional amortization expense related to acquired intangible assets, (iii) additional depreciation expense from the fair value of property and equipment, (iv) transaction costs and other one-time non-recurring costs, (v) additional interest expense for borrowings related to the Merger and amortization associated with fair value adjustments of debt assumed, (vi) changes to align accounting policies, (vii) elimination of intercompany activity, and (viii) associated tax-related impacts of adjustments.\n Adjustments do not include costs related to integration activities, cost savings or synergies that have been or may be achieved by the combined businesses. Pro forma amounts are not necessarily indicative of what our results would have been had we operated the combined businesses since January 1, 2021 and should not be taken as indicative of the Company's future consolidated results of operations.\n Actual amounts for the year ended December 31, 2022 include results of operations for Discovery for the entire period and WM for the period subsequent to the completion of the Merger on April 8, 2022.\n Foreign Exchange Impacting Comparability\n In addition to the Merger, the impact of exchange rates on our business is an important factor in understanding period-to-period comparisons of our results. For example",
    "item7a": "ITEM 7A. Quantitative and Qualitative Disclosures about Market Risk.\n Our financial position, earnings and cash flows are exposed to market risks and can be affected by, among other things, economic conditions, interest rate changes, foreign currency fluctuations, and changes in the market values of investments. We have established policies, procedures and internal processes governing our management of market risks and the use of financial instruments to manage our exposure to such risks.\n Interest Rates\n We are exposed to the impact of interest rate changes primarily through our actual and potential borrowing activities. During the year ended December 31, 2023, we had access to a $6.0 billion multicurrency revolving credit facility. We had no outstanding borrowings as of December 31, 2023. We also have access to a commercial paper program, which had no outstanding borrowings as of December 31, 2023. The interest rate on borrowings under the revolving credit facility is based on a floating rate based on the applicable currency of the borrowing plus a margin. The revolving credit facility matures in June 2026, with the option for up to two additional 364-day renewal periods. As of December 31, 2023, we had $43.9 billion of fixed-rate senior notes, at par value.\n Our current objectives in managing exposure to interest rate changes are to limit the impact of interest rates on earnings and cash flows. To achieve these objectives, we may enter into derivative instruments, effectively converting fixed rate borrowings to variable rate borrowings indexed to benchmark interest rates in order to reduce the amount of interest paid, or to limit the impact of volatility in interest rates on future issuances of fixed rate debt. (See Note 13 to the accompanying consolidated financial statements.)\n 52\n \n As of December 31, 2023, the fair value of our outstanding senior notes, including accrued interest, was $40.5 billion. The fair value of our long-term debt may vary as a result of market conditions and other factors. A change in market interest rates will impact the fair market value of our fixed rate debt. The potential change in fair value of these senior notes from a 100 basis-point increase in quoted interest rates across all maturities, often referred to as a parallel shift in the yield curve, would be a decrease in fair value of approximately $2.9 billion as of December 31, 2023.\n Foreign Currency Exchange Rates\n We transact business globally and are subject to risks associated with changing foreign currency exchange rates. Market risk refers to the risk of loss arising from adverse changes in foreign currency exchange rates. The risk of loss can be assessed from the perspective of adverse changes in fair values, cash flows, and future earnings. We operate from hubs in EMEA, Latin America, and Asia, with net earnings reinvested locally and working capital requirements met from existing liquid funds. To the extent such funds are not sufficient to meet working capital requirements, drawdowns in the appropriate local currency are available from intercompany borrowings or from our revolving credit facility. The earnings of certain international operations are expected to be reinvested in those businesses indefinitely.\n The functional currency of most of our international subsidiaries is the local currency. We are exposed to foreign currency risk to the extent that we enter into transactions denominated in currencies other than our subsidiaries' respective functional currencies (\"non-functional currency risk\"). Such transactions include affiliate and ad sales arrangements, content arrangements, equipment and other vendor purchases, and intercompany transactions. Changes in exchange rates with respect to amounts recorded in our consolidated balance sheets related to these items will result in unrealized foreign currency transaction gains and losses based upon period-end exchange rates. We also record realized foreign currency transaction gains and losses upon settlement of the transactions. Moreover, we will experience fluctuations in our revenues and expenses solely as a result of changes in foreign currency exchange rates.\n We also are exposed to unfavorable and potentially volatile fluctuations of the U.S. dollar, which is our reporting currency, against the currencies of our operating subsidiaries when their respective financial statements are translated into U.S. dollars for inclusion in our consolidated financial statements. Cumulative translation adjustments are recorded in accumulated other comprehensive loss as a separate component of equity. Any increase or decrease in the value of the U.S. dollar against any foreign functional currency of one of our operating subsidiaries will cause us to experience unrealized foreign currency translation gains or losses with respect to amounts already invested in such foreign currencies. Accordingly, we may experience a negative impact on our net income, other comprehensive (loss) income and equity with respect to our holdings solely as a result of changes in foreign currency.\n The majority of our foreign currency exposure is tied to Europe and Latin America. We may enter into derivative instruments that change in value as foreign currency exchange rates change to hedge certain exposures associated with affiliate revenue, the cost of producing or acquiring content, certain intercompany transactions, or in connection with forecasted business combinations. These contracts hedge forecasted foreign currency transactions in order to mitigate fluctuations in our earnings and cash flows associated with changes in foreign currency exchange rates. Our objective in managing exposure to foreign currency fluctuations is to reduce volatility of earnings and cash flows. Most of our non-functional currency risks related to our revenue, operating expenses and capital expenditures were not hedged as of December 31, 2023. We generally do not hedge against the risk that we may incur non-cash losses upon the translation of the financial statements of our subsidiaries and affiliates into U.S. dollars. (See Note 13 to the accompanying consolidated financial statements.)\n Derivatives\n We may use derivative financial instruments to modify our exposure to exogenous events and market risks from changes in foreign currency exchange rates and interest rates. We do not use derivatives unless there is an underlying exposure. While derivatives are used to mitigate cash flow risk and the risk of declines in fair value, they also limit potential economic benefits to our business in the event of positive shifts in foreign currency exchange rates and interest rates. We do not hold or enter into financial instruments for speculative trading purposes. (See Note 13 to the accompanying consolidated financial statements.)\n 53\n Market Values of Investments andLiabilities\n In addition to derivatives, we had investments in entities accounted for as equity method investments, equity investments, and other highly liquid instruments, such as money market funds and mutual funds, that are accounted for at fair value.We also have liabilities, such as deferred compensation, that are accounted for at fair value (See Note 10 and Note 14 to the accompanying consolidated financial statements). Investments in mutual funds include both fixed- and floating-rate interest earning securities that carry a degree of interest rate risk. Fixed-rate securities may have their fair market value adversely impacted by a rise in interest rates, while floating-rate securities may produce less income than predicted if interest rates fall. Due in part to these factors, our income from such investments may decrease in the future. Liabilities carried at fair value, such as deferred compensation, may experience capital gains that result in increased liabilities and expenses as the capital gains occur. We may enter into derivative financial instruments to hedge the risk of these market value c"
}